      PROCESS RENT                                                      00000010
000010******************************************************************00000020
000020 IDENTIFICATION DIVISION.                                         00000030
000030******************************************************************00000040
000040 PROGRAM-ID.    CCLB600.                                          00000050
000060 AUTHOR.        JEFF SWARD.                                       00000070
000080 DATE-WRITTEN.  12-12-83.                                         00000090
000100 DATE-COMPILED.                                                   00000110
000110 EJECT                                                            00000120
000120*================================================================*00000130
000130*= DESCBOX |  CCLB600      FUNCTION BOX               | DESCBOX =*00000140
000140*================================================================*00000150
000150*=DESC-BOX TECH-BOX COPY-BOX PARM-BOX LINK-BOX CODE-BOX CLOG-BOX=*00000160
000160*================================================================*00000170
000170*= PGM ID   : CCLB600   TYPE : COBOL2        SYS ID : LA351     =*00000180
000180*= VERSION  : 14.04     DIAG :                                  =*00000190
000190*= SYSTEM   : LA351 DATA ACQUISITION.                           =*00000200
000200*= FUNCTION : OUTPUT AND COUNT FOR CCLA351.                     =*00000210
000210*=------------------------ NARRATIVE ---------------------------=*00000220
000220*= THIS PROGRAM CONTROLS THE OUTPUT PROCESS FOR CCLA351.        =*00000230
000230*================================================================*00000240
000240 EJECT                                                            00000250
000250*================================================================*00000260
000260*= TECHBOX |           SPECIAL TECHNIQUES             | TECHBOX =*00000270
000270*================================================================*00000280
000280*=DESC-BOX TECH-BOX COPY-BOX PARM-BOX LINK-BOX CODE-BOX CLOG-BOX=*00000290
000290*=--------------------------------------------------------------=*00000300
000300*= NONE.                                                        =*00000310
000310*================================================================*00000320
000320 EJECT                                                            00000330
000330*================================================================*00000340
000340*= COPYBOX |                COPY CODE                 | COPYBOX =*00000350
000350*================================================================*00000360
000360*=DESC-BOX TECH-BOX COPY-BOX PARM-BOX LINK-BOX CODE-BOX CLOG-BOX=*00000370
000370*================================================================*00000380
000380*=   COPY ID         DESCRIPTION                                =*00000390
000390*=                                                              =*00000400
000400*= : CCLAERC       : EVENT REASON CODES                         =*00000410
000420*= : CCLATLC       : TABLE LIMIT CONSTANTS                      =*00000430
000430*= : CCLAMBHS      : CCSS OUTPUT - TRADE BATCH HEADER           =*00000440
000440*= : CCLAMCOS      : CCSS OUTPUT - CONSUMER                     =*00000450
000440*= : CCLAMEMP      : CCSS OUTPUT - EMPLOYER INFORMATION         =*00000450
000450*= : CCLAMKCS      : CCSS OUTPUT - KEY CHANGE                   =*00000460
000460*= : CCLAMTBI      : CCSS OUTPUT - TRADE BASE INDICATORS        =*00000470
000470*= : CCLAMTBS      : CCSS OUTPUT - TRADE BASE                   =*00000480
000480*= : CCLAMTHS      : CCSS OUTPUT - TRANSACTION HEADER           =*00000490
000490*= : CCLAMTKI      : CCSS OUTPUT - TRADE KEY INDICATORS         =*00000500
000500*= : CCLAMTKS      : CCSS OUTPUT - TRADE KEY                    =*00000510
000500*= : CCLAPBKY      : CCSS OUTPUT - PUBLIC RECORD BANKRUPTCY     =*00000510
000500*= : CCLAPCKY      : CCSS OUTPUT - PUBLIC RECORD CIVIL ACTION   =*00000510
000500*= : CCLAPLKY      : CCSS OUTPUT - PUBLIC RECORD LIEN           =*00000510
000500*= : CCLAPPLS      : CCSS OUTPUT - PUBLIC RECORD PLAINTIFF      =*00000510
000500*= : CCLAPTHS      : CCSS OUTPUT - PUBLIC RECORD TRANS HEADER   =*00000510
000760*= : CCLARTA       : CCSS REPORT & TOTALS FOR ONE SUBCODE (WTA) =*00000790
000760*= : CCLASCF       : SCORE CARD LAYOUT                          =*00000790
000520*= : CCLACCF       : COMMON CONTROL FLAGS                       =*00000530
000530*= : CCLACDA       : CONSUMER DATA AREA                         =*00000540
000540*= : CCLACRF       : COMMON RECORD FORMAT                       =*00000550
000560*= : CCLAIOT       : INPUT/OUTPUT TOTALS                        =*00000570
000580*= : CCLALDA       : LEGAL DATA AREA                            =*00000590
000590*= : CCLAOPS       : CONTROL DECK OPTIONS                       =*00000600
000730*= : CCLATDA       : TRADE DATA AREA                            =*00000760
000710*= : CCLATB10      : ZIP CODE RANGES                            =*00000730
000750*= : CCLACOA       : CCSS CONSUMER SEGMENT OVERFLOW COUNTS      =*00000780
000760*= : CCLARTA       : CCSS REPORT & TOTALS FOR ONE SUBCODE (RTA) =*00000790
000660*= : CCLASBX       : INDEX TABLE FOR TOTALS BY SUBCODE          =*00000680
000800*================================================================*00000830
000810 EJECT                                                            00000840
000820*================================================================*00000850
000830*= PARMBOX |            INPUT PARAMETERS              | PARMBOX =*00000860
000840*=--------------------------------------------------------------=*00000870
000850*=DESC-BOX TECH-BOX COPY-BOX PARM-BOX LINK-BOX CODE-BOX CLOG-BOX=*00000880
000860*=--------------------------------------------------------------=*00000890
000870*=   FIELD NAME      PURPOSE                                    =*00000900
000880*= : NONE          :                                            =*00000910
000890*================================================================*00000920
000900 EJECT                                                            00000930
000910*================================================================*00000940
000920*= LINKBOX |           PROGRAM CALLS                  | LINKBOX =*00000950
000930*================================================================*00000960
000940*=DESC-BOX TECH-BOX COPY-BOX PARM-BOX LINK-BOX CODE-BOX CLOG-BOX=*00000970
000950*================================================================*00000980
000960*=   MODULE      PURPOSE OF CALL/LINK                           =*00000990
000970*= : CCLC200   : SUBCODE TOTALS STORAGE AND RETRIEVAL           =*00001000
001010*= : CCLC640   : OUTPUT CCSS TRADE DATA UPDATE RECORDS          =*00001040
001020*= : CCLC645   : OUTPUT CCSS LEGAL DATA UPDATE RECORDS          =*00001050
001030*= : CCLC660   : OUTPUT DISCARD RECORDS                         =*00001060
001040*= : CCLC670   : OUTPUT RECYCLE RECORDS                         =*00001070
001040*= : CCLC680   : OUTPUT SCORECARD FILES                         =*00001070
001080*= : CCLC695   : CCSS OUTPUT RECORD REPORTS AT SUBCODE LEVEL    =*00001110
001090*= : CCLC700   : OUTPUT CONSUMER SEGMENT OVERFLOW REPORT RECORDS=*00001120
001100*================================================================*00001130
001110 EJECT                                                            00001140
001120*================================================================*00001150
001130*= CODEBOX |           RETURN  CODES                  | CODEBOX =*00001160
001140*================================================================*00001170
001150*=DESC-BOX TECH-BOX COPY-BOX PARM-BOX LINK-BOX CODE-BOX CLOG-BOX=*00001180
001160*================================================================*00001190
001170*=   RTN CODE    DESCRIPTION                                    =*00001200
001180*= :           : TERE ARE NO RETURN CODES AS SUCH.  THERE ARE  =* 00001210
001190*= :           : ABEND CODES AS DESCRIBED IN THE 'ACQUISITION   =*00001220
001200*= :           : AND COORDINATION RESOURCE MANUAL'.             =*00001230
001210*================================================================*00001240
001220 EJECT                                                            00001250
001230*================================================================*00001260
001240*= CLOGBOX |                CHANGE LOG                | CLOGBOX =*00001270
001250*=--------------------------------------------------------------=*00001360
      *================================================================*
      *= LA351              DATE : 06/24/22   PGM'R : HAMEE SYED      =*
      *= PR   : DAT-5024                      RQST'R: DENNIS TOBIN    =*
      *= DESC: ADD NEW CALL TO CCLCVTRK (MEDCIAL COLLECTIONS ,STATUS  =*
      *=       CHANGED FROM 62 TO DA)                                 =*
      *================================================================*
      *= LA351              DATE : 08/23/19   PGM'R : NAOKO GORSUCH   =*
      *= PR   : DAT-1604                      RQST'R: PAT FINNERAN    =*
      *= DESC: ADD NEW SPECIAL COMMENT CODE DE FOR DEBT EXTINGUISHMENT=*
      *=       IF FLAG IS SET THAT THE STATUS HAVE BEEN CHANGED TO DA =*
      *=       DUE TO SCC DE, INCREMENT THE COUNTER.                  =*
      *================================================================*
      *= LA351              DATE:  03/15/19   PGM'R: NAOKO GORSUCH    =*
      *= PR: 60825                            RQST'R: DENNIS TOBIN    =*
      *= DESC: ADD NEW DISCARD METRIC FOR MEDICAL COLLECTION RECORDS  =*
      *=       WITH ORIGINAL LOAN AMOUNT LESS THAN OR EQUAL TO MINIMUM=*
      *================================================================*
      *= LA351              DATE:  04/13/18   PGM'R: BARBARA YUSKO    =*
      *= PR: 59308                            RQST'R: INTERNAL        =*
      *= DESC    : CHANGE REFERENCES TO OPS-40-CYCLE-PROC-UNIT TO     =*
      *=           OPS-40-CYCLE-TBL07                                 =*
      *================================================================*
      *= LA351              DATE : 03/02/18   PGM'R : NAOKO GORSUCH   =*
      *= PR   : 60539                         RQST'R: MELINDA HOWLAND =*
      *= DESC: ADD NEW COUNTER FOR ACTUAL PAYMENT AMOUNTS THAT WERE   =*
      *=       CHANGED TO DEFAULT IF OVER 1 MILLION AND IF IT IS 10%  =*
      *=       OR GREATER THAN ORIGINAL LOAN AMOUNT OR CREDIT LIMIT   =*
      *================================================================*
      *= LA351              DATE:  09/15/17   PGM'R: BARBARA YUSKO    =*
      *= PR: 58367                            RQST'R: PAT FINNERAN    =*
      *= DESC    : INCREMENT NEW COUNTER WHEN STATUS 62 OR 93 REPORTED=*
      *=           FOR A COLLECTION THAT HAS A SPECIAL COMMENT THAT   =*
      *=           INDICATES THAT THE DEBT IS PAID BY INSURANCE       =*
      *================================================================*
      *= LA351              DATE:  09/15/17   PGM'R: BARBARA YUSKO    =*
      *= PR: 58362                            RQST'R: PAT FINNERAN    =*
      *= DESC    : ADD NEW MEDICAL DEBT MISCELLANEOUS AND DISCARD     =*
      *=           COUNTERS                                           =*
      *================================================================*
      *= LA351              DATE:  09/15/17   PGM'R: BARBARA YUSKO    =*
      *= PR: 58355                            RQST'R: PAT FINNERAN    =*
      *= DESC    : REMOVE REFERENCES TO OPS07 D1 OPTION.  INCREMENT   =*
      *=           METRICS FOR DATE OF BIRTH OMITTED AND MINORS       =*
      *=           DETECTED.                                          =*
      *================================================================*
      *= LA351              DATE:  09/15/17   PGM'R: BARBARA YUSKO    =*
      *= PR: 58353                            RQST'R: PAT FINNERAN    =*
      *= DESC    : ADD DISCARD CONDITIONS AND METRIC COUNTING FOR PII =*
      *=           ERRORS                                             =*
      *================================================================*
      *= LA351              DATE:  08/04/17   PGM'R: BARBARA YUSKO    =*
      *= PR : 59188                           RQST'R: MELINDA HOWLAND =*
      *= DESC    : REMOVE CODE RELATED TO ECOA CODE X RECYCLES        =*
      *================================================================*
      *= LA351              DATE:  04/14/17   PGM'R: BARBARA YUSKO    =*
      *= ICP: 57453                           RQST'R: DATA MANAGEMENT =*
      *= DESC    : IF ORIGINAL LOAN AMOUNT IS NOT VALID AND THE VENDOR=*
      *=           IS A COLLECTION REPORTER, AND THE STATUS ON THE    =*
      *=           RECORD IS NOT DA OR DF, DISCARD THE RECORD         =*
      *================================================================*
      *= LA351              DATE:  02/03/17   PGM'R: BARBARA YUSKO    =*
      *= ICP: 56501                           RQST'R: DATA MANAGEMENT =*
      *= DESC    : INCREMENT NEW MISCELLANEOUS AND DISCARD COUNTERS   =*
      *=           WHEN CREDITOR NAME IS INVALID DUE TO INVALID WORD/ =*
      *=           CREDITOR CLASS COMBINATIONS.  THE CORRESPONDING OLD=*
      *=           COUNTERS SHOULD BE INCREMENTED ONLY WHEN THE REJECT=*
      *=           IS FOR ANOTHER REASON.                             =*
      *================================================================*
      *= LA351              DATE:  11/04/16   PGM'R: BARBARA YUSKO    =*
      *= ICP: 57585                           RQST'R: PAT FINNERAN    =*
      *= DESC    : REMOVE CODE RELATED TO TRAN TYPE PROCESSING        =*
      *================================================================*
      *= LA351              DATE:  11/04/16   PGM'R: BARBARA YUSKO    =*
      *= ICP: 57584                           RQST'R: PAT FINNERAN    =*
      *= DESC    : REMOVE LOGIC FOR CORRECTION INDICATOR              =*
      *================================================================*
      *= LA351              DATE:  09/09/16   PGM'R: BARBARA YUSKO    =*
      *= ICP: 52684                           RQST'R: PAT FINNERAN    =*
      *= DESC    : INCREMENT NEW COUNTER WHEN COUNTRY CODE IS NOT     =*
      *=           BLANK, US, CN, OR MX                               =*
      *================================================================*
      *= LA351              DATE:  07/14/16   PGM'R : BARBARA YUSKO   =*
      *= ICP: 57772                           RQST'R: MICHAEL TSE     =*
      *= DESC    : CHANGE TDA-OCG-DO-GT-DOFD-1-90 TO                  =*
      *=           TDA-OCG-DO-GT-DOFD-1-30.                           =*
      *================================================================*
      *= LA351              DATE:  06/24/16   PGM'R: BARBARA YUSKO    =*
      *= ICP: 57053                           RQST'R: PAT FINNERAN    =*
      *= DESC    : ADD LOGIC TO INCREMENT A COUNTER BASED ON THE FLAG =*
      *=           SET IN CCLB200 TO INDICATE STATUS 62 CHANGED TO    =*
      *=           STATUS DA WHEN REPORTED BY A COLLECTION VENDOR WITH=*
      *=           DATE OPEN 1-90 DAYS GREATER THAN DATE OF FIRST     =*
      *=           DELINQUENCY                                        =*
      *================================================================*
      *= LA351              DATE:  06/24/16   PGM'R: BARBARA YUSKO    =*
      *= ICP: 56636                           RQST'R: PAT FINNERAN    =*
      *= DESC    : ADD LOGIC TO INCREMENT A COUNTER BASED ON THE FLAG =*
      *=           SET IN CCLB200 TO INDICATE STATUS 62 CHANGED TO    =*
      *=           STATUS DA WHEN REPORTED BY A COLLECTION VENDOR     =*
      *=           WITHOUT A VALID ORIGINAL CREDITOR CLASSIFICATION   =*
      *=           CODE.  ALSO, ADD LOGIC TO DISCARD THE RECORD AND   =*
      *=           INCREMENT A COUNTER BASED ON THE FLAG SET IN       =*
      *=           CCLB200 TO INDICATE THAT STATUS 93 WAS REPORTED    =*
      *=           BY A COLLECTION VENDOR WITHOUT A VALID ORIGINAL    =*
      *=           CREDITOR CLASSIFICATION CODE.                      =*
      *================================================================*
      *= LA351              DATE:  02/05/16   PGM'R: BARBARA YUSKO    =*
      *= ICP: 52353                           RQST'R: RAY BREWSTER    =*
      *= DESC    : CHANGE COLLECTION DATE CONDITIONS THAT ARE         =*
      *=           RECYCLING TO DISCARDS                              =*
      *================================================================*
      *= LA351              DATE:  11/06/15   PGM'R: BARBARA YUSKO    =*
      *= ICP: 55303                           RQST'R: PAT FINNERAN    =*
      *= DESC    : INCREMENT COUNTER FOR SCC AH RECORDS WHERE BALANCE =*
      *=           WAS CHANGED TO ZERO                                =*
      *================================================================*
      *= LA351              DATE:  02/07/14   PGM'R: BARBARA YUSKO    =*
      *= ICP: 49947                           RQST'R: RAY BREWSTER    =*
      *= DESC    : ADD LOGIC FOR THREE NEW DISCARD COUNTERS           =*
      *================================================================*
      *= LA351              DATE:  09/13/13   PGM'R: BARBARA YUSKO    =*
      *= ICP: 49762                           RQST'R: CATHY STRASBURG =*
      *= DESC    : CHANGES TO SSN CODE DUE TO NEW FLAG SETTINGS OF    =*
      *=           CDA-OPS13-SSN AND CDA-APPEND-DUPE-SSN AND DELETION =*
      *=           OF OBSOLETE SETTING CDA-SSN-ERROR, AND NEW SSN     =*
      *=           COUNTERS FOR BLANK OR ZERO FILLED SSNS.            =*
      *================================================================*
      *= LA351              DATE : 02/03/12   PGM'R : BARBARA YUSKO   =*
      *= ICP  : 43376                         RQST'R: DM              =*
      *= DESC: ADD COUNTERS FOR PORTFOLIO TYPE                        =*
      *================================================================*
      *= LA351              DATE : 11/18/11   PGM'R : BARBARA YUSKO   =*
      *= ICP  : 41885                         RQST'R: DM              =*
      *= DESC: ADD TO THE APPROPRIATE COUNTERS TO INDICATE THAT A     =*
      *=       SUBCODE CHANGE, ACCOUNT NUMBER CHANGE, OR BOTH WERE    =*
      *=       SENT TO TRU.                                           =*
      *================================================================*
      *= LA351              DATE : 09/30/11   PGM'R : BARBARA YUSKO   =*
      *= ICP  : 41948                         RQST'R: DM              =*
      *= DESC: ACCOUNT TYPE NO LONGER NEEDS TO BE IN A HOLD FIELD SO  =*
      *=       REVERT BACK TO USING ORIGINAL FIELD VALUE.  CII NOW    =*
      *=       NEEDS TO USE A HOLD FIELD FOR SEARCHING FROM/TO TABLE  =*
      *=       AND UNEQUATED TABLE DUE TO CHANGING BINARY ZEROES TO   =*
      *=       SPACES IN PROGRAM CCLB200.                             =*
      *================================================================*
      *= LA351              DATE : 08/12/10   PGM'R : BARBARA YUSKO   =*
      *= ICP  : 25820                         RQST'R: CATHY STRASBURG =*
      *= DESC: CHANGES FOR INVALID SUBCODE TYPE/STATUS                =*
      *================================================================*
      *= LA351              DATE : 07/19/10   PGM'R : BARBARA YUSKO   =*
      *= ICP  : 32407                         RQST'R: CATHY STRASBURG =*
      *= DESC: PASS TRADE DATA TO PROGRAM CCLC660                     =*
      *================================================================*
      *= VERSION : 02.07    DATE : 03/29/04    PGM'R : E PHONG        =*
      *=                   ICP # :16533        RQST'R: P FINNERAN     =*
      *= DOC REF : ICP16533                                           =*
      *= DESC    : REMOVED CROSS FIELD EDIT FOR SPECIAL COMMENT CODES =*
      *=           'D' AND 'AA' WITH ACCOUNT TYPES 12 AND 31.         =*
      *================================================================*
      *= VERSION : 02.06    DATE :  5/22/01    PGM'R : L NAKAHARA     =*00001290
      *=                   ICP # :11947        RQST'R: M MEYER        =*00001300
      *= DOC REF : ICP11947                                           =*00001310
      *= DESC    : A RCD SHOULD BE DISCARDED FOR AN INVALID ORIGINAL  =*00001320
      *=           CREDITOR NAME ONLY IF THE NEW CCF-REQD-ORIG-CREDIT =*00001330
      *=           FLAG IS SET TO 'Y' (WHICH INDICATES THE ORIGINAL   =*00001340
      *=           CREDITOR NAME IS A REQUIRED FIELD)                 =*00001340
001250*================================================================*00001280
      *= VERSION : 02.02    DATE : 06/18/97    PGM'R : LINDA MCCARTHY =*00001530
      *=                   ICP # : 7477        RQST'R: NDBM           =*00001540
      *= DOC REF : ICP7477                                            =*00001550
      *= DESC    : ADD CHECK FOR EXCEEDING TABLE LIMITS TO UNEQUATED  =*00001560
      *=           TABLES THAT DO NOT HAVE THIS CHECK. PREVENTS       =*00001570
      *=           CODE FROM CONTINUING AND CAUSING ABENDS THAT ARE   =*00001580
      *=           HARDER TO TRACE.                                   =*00001590
001250*=--------------------------------------------------------------=*00001600
      *= VERSION : 02.02    DATE : 05/08/97    PGM'R : LINDA MCCARTHY =*00001610
      *=                   ICP # : 7141        RQST'R: NDBM           =*00001620
      *= DOC REF : ICP7141                                            =*00001630
      *= DESC    : ADD CHECK FOR VOLUNTARY INDICATOR FLAG. IF IT IS   =*00001640
      *=           SET AS AN ERROR, DISCARD THE RECORD. ADD TO        =*00001650
      *=           VOLUNTARY INDICATOR ERROR TOTALS AND TO AGGREGATE  =*00001660
      *=           COUNTER FOR SINGLE FIELD ERRORS. (4A7000,4S8600)   =*00001670
001250*=--------------------------------------------------------------=*00001680
      *= VERSION : 01.06    DATE : 06/21/96    PGM'R : JULIA CHOY     =*00002050
      *=                   ICP # : 5030        RQST'R: I AND T        =*00002060
      *= DOC REF : ICP 5030                                           =*00002070
      *= DESC    : LA351 OUTPUT TO RTA- (EXPERT) UNIQUE CYCLE IF THERE=*00002080
001930*=           IS ONLY ONE CYCLE PER SUBCODE. WHEN THERE IS A     =*00002090
      *=           CYCLE ERROR, LA351 WILL OUTPUT '00' MULTIPLE CYCLE =*00002100
      *=           TO RTA WHICH IS INCORRECT.  FIX CYCLE TO AVOID     =*00002110
      *=           CAH004LD TO ABEND WHEN SORT DEDUP OUTPUT SINGLE    =*00002120
      *=           CYCLE WHICH IS NOT IN SYNC WITH LA351.             =*00002130
001250*=--------------------------------------------------------------=*00002140
      *= VERSION : 01.05    DATE : 04/04/96    PGM'R : JULIA CHOY     =*00002150
      *=                   ICP # : XXXX        RQST'R: I AND T        =*00002160
      *= DOC REF : ICP XXXX                    JCHOY 04/04/96         =*00002170
      *= DESC    : ACCEPT ALPHA-NUMERIC CYCLE, REMOVE CHECK FOR NUM   =*00002180
001930*=           FOR CYCLE BECAUSE LA351 WILL SEND THE REAL CYCLE   =*00002190
      *=           TO CCSS AND EXPERT. CURRENTLY, IF CYCLE ID CONSTRUCT*00002200
      *=           FROM ACCOUNT NUM, IT CAN BE ALPHA AND LA351 CONVERTS*00002210
      *=           TO NUMERIC. THIS IS NOT LONGER NECESSARY.          =*00002220
001250*=--------------------------------------------------------------=*00002230
      *= VERSION : 01.04    DATE : 03/08/96    PGM'R : JULIA CHOY     =*00002240
      *=                   ICP # : XXXX        RQST'R: I AND T        =*00002250
      *= DOC REF : ICP XXXX                    JCHOY 03/08/96         =*00002260
      *= DESC    : CHECK FOR BLANK CYCLE ID FOR CYCLE REPORTER.       =*00002270
001930*=           IF A CYCLE REPORTER SENDS NON-NUMERIC CYCLE, SETS  =*00002280
      *=           TO ZEROS IN RTA, SO THAT SDEDUP EXPERT CAN MATCH   =*00002290
      *=           THE RECORD BACK IN CAH004LD PROGRAM.               =*00002300
001250*=--------------------------------------------------------------=*00002310
      *= VERSION : 01.03    DATE : 02/23/96    PGM'R : LINDA PISCH    =*00002320
      *=                   ICP # : 3943        RQST'R: LISA PARENT    =*00002330
      *= DOC REF : ICP 3943                                           =*00002340
      *= DESC    : ADDED CODE TO PARAGRAPH 4S1200-SEARCH-UNEQ-TYPE    =*00002350
001930*=           TO ABEND AT END OF TABLE SEARCH WHEN THE COUNT     =*00002360
      *=           EXCEEDS 50. ALSO, ADDED CHECK FOR CCF-ABEND        =*00002370
      *=           BEFORE ADDING TO ANY OF THE RTA UNEQUATED TOTALS   =*00002380
      *=           FIELDS.                                            =*00002390
001250*================================================================*00002400
      *= VERSION : 01.02    DATE : 07/21/95    PGM'R : J CHOY         =*00002480
      *=                   ICP # : 2402        RQST'R: CCSS           =*00002490
      *= DOC REF : CCSS DATAPREP LA351/SORT DEDUP SEP.                =*00002500
      *= DESC    : IF ADJUST PERCENT ERROR AND IT IS CHAP 13, THEN    =*00002510
001930*=           DISCARD RECORD.                                    =*00002520
      *=         : IF ADJUST PERCENT IS NON ZEROS OR NON BLANK AND IT =*00002530
001930*=           IS CHAPTER 7,11,12, DISCARD RECORD.                =*00002540
      *=         : SAME RULES SHOULD BE APPLIED TO REPAY PERCENT.     =*00002550
001250*================================================================*00002560
      *= VERSION : 01.01    DATE : 06/21/95    PGM'R : J CHOY         =*00002570
      *=                   ICP # : 2305        RQST'R: CCSS           =*00002580
      *= DOC REF : CCSS DATAPREP LA351/SORT DEDUP SEP.                =*00002590
      *= DESC    : IF NAME (SURNAME OR FIRST NAME) IS NUMERICS        =*00002600
001930*=           DISCARD RECORD. CCSS UPDATE SYSTEM CAN NOT HANDLE  =*00002610
001930*=           INVALID NAME.                                      =*00002620
001250*================================================================*00002630
      *= VERSION : 01.00    DATE : 03/01/95    PGM'R : B. YUSKO       =*00002730
      *=                   ICP # : 1449        RQST'R: MARKETING      =*00002740
      *= DOC REF : ICP 1449                                           =*00002750
      *= DESC    : ADD CODE TO DISCARD THE RECORD WHENEVER A C1 OR F1 =*00002760
      *=           SEGMENT IS FLAGGED AS AN ERROR. THIS HAPPENS IF BAD=*00002770
      *=           WORDS ARE FOUND IN THE F1 SEGMENT OR BAD WORDS ARE =*00002780
      *=           FOUND IN A C1 SEGMENT THAT CONTAINS ORIGINAL CREDIT=*00002790
      *=           GRANTOR DATA. IF THE C1 CONTAINS A BAD WORD BUT    =*00002800
      *=           DOES NOT CONTAIN CREDIT GRANTOR DATA, THE FLAG IS  =*00002810
      *=           SET TO DEFAULT. CCLC610 WRITES THE UPGRADE WITHOUT =*00002820
      *=           THE C1 IN THAT CASE. FOR CCSS, THE RECORD WOULD    =*00002830
      *=           BE WRITTEN WITH THE CORRECT INDICATOR VALUE IF THE =*00002840
      *=           IS SET TO DEFAULT RATHER THAN ERROR.               =*00002850
      *=--------------------------------------------------------------=*00002860
      *= VERSION : 01.00    DATE : 12/17/94    PGM'R : J.CHOY         =*00002870
      *=                    PR # : 41002C      RQST'R: DMS/CCSS       =*00002880
      *= DOC REF : DMS DATAPREP FOR CCSS TRS/DS                       =*00002890
      *= DESC    : CHANGE SEGMENT ID FROM PBKS TO PBKY, PCKS TO PCKY  =*00002900
      *=           AND PLKS TO PLKY AND COPYBOOK FROM CCLAPBKS        =*00002910
      *=           TO CCLAPBKY, CCLAPCAS TO CCLAPCKY AND CCLAPLIS TO  =*00002920
      *=           CCLAPLKY.                                          =*00002930
      *=--------------------------------------------------------------=*00002940
001270*= DATA PREPARATION   DATE : 12/17/94    PGM'R : JULIA CHOY     =*00002950
001280*= VERSION : 19.00    PR # : 41002C      RQST'R: DMS            =*00002960
001290*= DOC REF : SEP LA351 FOLLOW-ON                                =*00002970
001300*=                                                              =*00002980
001310*= DESC:  1. TO FIX SCB PR32801 SCB 31. IF NAME OR ADDRESS IS   =*00002990
001320*=           INVALID, DISCARD RECORD SEE TRS 4.1.2.61I.         =*00003000
001310*=        2. CHECK FOR NUMERICS NAME, IT IS CONSIDER TO BE AN   =*00003010
001320*=           INVALID CONDITION AND DISCARD RECORD.              =*00003020
001260*= MARKED JC1900                                                =*00003030
001640*=                                                              =*00003040
001310*= DESC:  1. ICP 2879 - ADD TRAN TYPE FOR BASE,A1,A2 AND A3     =*00003050
001320*=           SEGMENTS (NOT JUST BASE)                           =*00003060
001260*= MARKED JC0921 - JCHOY 09/21/95                               =*00003070
001640*=                                                              =*00003080
001310*= DESC:  1. ICP 2880 - DO NOT DISPLAY DISCARD CNT IN CCSS RPT2A=*00003090
001320*=           IF RECORD DISCARDED DUE TO PRODUCTION.             =*00003100
001260*= JCHOY 10/04/95                                               =*00003110
001640*=                                                              =*00003120
001310*= DESC:  2. ICP NONE - RPT009H BYPASS MONTHLY PAYMENT REPORT   =*00003130
001320*=           IS REMOVED IN DPII, CHECK FOR SAMPLE LIMIT IS NOT  =*00003140
001320*=           REQUIRED. USERS DO NOT USE THE REPORT ANYMORE.     =*00003150
001260*= JCHOY 10/20/95                                               =*00003160
001640*=- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - =*00003170
001270*= DATA PREPARATION   DATE : 12/17/94    PGM'R : R. PARASCANDOLO=*00003180
001280*= VERSION : 19.00    PR # : 41002C      RQST'R: DMS            =*00003190
001290*= DOC REF : SEP LA351 FOLLOW-ON                                =*00003200
001300*=                                                              =*00003210
001310*= DESC:  1. FOR CCSS .... WHEN BUILDING THE TABLE OF UN-EQUATED=*00003220
001320*=           ACCOUNT TYPES USE CRF-ACCOUNT-TYPE RATHER THAN     =*00003230
001330*=           TDA-ACCOUNT-TYPE.  WHEN THE INCOMING ACCOUNT TYPE  =*00003240
001340*=           IS UN-EQUATED AND DEFAULTS TO "31" THE VALUE IN    =*00003250
001350*=           TDA-ACCOUNT-TYPE IS "31" THUS PREVENTING THE       =*00003260
001360*=           UNEQUATED ACCOUNT TYPE IN THE RTA TABLE TO CARRY   =*00003270
001370*=           THE ACTUAL INCOMING VALUE.                         =*00003280
001380*=                                                              =*00003290
001390*=        2. POPULATE THE FOLLOWING FIELDS (REQUIRED BY THE     =*00003300
001400*=           NEW EXPERT SYSTEM) IN THE RTA TABLE:               =*00003310
001410*=           ------FIELD--------        ----- SOURCE-------     =*00003320
001420*=                                                              =*00003330
001430*=           RTA-ACTIVITY-DATE          LA351 INPUT PARM        =*00003340
001440*=           RTA-DATE-OF-OCCURRENCE     DETERMINED BY......     =*00003350
001450*=           FIRST VALID ACCOUNT WITH STATUS 11 AND BOTH THE   =* 00003360
001460*=           DATE OF OCCURRENCE AND BALANCE GREATER THAN ZEROS  =*00003370
001470*=           RTA-TOTAL-DISCARD          CALCULATED              =*00003380
001480*=           RTA-H1-SEGMENTS-BYPASSED   CALCULATED              =*00003390
001510*=       **  RTA-SUM-OF-BALANCE-AMT     SEE NOTE BELOW          =*00003400
001520*=       **  RTA-SUM-OF-LOAN-AMT          "      "              =*00003410
001530*=       **  RTA-SUM-OF-CREDIT-LIMITS     "      "              =*00003420
001540*=       **  RTA-SUM-PAST-DUE-AMT         "      "              =*00003430
001550*=       **  RTA-SUM-MNTHLY-PAYMENT-AMT   "      "              =*00003440
001560*=           RTA-TERMS-DEFAULTED        CALCULATED              =*00003450
001570*=                                                              =*00003460
001570*=   **NOTE: THESE FIELDS ARE ACCUMULATED USING THE CRF-....    =*00003470
001570*=           FIELDS AND WHEN APPLICABLE (OPS-31) THE DECIMAL    =*00003480
001570*=           POSITIONS ARE TRUNCATED.                           =*00003490
001570*=                                                              =*00003500
001640*=- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - =*00003570
001650*= DATA PREPARATION   DATE : 12/17/94    PGM'R : JACQUES STERN  =*00003580
001660*= VERSION : 19.00    PR # : 41002C      RQST'R: DMS            =*00003590
001670*=                                                              =*00003600
001680*= DESC:  MAKE THE FOLLOWING MODIFICATIONS:                     =*00003610
001690*=                                                              =*00003620
001700*=      - SEP 1.2.1.4 (CCSS SAMPLE REPORTS):                    =*00003630
001710*=                                                              =*00003640
001720*=        CHANGE TO CALL THE APPROPRIATE CCSS OUTPUT            =*00003650
001730*=        MODULE (CCLC640 OR CCLC645) WHEN CCSS SAMPLE          =*00003660
001740*=        REPORTING NEEDS TO GENERATE OUTPUT FOR ANY OF         =*00003670
001750*=        THE SAMPLE REPORTS THAT ARE NOT VALID SAMPLES.        =*00003680
001760*=        THIS IS NEEDED TO CAUSE THE CCSS OUTPUT FIELDS        =*00003690
001770*=        TO BE POPULATED FOR THE EDITED DATA CCSS SAMPLE       =*00003700
001780*=        REPORT OUTPUT EVEN IF THE TRANSACTION IS TO BE        =*00003710
001790*=        DISCARDED OR BYPASSED. ADD A CALL TO NEW CCSS         =*00003720
001800*=        SAMPLES OUTPUT MODULE CCLC695.                        =*00003730
001810*=                                                              =*00003740
001820*=        THE FOLLOWING COPYMEMBERS RESIDING IN THE CCSS        =*00003750
001830*=         PUBLIC AND TRADE OUTPUT MODULES, WILL NOW RESIDE     =*00003760
001840*=         IN CCLB600, AND BE PASSED TO THESE MODULES:          =*00003770
001850*=                                                              =*00003780
001860*=           CCLAMBHS     CCLAPCAS    CCLAPLIS                  =*00003790
001870*=           CCLAPPLS     CCLAPTHS                              =*00003800
001880*=                                                              =*00003810
001890*=         THIS IS TO GIVE THE CCSS SAMPLES REPORTS MODULE      =*00003820
001900*=         VISIBILITY TO THE CCSS EDITED DATA THAT DOES NOT     =*00003830
001910*=         ALREADY RESIDE IN THIS PROGRAM.                      =*00003840
001920*=                                                              =*00003850
001930*=      - SEP 1.2.4.5 (AHA-LA351/DB2 EXPERT TABLES) -           =*00003920
001980*=        PASS '00' TO CCSS AHA IF THIS IS A NON CYCLED         =*00003930
001980*=        REPORTER OR IF THERE ARE MULTIPLE CYCLES FOR          =*00003940
001980*=        A GIVEN SUBCODE.  THE PARALLEL PROCESS IS IMPLEMENTED =*00003950
001980*=        IN CCSS TRADE SORT/DEDUP FOR WHEN THAT AHA RECORD     =*00003960
001980*=        IS WRITTEN.                                           =*00003970
001640*=- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - =*00003980
001650*= DATA PREPARATION   DATE : 12/17/94    PGM'R : JACQUES STERN  =*00003990
001660*= VERSION : 19.00    PR # : 41002C      RQST'R: DMS            =*00004000
001670*=                                                              =*00004010
001680*= DESC:  PROBLEM DISCOVERED DURING EVENT TESTING FIXED:        =*00004020
001670*=        THE COUNT OF RECORDS OUPUT TO CCSS TRADE WAS          =*00004030
001670*=        WRONG IN SITUATIONS WHERE THE SUBCODE OF THE          =*00004040
001670*=        CURRENT DATA IN PROCESS DIFFERED FROM THE SUBCODE     =*00004050
001670*=        OF THE PRIOR CCSS TRADE DATA THAT WENT TO FILE.       =*00004060
001670*=        BECAUSE THIS SUBCODE IS THE MAIN KEY ELEMENT OF       =*00004070
001670*=        THE RTA REC CONTAINING THAT COUNTER, THE COUNTING     =*00004080
001670*=        WAS DONE ON THE COUNTER FOR A DIFFERENT CCSS TRADE    =*00004090
001670*=        RECORD. CCLC200 ALSO AFFECTED BY THIS CHANGE.         =*00004100
001670*=                                                              =*00004110
001990*================================================================*00004120
002000*= LA351                DATE : 11/07/94      PGM'R : R. PARASCAN=*00004130
002010*= VERSION : 18.00      PR # : PROD FIX      RQST'R: DMS/CCSS   =*00004140
002020*=                                                              =*00004150
002030*= DOC REF : SEE TICKET #00249271                               =*00004160
002040*= DESC: PROBLEM:  CCLB600 ABENDED WITH U1411 WHEN THE 'FROM'   =*00004170
002050*=                 VALUE WAS NOT FOUND IN THE RTA EQUATED TABLES=*00004180
002060*=                 THIS CONDITION OCCURS WHEN CCLF005 IS CALLED =*00004190
002070*=                 AND THE INPUT VALUE IS ALTERED TO AN         =*00004200
002080*=                 EQUATED VALUE.                               =*00004210
002090*=       SOLUTION: CAPTURE THE INPUT FIELDS (SP-COM, ECOA, ACCT =*00004220
002100*=                 TYPE) AND IF THEY ALTERED BY CCLF005         =*00004230
002110*=                 USE THE ALTERED VALUE RATHER THAN THE        =*00004240
002120*=                 ORIGINAL 'FROM' VALUE WHEN SEARCHING THE RTA =*00004250
002130*=                 TABLE(S).                                    =*00004260
002140*============================================================== =*00004270
002150*= DATA PREPARATION   DATE : 08/30/94    PGM'R : JACQUES STERN  =*00004280
002160*= VERSION : 17.00B   PR # : 32801       RQST'R: DMS/CCSS       =*00004290
002170*= DOC REF : DMS DATAPREP FOR CCSS TRS/DS - CORE USAGE FIX      =*00004300
002180*=                                                              =*00004310
002190*= DESC:  1. THE FOLLOWING ARE CHANGES NEEDED TO CONVERT        =*00004320
002200*=           THE ACCUMULATION AND OUTPUT OF TOTALS AT THE       =*00004330
002210*=           SUBCODE LEVEL FROM A FIXED TWO DIMENSIONAL TABLE   =*00004340
002220*=           PROCESS TO A SINGLE LEVEL (PER SUBCODE) PROCESS    =*00004350
002230*=           BY ENABLING THE STORAGE AND RETRIEVAL OF EACH      =*00004360
002240*=           SUBCODE'S DATA IN DYNAMICALLY ALLOCATED STORAGE:   =*00004370
002250*=                                                              =*00004380
002260*=          A. REMOVE COPY STATEMENTS FOR:                      =*00004390
002270*=                                                              =*00004400
002280*=             CCLARTA1      CCLARTA6      CCLARTAB             =*00004410
002290*=             CCLARTA2      CCLARTA7      CCLARTAC             =*00004420
002300*=             CCLARTA3      CCLARTA8      CCLARTAD             =*00004430
002310*=             CCLARTA4      CCLARTA9      CCLARTAE             =*00004440
002320*=             CCLARTA5      CCLARTAA      CCLARTAF             =*00004450
002330*=                                                              =*00004460
002340*=          B. ADD A COPY STATEMENT FOR CCLARTA AND MAKE        =*00004470
002350*=             CORRESPONDING 'USING' CLAUSE CHANGES TO          =*00004480
002360*=             REFERENCE RTA-LA351-SUBCODE-REC INSTEAD OF       =*00004490
002370*=             THE 15 GROUP ITEMS THAT BELONGED TO THE CCLARTA* =*00004500
002380*=             COPYMEMBERS ABOVE BEING ELIMINATED.              =*00004510
002390*=                                                              =*00004520
002400*=          C. MODIFY THE ACCUMULATION OF CCSS TOTALS           =*00004530
002410*=             TO PROCESS THE NEW RECORD FROM CCLARTA           =*00004540
002420*=             INSTEAD OF THE 15 TWO DIMENSIONAL SUBCODE        =*00004550
002430*=             TOTALS TABLES IN THE CCLARTA* COPYMEMBERS        =*00004560
002440*=             THAT ARE BEING ELIMINATED.  THE AFFECTED         =*00004570
002450*=             PARAGRAPHS ARE ALL THOSE WITH THE PREFIX '4S'    =*00004580
002460*=             IN THE NAME, BEGINNING WITH 4S0100-COUNT-        =*00004590
002470*=             OUTPUT-CCSS - 33 PARAGRAPHS ALTOGETHER.          =*00004600
002480*=                                                              =*00004610
002490*=             + CHANGE ALL TWO LEVEL INDEXED DATA-NAME         =*00004620
002500*=               REFERENCES TO ONE LEVEL INDEX REFERENCES,      =*00004630
002510*=               AND CHANGE THE FORMERLY SECOND LEVEL           =*00004640
002520*=               INDEX NAMES AS PER THE NEW RECORD              =*00004650
002530*=               RTA-LA351-SUBCODE-REC - IF NEEDED.             =*00004660
002540*=                                                              =*00004670
002550*=             + REPLACE THE PARAGRAPH 4S1150-SEARCH-SUBCODE    =*00004680
002560*=               WITH 8W0050-SUBCODE-DATA-MANAGER AND           =*00004690
002570*=               8W0075-CALL-SUBC-DATA-MGR. THE SEARCH IS       =*00004700
002580*=               REPLACED BY A CALL TO NEW MOCULE CCLC200       =*00004710
002590*=               FOR THE STORAGE AND RETRIEVAL OF SUBCODE       =*00004720
002600*=               DATA.                                          =*00004730
002610*=                                                              =*00004740
002620*=             + TO SAVE SPACE IN DYNAMIC CORE; REMOVE THE      =*00004750
002630*=               ACCUMULATION OF SUM TOTALS FROM 7 TABLES       =*00004760
002640*=               IN THE RTA AREA - SUMMATION OF THESE FROM      =*00004770
002650*=               THE CORRESPONDING RECYCLE AND PROCESS TOTALS   =*00004780
002660*=               WILL BE DONE IN THE CCSS REPORT PROCESS        =*00004790
002670*=               (CCLB925) BEFORE REPORTING AND BEFORE          =*00004800
002680*=               WRITING THE NEW AHA RECORD.                    =*00004810
002690*=                                                              =*00004820
002700*=        2. TO IMPROVE PERFORMANCE WHEN NOT RUNNING DUAL       =*00004830
002710*=           OPERATIONS, CONDITIONALLY BYPASS THE CALLS         =*00004840
002720*=           TO CCSS OUPUT MODULES AND CCSS TRADE               =*00004850
002730*=           CONSUMER OVERFLOW REPORTING WHEN THE               =*00004860
002740*=           CCF-PARM-CCSS-OUTPUT-SW IS SET TO 'N'.             =*00004870
002750*=           THE MODULES TO BYPASS ARE:                         =*00004880
002760*=                                                              =*00004890
002770*=           CCLC640      CCLC645     CCLC700                   =*00004900
002780*=- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - =*00004910
002790*=                    DATE : 10/12/94    PGM'R : JACQUES STERN  =*00004920
002800*=                                                              =*00004930
002810*= DESC    : PHASE-1 RE-IMPLEMENTATION SUPPORT (POST IMP)       =*00004940
002820*=           CHANGE TO BYPASS POST END-OF-FILE CALL TO MEMORY   =*00004950
002830*=           MGR MODULE CCLC200 IN THE EVENT OF AN EMPTY        =*00004960
002840*=           INPUT FILE.  CCSS REPORTS WILL BE BYPASSED,        =*00004970
002850*=           CURRENT SYSTEM REPORTS WILL BE GNERATED WITH       =*00004980
002860*=           ZERO COUNTS, AS BEFORE, TO ALERT THE USER TO       =*00004990
002870*=           THE EMPTY INPUT FILE. USER ABEND 1414 FROM         =*00005000
002880*=           CCLC200 FOR SUBCODE TABLE INDEX OVERFLOW IS        =*00005010
002890*=           THUS PREVENTED IN THIS CASE.                       =*00005020
002900*=- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - =*00005030
002910*=                    DATE : 10/04/94    PGM'R : JACQUES STERN  =*00005040
002920*=                                                              =*00005050
002930*= DESC    : PHASE-1 RE-IMPLEMENTATION SUPPORT (POST IMP)       =*00005060
002940*=           CHANGED RTA UNEQUATED TABLES SEARCH TO             =*00005070
002950*=           NOT ISSUE AN LA351 ABEND IF THERE IS AN            =*00005080
002960*=           'AT END'. THIS IS TO MAKE THE PROCESS CONSISTENT   =*00005090
002970*=           WITH HANDLING OF THE CORRESPONDING TABLE PROCESS   =*00005100
002980*=           IN THE CURRENT SYSTEM, AND TO AVOID MISLEADING     =*00005110
002990*=           ABEND MESSAGES IN THE EVENT OF BAD INPUT FROM THE  =*00005120
003000*=           USER.                                              =*00005130
003020*=        3. FOR NEW LEGAL INPUT, EITHER ADDRESS 3 OR ZIP CODE  =*00005150
003030*=           MUST BE PRESENT.               JC   08/16/94       =*00005160
003040*=        4. CROSS ERROR FOR LEGAL ARE MAJOR ITEM AND MINOR TYPE=*00005170
003050*=           ADD CROSS FIELD ERROR COUNT TO RPT006.             =*00005180
003060*=                                          JC   08/24/94       =*00005190
006300*================================================================*00008430
008470*= VERSION : 01.00    DATE : 12/12/83    PGM'R : JEFF SWARD     =*00010600
008480*=                    PR # : 33009       RQST'R:                =*00010610
008490*= DOC REF : LA350 ANALYSIS - SRD, SES                          =*00010620
008500*= DESC    : INITIAL IMPLEMENATION                              =*00010630
008510*================================================================*00010640
008520*= ENDBOX      ENDBOX       ENDBOX       ENDBOX          ENDBOX =*00010650
008530*================================================================*00010660
008540 EJECT                                                            00010670
008550******************************************************************00010680
008560 ENVIRONMENT DIVISION.                                            00010690
008570******************************************************************00010700
008580 CONFIGURATION SECTION.                                           00010710
008590                                                                  00010720
008600 SOURCE-COMPUTER. IBM-370.                                        00010730
008610                                                                  00010740
008620 OBJECT-COMPUTER. IBM-370.                                        00010750
008630 EJECT                                                            00010760
008640******************************************************************00010770
008650 DATA DIVISION.                                                   00010780
008660******************************************************************00010790
008670 WORKING-STORAGE SECTION.                                         00010800
008680                                                                  00010810
008700 EJECT                                                            00010830
008710******************************************************************00010840
008720***  A = ACCUMULATORS                                             00010850
008730******************************************************************00010860
008740                                                                  00010870
008750 01  A01-COUNTS.                                                  00010880
008760     05  A01-INTERVAL-COUNT       PIC S9(08) COMP  VALUE ZERO.    00010890
008770     05  A01-ERROR-PERCENTAGE     PIC S9(3)V9(4)   VALUE ZERO.    00010900
008780 EJECT                                                            00010910
008790******************************************************************00010920
008800***  C = CONSTANTS                                                00010930
008810******************************************************************00010940
008820                                                                  00010950
008830 01  C01-CONSTANTS.                                               00010960
008840     05  C01-ERROR-CHECK-INTERVAL PIC S9(08) COMP VALUE +25000.   00010970
008850     05  C01-ONE-HUNDRED          PIC S9(08) COMP VALUE +100.     00010980
008870     05  C01-MP-LIMIT             PIC S9(08) COMP VALUE +5.       00011000
008880                                                                  00011010
008890 01  C02-CONSTANTS.                                               00011020
009050     05  C02-SUBROUTINE-NAME      PIC  X(08)      VALUE 'CCLB600'.00011180
009060     05  C02-PARAGRAPH-4X0200     PIC  X(06)      VALUE '4X0200'. 00011190
009070     05  C02-PARAGRAPH-4S1200     PIC  X(06)      VALUE '4S1200'. 00011210
009080     05  C02-PARAGRAPH-4S1225     PIC  X(06)      VALUE '4S1225'. 00011230
009100     05  C02-PARAGRAPH-4S1300     PIC  X(06)      VALUE '4S1300'. 00011260
009100     05  C02-PARAGRAPH-4S1325     PIC  X(06)      VALUE '4S1325'. 00011270
009110     05  C02-PARAGRAPH-4S1350     PIC  X(06)      VALUE '4S1350'. 00011290
009120     05  C02-PARAGRAPH-4S1375     PIC  X(06)      VALUE '4S1375'. 00011300
009120     05  C02-PARAGRAPH-4S1400     PIC  X(06)      VALUE '4S1400'. 00011300
009120     05  C02-PARAGRAPH-4S1425     PIC  X(06)      VALUE '4S1425'. 00011300
009120     05  C02-PARAGRAPH-4S1450     PIC  X(06)      VALUE '4S1450'. 00011300
009120     05  C02-PARAGRAPH-4S1475     PIC  X(06)      VALUE '4S1475'. 00011300
009120     05  C02-PARAGRAPH-4S1500     PIC  X(06)      VALUE '4S1500'. 00011310
009130     05  C02-PARAGRAPH-4S1525     PIC  X(06)      VALUE '4S1525'. 00011320
009130     05  C02-PARAGRAPH-4S1550     PIC  X(06)      VALUE '4S1550'. 00011320
009130     05  C02-PARAGRAPH-4S1575     PIC  X(06)      VALUE '4S1575'. 00011320
009130     05  C02-PARAGRAPH-4S1600     PIC  X(06)      VALUE '4S1600'. 00011320
009130     05  C02-PARAGRAPH-4S1625     PIC  X(06)      VALUE '4S1625'. 00011320
009130     05  C02-PARAGRAPH-4S1650     PIC  X(06)      VALUE '4S1650'. 00011320
009130     05  C02-PARAGRAPH-4S1675     PIC  X(06)      VALUE '4S1675'. 00011320
009130     05  C02-PARAGRAPH-4S1700     PIC  X(06)      VALUE '4S1700'. 00011320
009130     05  C02-PARAGRAPH-4S1725     PIC  X(06)      VALUE '4S1725'. 00011320
009130     05  C02-PARAGRAPH-4S1750     PIC  X(06)      VALUE '4S1750'. 00011320
009130     05  C02-PARAGRAPH-4S1775     PIC  X(06)      VALUE '4S1775'. 00011320
009150     05  C02-EXCESSIVE-ERRORS     PIC  X(60)      VALUE           00011340
009160         'CCLB600 4X0200 EXCESSIVE ERRORS DETECTED'.              00011350
009180                                                                  00011370
009190 EJECT                                                            00011380
009200******************************************************************00011390
009210***  I = INDICATORS                                               00011400
009220******************************************************************00011410
009230                                                                  00011420
009240 01  I01-FIRST-TIME-FLAG          PIC  X(01)      VALUE 'Y'.      00011430
009250     88  I01-FIRST-TIME                           VALUE 'Y'.      00011440
009260     88  I01-NOT-FIRST-TIME                       VALUE 'N'.      00011450
009270                                                                  00011460
009280 01  I02-CCSS-SAMPLE-LIMIT-FLAG   PIC  X(01)      VALUE 'N'.      00011470
009290     88  I02-SAMPLE-LIMIT-GEN-NOT                 VALUE 'N'.      00011480
009300     88  I02-SAMPLE-LIMIT-GEN-YES                 VALUE 'Y'.      00011490
009310                                                                  00011500
009240 01  I06-TRADE-DISCARD-FLAG       PIC  X(01)      VALUE 'N'.      00011430
009260     88  I06-TRADE-DISCARD                        VALUE 'Y'.      00011450
009250     88  I06-NO-TRADE-DISCARD                     VALUE 'N'.      00011440

009240 01  I07-TRADE-RECY-FLAG          PIC  X(01)      VALUE 'N'.      00011430
009260     88  I07-TRADE-RECY                           VALUE 'Y'.      00011450
009250     88  I07-NO-TRADE-RECY                        VALUE 'N'.      00011440
009480                                                                  00011670
009240 01  I08-TRADE-NONSUB-RECY-FLAG   PIC  X(01)      VALUE 'N'.      00011430
009260     88  I08-TRADE-NONSUB-RECY                    VALUE 'Y'.      00011450
009250     88  I08-NO-TRADE-NONSUB-RECY                 VALUE 'N'.      00011440
009480                                                                  00011670
009490 01  I20-CCSS-NAME-ADDRESS-FLAG   PIC  X(01)      VALUE ' '.      00011680
009500     88  I20-CCSS-NAME-ADDRESS-VALID              VALUE 'V'.      00011690
009510     88  I20-CCSS-NAME-ADDRESS-DISCARD            VALUE 'D'.      00011700
009520                                                                  00011710
009560 EJECT                                                            00011750
009570******************************************************************00011760
009580***  M = MISCELLANEOUS                                            00011770
009590******************************************************************00011780
009600                                                                  00011790
009710 01  M01-XFIELD-DATA.                                             00011940
           05  M01-XFIELD-TYPE       PIC X(01).
               88 M01-XFIELD-TYPE-M  VALUE 'M'.
               88 M01-XFIELD-TYPE-N  VALUE 'N'.
               88 M01-XFIELD-TYPE-O  VALUE 'O'.
               88 M01-XFIELD-TYPE-R  VALUE 'R'.
           05  M01-XFIELD-VALUE      PIC X(05).

009710 01  M07-CONSUMER-NAME         PIC X(67).                         00011940
009740                                                                  00011980
009750 01  M99-GENERIC-SAVE-AREA.                                       00011990
009760     05 M99-SUBCODE-CONTROL-AREA  PIC  X(49)      VALUE SPACES.   00012000
009740                                                                  00012010
009760     05 M99-SUBCODE-AND-FLAG.                                     00012020
009770         10  M99-SUBCODE          PIC  X(20).                     00012030
009780         10  M99-SUBCODE-FLAG     PIC  X(01).                     00012040
009790            88  M99-VALID-SUBCODE                 VALUE 'V'.      00012050
009800            88  M99-SUBCODE-ERROR                 VALUE 'E'.      00012060
009810                                                                  00012070
009760     05 M99-OLD-SUBCODE-AND-FLAG                  VALUE SPACES.   00012080
009770         10  M99-OLD-SUBCODE      PIC  X(20).                     00012090
009780         10  M99-OLD-SUBCODE-FLAG PIC  X(01).                     00012100
009810                                                                  00012110
009760     05 M99-INDEX-PASSED          PIC S9(04) COMP VALUE 1.        00012120
009810                                                                  00012130
009820     05 M99-STATUS                PIC  X(02).                     00012140
009830                                                                  00012150
009830                                                                  00012150
009840     05 M99-STATUS-FLAG           PIC  X(01).                     00012160
009850         88 M99-VALID-STATUS                      VALUE 'V'.      00012170
009860         88 M99-STATUS-ERROR                      VALUE 'E'.      00012180
009870***ICP8327                                                        00012190
009880     05 M99-SP-COM                PIC  X(02).                     00012200
009920                                                                  00012280
009930     05 M99-SP-COM-FLAG           PIC  X(01).                     00012290
009940         88 M99-VALID-SP-COM                      VALUE 'V'.      00012300
009950         88 M99-SP-COM-ERROR                      VALUE 'E'.      00012310
009960                                                                  00012320
009970     05 M99-ACCT-TYPE-FLAG        PIC  X(01)      VALUE ' '.      00012330
009980         88 M99-VALID-ACCT-TYPE                   VALUE 'V'.      00012340
010000         88 M99-ACCT-TYPE-ERROR                   VALUE 'E'.      00012360
010010                                                                  00012370
009820     05 M99-CII                   PIC  X(02).                     00012140

009930     05 M99-CII-FLAG              PIC  X(01)      VALUE ' '.      00012290
009940         88 M99-VALID-CII                         VALUE 'V'.      00012300
009950         88 M99-CII-INVALID                       VALUE 'I'.      00012310

009930     05 M99-PI-FLAG               PIC  X(01)      VALUE ' '.      00012290
009940         88 M99-VALID-PI                          VALUE 'V'.      00012300
009950         88 M99-PI-INVALID                        VALUE 'I'.      00012310
009960                                                                  00012320
009760     05 M99-OUTPUT-TO-CCSS-FLAG   PIC  X(01)      VALUE 'N'.      00012380
009990         88 M99-OUTPUT-TO-CCSS                    VALUE 'Y'.      00012390
010010                                                                  00012400
010030 EJECT                                                            00012420
010040******************************************************************00012430
010050***  P = PRINT                                                    00012440
010060******************************************************************00012450
010070******************************************************************00012460
010080***  R = RECORD                                                   00012470
010090******************************************************************00012480
010100 EJECT                                                            00012490
010110******************************************************************00012500
010120***  S = SUBSCRIPTS                                               00012510
010130******************************************************************00012520
010140                                                                  00012530
010150 01  S01-SUBS.                                                    00012540
010180     05  S01-PREV-RTA2            PIC S9(08) COMP VALUE +1.       00012570
010190     05  S01-PREV-RTA3            PIC S9(08) COMP VALUE +1.       00012580
010210     05  S01-PREV-RTA5            PIC S9(08) COMP VALUE +1.       00012600
010220     05  S01-PREV-RTA6            PIC S9(08) COMP VALUE +1.       00012610
010230     05  S01-PREV-RTA7            PIC S9(08) COMP VALUE +1.       00012620
010240     05  S01-PREV-RTA8            PIC S9(08) COMP VALUE +1.       00012630
010240     05  S01-PREV-RTA9            PIC S9(08) COMP VALUE +1.       00012630
010260     05  S01-PREV-RTAA            PIC S9(08) COMP VALUE +1.       00012650
010270     05  S01-PREV-RTAB            PIC S9(08) COMP VALUE +1.       00012660
010280     05  S01-PREV-RTAD            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAE            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAF            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAG            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAH            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAI            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAJ            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAK            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAL            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAM            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAN            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAO            PIC S9(08) COMP VALUE +1.       00012670
010280     05  S01-PREV-RTAP            PIC S9(08) COMP VALUE +1.       00012670
010140     05  S01-SECOND-CII           PIC S9(08) COMP VALUE +1.       00012680
010290 EJECT                                                            00012690
010300******************************************************************00012700
010310***  T = TABLES                                                   00012710
010320******************************************************************00012720
010330                                                                  00012730
010340 COPY CCLAERC.                                                    00012740
010350 EJECT                                                            00012750
010380 COPY CCLATLC.                                                    00012780
010390 EJECT                                                            00012790
010400 COPY CCLAMBHS.                                                   00012800
010410 EJECT                                                            00012810
010420 COPY CCLAMCOS.                                                   00012820
010430 EJECT                                                            00012830
010420 COPY CCLAMEMP.                                                   00012820
010430 EJECT                                                            00012830
010440 COPY CCLAMKCS.                                                   00012840
010450 EJECT                                                            00012850
010460 COPY CCLAMTBI.                                                   00012860
010470 EJECT                                                            00012870
010480 COPY CCLAMTBS.                                                   00012880
010490 EJECT                                                            00012890
010500 COPY CCLAMTHS.                                                   00012900
010510 EJECT                                                            00012910
010520 COPY CCLAMTKI.                                                   00012920
010530 EJECT                                                            00012930
010540 COPY CCLAMTKS.                                                   00012940
010550 EJECT                                                            00012950
010560 COPY CCLAPBKY.                                                   00012960
010570 EJECT                                                            00012970
010580 COPY CCLAPCKY.                                                   00012980
010610 EJECT                                                            00013010
010620 COPY CCLAPLKY.                                                   00013020
010630 EJECT                                                            00013030
010640 COPY CCLAPPLS.                                                   00013040
010650 EJECT                                                            00013050
010660 COPY CCLAPTHS.                                                   00013060
010670 EJECT                                                            00013070
011100 COPY CCLARTA REPLACING ==:TAG:==               BY ==WTA==,       00013080
011110                        ==:TYPE-OCCURS:==       BY ==300==,       00013090
011120                        ==:STAT-OCCURS:==       BY ==100==,       00013100
011130                        ==:SPCM-OCCURS:==       BY ==500==,       00013110
011140                        ==:UNEQ-STAT-OCCURS:==  BY ==100==,       00013120
011150                        ==:UNEQ-SPCM-OCCURS:==  BY ==128==,       00013130
011150                        ==:UNEQ-L1SIN-OCCURS:== BY ==100==.       00013130
010660 COPY CCLASCF.                                                    00013060
010670 EJECT                                                            00013070
010680******************************************************************00013140
010690 LINKAGE SECTION.                                                 00013150
010700******************************************************************00013160
010710                                                                  00013170
010740 COPY CCLACCF.                                                    00013200
010750 EJECT                                                            00013210
010760 COPY CCLACDA.                                                    00013220
010770 EJECT                                                            00013230
010780 COPY CCLACRF.                                                    00013240
010790 EJECT                                                            00013250
010340 COPY CCLAIOT.                                                    00012740
010350 EJECT                                                            00012750
010860 COPY CCLALDA.                                                    00013320
010870 EJECT                                                            00013330
010880 COPY CCLAOPS.                                                    00013340
010890 EJECT                                                            00013350
011040 COPY CCLATDA.                                                    00013520
011050 EJECT                                                            00013530
011000 COPY CCLATB10.                                                   00013460
011010 EJECT                                                            00013470
011080 COPY CCLACOA.                                                    00013560
011090 EJECT                                                            00013570
011100 COPY CCLARTA REPLACING ==:TAG:==               BY ==RTA==,       00013580
011110                        ==:TYPE-OCCURS:==       BY ==300==,       00013590
011120                        ==:STAT-OCCURS:==       BY ==100==,       00013600
011130                        ==:SPCM-OCCURS:==       BY ==500==,       00013610
011140                        ==:UNEQ-STAT-OCCURS:==  BY ==100==,       00013620
011150                        ==:UNEQ-SPCM-OCCURS:==  BY ==128==,       00013630
011150                        ==:UNEQ-L1SIN-OCCURS:== BY ==100==.       00013630
011160 EJECT                                                            00013640
011170 COPY CCLASBX.                                                    00013650
011180 EJECT                                                            00013660
011250******************************************************************00013730
011270  PROCEDURE DIVISION  USING CCF-COMMON-CONTROL-FLAGS              00013750
011280                            CDA-CONSUMER-DATA-AREA                00013760
011290                            CRF-COMMON-RECORD-FORMAT              00013770
011310                            IOT-INPUT-OUTPUT-TOTALS               00013790
011330                            LDA-LEGAL-DATA-AREA                   00013810
011340                            OPS-CONTROL-OPTIONS                   00013820
011400                            TDA-TRADE-DATA-AREA                   00013880
011420                            TB10-ZIP-CODE-RANGES                  00013900
011440                            COA-SEG-TOTALS-EXCEPTION-AREA         00013930
011450                            RTA-LA351-SUBCODE-REC                 00013940
011460                            SBX-SUBCODE-INDEX-TABLE-REC.          00013950
011510******************************************************************00014000
011520 EJECT                                                            00014010
011530******************************************************************00014020
011540 1A0100-OUTPUT-AND-COUNT-MAIN.                                    00014030
011550******************************************************************00014040

           INITIALIZE SCF-SCORECARD-FLAGS.                              00014050

011710     IF  CCF-EOF-REPORTER-DATA                                    00014190
011720     OR  CCF-ABEND                                                00014200
012360         MOVE ERC-NO  TO  CCF-OUTPUT-TO-CCSS-FLAG                 00014880
011760         PERFORM 8W0600-CALL-OUTPUT-DISCARD                       00014240
011770         PERFORM 8W0700-CALL-OUTPUT-RECYCLE                       00014250
011770         PERFORM 8W0800-CALL-OUTPUT-SCORECARD                     00014250
011800         PERFORM 8W0825-OUTPUT-CCSS                               00014280
011810         IF I01-NOT-FIRST-TIME                                    00014290
                   IF OPS-04-BALANCE-REPORTER  AND                      00014300
                      CCF-CCSS-UPDATE-WRITTEN                           00014310
                           PERFORM 4S0110-RTA-UPDATE-OUT-TRADE          00014320
                   END-IF                                               00014330
011820             SET SBX-PROCESS-OLD-SUB-ONLY TO TRUE                 00014340
                   PERFORM 8W0050-SUBCODE-DATA-MANAGER                  00014350
011840         END-IF                                                   00014360
011860         PERFORM 8W0925-CALL-CCSS-SAMPLE-RPTS                     00014380
011870         PERFORM 8W0950-CALL-OVERFLOW-REPORT                      00014390
011880     ELSE                                                         00014400
011890         PERFORM 3A0100-OUTPUT-ONE-RECORD.                        00014410
011900                                                                  00014420
011910     GOBACK.                                                      00014430
011920 EJECT                                                            00014440
011930******************************************************************00014450
011940 3A0100-OUTPUT-ONE-RECORD.                                        00014460
011950******************************************************************00014470
011970     PERFORM 4A0100-SET-OUTPUT-FLAGS.                             00014490
011980                                                                  00014500
011990     PERFORM 4J0100-SELECT-OUTPUT-FILES.                          00014510
012000                                                                  00014520
012030     PERFORM 4S0100-COUNT-OUTPUT-CCSS.                            00014550
012040                                                                  00014560
           IF  CCF-SCORECARD-Y
           AND NOT CCF-PARM-TYPE-Z
015950         PERFORM 8W0800-CALL-OUTPUT-SCORECARD                     00018920
           END-IF.

012050******************************************************************00014570
012060***  SCOPE OUT AN INTERVAL CHECK FOR CCSS PROCESSING !!!!!!      *00014580
012070******************************************************************00014590
012080                                                                  00014600
012110                                                                  00014630
035000     IF  OPS-05-CHECK-ERROR-PERCENT                               00041250
035010     AND OPS-05-PERCENT-LIMIT NUMERIC                             00041260
012090         ADD +1                      TO  A01-INTERVAL-COUNT       00014610
012120         IF  A01-INTERVAL-COUNT  >  C01-ERROR-CHECK-INTERVAL      00014640
012130             PERFORM 4X0100-CHECK-ERROR-COUNT                     00014650
               END-IF
           END-IF.
012140                                                                  00014660
012180     IF I02-SAMPLE-LIMIT-GEN-YES                                  00014700
012190         PERFORM 8W0925-CALL-CCSS-SAMPLE-RPTS.                    00014710
012200                                                                  00014720
012210     IF COA-CONSUMER-NAME  =  SPACES                              00014730
012220         CONTINUE                                                 00014740
012230     ELSE                                                         00014750
012240         PERFORM 8W0950-CALL-OVERFLOW-REPORT.                     00014760
012250                                                                  00014770
012270     PERFORM 8X0100-SAVE-SEARCH-VARIABLES.                        00014790
012280 EJECT                                                            00014800
012290******************************************************************00014810
012300 4A0100-SET-OUTPUT-FLAGS.                                         00014820
012310******************************************************************00014830
012320                                                                  00014840
012360     MOVE ERC-NO               TO  CCF-OUTPUT-TO-DISCARDS-FLAG    00014880
012400                                   CCF-OUTPUT-TO-RECYCLE-FLAG     00014920
012410                                   CCF-OUTPUT-TO-BYPASS-FLAG      00014930
012440                                   CCF-OUTPUT-TO-STALE-FLAG       00014960
012460                                   CCF-OUTPUT-TO-CCSS-FLAG.       00014980
012470                                                                  00015000
      *  RESET THE TRADE COUNTER FLAGS

           IF  CCF-BASE-SEG
               SET I06-NO-TRADE-DISCARD     TO TRUE
               SET I07-NO-TRADE-RECY        TO TRUE
               SET I08-NO-TRADE-NONSUB-RECY TO TRUE.

013380     IF  OPS-04-BALANCE-REPORTER                                  00016020
013400         PERFORM 4A0600-SET-TRADE                                 00016040
013410     ELSE                                                         00016050
013420         PERFORM 4A7000-SET-LEGAL.                                00016060

013430 EJECT                                                            00016070
013440******************************************************************00016080
013450 4A0600-SET-TRADE.                                                00016090
013460******************************************************************00016100
013470                                                                  00016110
013480     IF  TDA-SUBCODE-ERROR                                        00016120
013490     OR  TDA-STATUS-ERROR                                         00016130
013520     OR  TDA-SP-COMMENTS-ERROR                                    00016160
013530     OR  TDA-ACCT-TYPE-ERROR                                      00016170
013530     OR  CDA-ECOA-CODE-ERROR                                      00016170
013540     OR  (TDA-CYCLE-ID-ERROR AND OPS-40-CYCLE-TBL07)              00016180
013540     OR  TDA-CONSUMER-INFO-IND-INVALID                            00016180
013540     OR  TDA-PROCESSING-IND-INVALID                               00016180
013540     OR  TDA-L1SIN-INVALID                                        00016180
013540     OR  TDA-ST91-ACCTYPE-XERR-Y                                  00016180
013540     OR  TDA-SCC-STAT-AX-C-XERR-Y                                 00016180
013540     OR  TDA-SCC-STAT-BA-XERR-Y                                   00016180
013540     OR  TDA-SCC-STAT-BP-XERR-Y                                   00016180
013620     OR  TDA-SPECIAL-COMMENT-H-XERR                               00016280
           OR  TDA-SPECIAL-COMMENT-ATY-XERR
           OR  TDA-SUBCODE-CUSTMAST-ST-ERR-Y
           OR  TDA-SUBCODE-CUSTMST-TYPE-ERR-Y
           OR  TDA-BASE-SUB-KOB-AT-XERR-Y
           OR  TDA-L1-SUB-KOB-AT-XERR-Y
013550         SET CCF-OUTPUT-TO-RECYCLE TO TRUE                        00016190
           ELSE
013750        IF  CCF-REQUESTED-BYPASS                                  00016470
013760            SET CCF-OUTPUT-TO-BYPASS TO TRUE                      00016480
              ELSE
013830            IF  TDA-ACCT-NUM-ERROR                                00016550
013830            OR  TDA-NEW-ACCT-NUM-ERROR                            00016550
014080            OR  TDA-ACCTCHG-IND-INVALID                           00016600
                  OR  TDA-L1SIN-BYPASS
013850            OR  TDA-BAL-DATE-ERROR                                00016570
014080            OR  TDA-DATE-REPORT-ERROR                             00016600
014080            OR  TDA-DATE-OPENED-ERROR                             00016600
013860            OR  TDA-DATE-OF-OCC-DISC                              00016610
                  OR  TDA-COLL-ST93-OCC-REJ
                  OR  TDA-OCG-DATE-ERRORS                               00016610
014080            OR  TDA-CCC-INVALID                                   00016600
                  OR  TDA-COLL-LOAN-AMT-REJ-Y
                  OR  CDA-PII-FAILURE
                  OR  TDA-ORIG-CRED-SEG-XERR-Y
                  OR  TDA-ORIG-CRED-NM-XERR-Y
                  OR  (TDA-ORIG-CRED-NAME-INVALID
                        AND CCF-REQD-ORIG-CREDIT)
                  OR TDA-COLL-LOAN-AMT-DISC-Y
014110               SET CCF-OUTPUT-TO-DISCARDS TO TRUE                 00016890
013880         ELSE                                                     00016630
013890               SET CCF-OUTPUT-TO-CCSS TO TRUE.                    00016640
013560                                                                  00016230
015250******************************************************************00018060
015260 4A7000-SET-LEGAL.                                                00018070
015270******************************************************************00018080
015280                                                                  00018090
012480     PERFORM 8N0100-CHECK-NAME-ADDR-ERRORS.                       00015010

015290     IF (LDA-STATUS-ERROR AND NOT LDA-STATUS-DISCARD)             00018100
015310     OR LDA-COURT-CODE-ERROR                                      00018120
015320     OR LDA-SP-COMMENTS-ERROR                                     00018130
015340     OR LDA-COURT-CODE-STATUS-XERR-Y                              00018150
           OR LDA-COURT-CD-CUSTMAST-ST-ERR-Y
           OR LDA-COURT-CD-CSTMST-TYPE-ERR-Y
015340     OR LDA-COLLECTOR-ID-ERROR                                    00018150
015350     OR CDA-ECOA-CODE-ERROR                                       00018160
015360         SET CCF-OUTPUT-TO-RECYCLE  TO  TRUE                      00018170
015370     ELSE                                                         00018180
015380         IF  CCF-REQUESTED-BYPASS                                 00018190
015390             SET CCF-OUTPUT-TO-BYPASS  TO  TRUE                   00018200
015400         ELSE                                                     00018210
015410            IF LDA-DOCKET-NUMBER-ERROR                            00018220
015420            OR LDA-FILE-DATE-ERROR                                00018230
015430            OR CCF-BYPASS-REASON-CODE  =                          00018240
015440               ERC-BYPASS-CROSS-FIELD-ERROR                       00018250
015460            OR LDA-PR-STATUS-DATE-ERROR                           00018270
015470            OR LDA-PR-FILE-DATE-ERROR                             00018280
015480            OR LDA-VOLUNTARY-IND-ERROR                            00018300
015580            OR LDA-PLAINTIFF-NAME-ERROR                           00018470
                  OR (LDA-STATUS-ERROR AND LDA-STATUS-DISCARD)
015510            OR (LDA-ADJUST-PERCENT-ERROR     AND                  00018350
015520                (LDA-CHAPTER-THIRTEEN))                           00018360
015510            OR (NOT LDA-ADJUST-PERCENT-OMIT  AND                  00018370
015520                (LDA-CHAPTER-SEVEN  OR                            00018380
                       LDA-CHAPTER-ELEVEN OR                            00018390
015520                 LDA-CHAPTER-TWELVE))                             00018400
015530            OR (LDA-REPAY-PERCENT-ERROR   AND                     00018430
015540                (LDA-CHAPTER-THIRTEEN))                           00018440
015560            OR (LDA-BANKRUPTCY            AND                     00018450
015570                LDA-CCSS-DOCKET-ERROR)                            00018460
015580            OR (LDA-CIVIL-ACTION          AND                     00018490
010450                LDA-PLAINTIFF-B-P-ERROR)                          00018500
015580            OR (LDA-CIVIL-ACTION          AND                     00018510
015590                NOT (LDA-VALID-CCSS-DOCKET                        00018520
015590                OR   LDA-VALID-BOOK-PAGE-SEQ))                    00018530
015600            OR (LDA-LIEN                  AND                     00018540
015610                NOT (LDA-VALID-CERTIFICATE                        00018550
015610                OR   LDA-VALID-BOOK-PAGE-SEQ))                    00018560
015640            OR  I20-CCSS-NAME-ADDRESS-DISCARD                     00018570
015620                SET CCF-OUTPUT-TO-DISCARDS  TO  TRUE              00018580
015620            ELSE                                                  00018590
                      SET CCF-OUTPUT-TO-CCSS      TO TRUE               00018600
                      IF  LDA-STALE-RECORD
                          SET CCF-OUTPUT-TO-STALE TO TRUE.
015750 EJECT                                                            00018680
015860******************************************************************00018810
015870 4J0100-SELECT-OUTPUT-FILES.                                      00018820
015880******************************************************************00018830
015910                                                                  00018880
015970     IF  CCF-OUTPUT-TO-DISCARDS                                   00018940
015990         PERFORM 8W0600-CALL-OUTPUT-DISCARD                       00018950
           ELSE
016010         IF  CCF-OUTPUT-TO-RECYCLE                                00018970
               OR  CCF-OUTPUT-TO-STALE
016020             PERFORM 8W0700-CALL-OUTPUT-RECYCLE.                  00018990
016050                                                                  00019020
016690 EJECT                                                            00019100
024420******************************************************************00025740
024430 4S0100-COUNT-OUTPUT-CCSS.                                        00025750
024440******************************************************************00025760
      ***
      ** THIS SETUP FLAGS PAY AMOUNT PRINT
      ***
021910     IF  CCF-OUTPUT-TO-CCSS AND NOT OPS-04-LEGAL                  00023190
021920         IF  TDA-VALID-PAYMENT-AMOUNT                             00023200
021940             MOVE TDA-PAYMENT-AMOUNT-FLAG                         00023220
021950                               TO  TDA-PAY-AMT-PRINT-FLAG         00023230
021960         ELSE                                                     00023240
021970             IF  TDA-BYPASS-PAYMENT-AMOUNT                        00023250
021980                 IF  TDA-PAY-AMT-OPT-BYPASS                       00023260
021990                 AND TDA-STATUS-PAY-AMT-ALLOWED                   00023270
022000                 AND TDA-VALID-BAL-AMT                            00023280
022020                     MOVE TDA-PAY-AMT-PROCESS-OPT                 00023300
022030                               TO  TDA-PAY-AMT-PRINT-FLAG         00023310
022040                 ELSE                                             00023320
022050                     NEXT SENTENCE                                00023330
022060             ELSE                                                 00023340
022070                 IF  TDA-PAY-AMT-OPT-SCHED                        00023350
022090                     MOVE TDA-PAY-AMT-PROCESS-OPT                 00023370
022100                               TO  TDA-PAY-AMT-PRINT-FLAG         00023380
022110                 ELSE                                             00023390
022120                    IF  TDA-PAY-AMT-OPT-TERMS                     00023400
022140                        MOVE TDA-PAY-AMT-PROCESS-OPT              00023420
022150                               TO  TDA-PAY-AMT-PRINT-FLAG         00023430
022160                    ELSE                                          00023440
022210                        SET TDA-PAY-AMT-PRINT-TBL02-ERR TO TRUE.  00023490

021910     IF  CCF-OUTPUT-TO-CCSS
021910     AND CDA-ECOA-CODE-X
021910     AND NOT OPS-04-LEGAL
               ADD +1 TO IOT-ECOA-X-TO-OUTPUT
           END-IF.

      *----------------------------------------------------------------*00025780
      * PR41002C CORRECT RTA-UPDATE-OUT COUNTING 2/8/95: REMEMBER THAT  00025790
      * THE CURRENT RECORD MAY BE FLAGGED TO GO TO FILE.                00025800
      *----------------------------------------------------------------*00025870

016190     MOVE CCF-OUTPUT-TO-CCSS-FLAG TO M99-OUTPUT-TO-CCSS-FLAG.     00025820
016190                                                                  00025830
016200     IF  CCF-OUTPUT-TO-CCSS                                       00025840
016220         PERFORM 8W0825-OUTPUT-CCSS.                              00025850
      *----------------------------------------------------------------*00025870
      * PR41002C CORRECT RTA-UPDATE-OUT COUNTING 2/8/95: IF A RECORD    00025880
      * WENT TO FILE IT IS NEVER THE CURRENT RECORD IN PROCESS FOR      00025890
      * TRADE; BUT ALWAYS A PREVIOUS ONE; SPECIAL PROCESS NEEDED TO     00025900
      * UPDATE THE OUTPUT COUNT ON THE RIGHT CORRESPONDING RTA RECORD.  00025910
      * FOR PUBLIC RECORD, THE RECORD GOING TO FILE IS ALWAYS THE       00025920
      * CURRENT ONE IN PROCESS.                                         00025930
      *----------------------------------------------------------------*00025940
           IF CCF-CCSS-UPDATE-WRITTEN AND OPS-04-BALANCE-REPORTER       00025950
              PERFORM 4S0110-RTA-UPDATE-OUT-TRADE.                      00025970
                                                                        00025980
           PERFORM 4S1000-FIND-TABLE-POSITION.                          00025990
                                                                        00026000
           IF CCF-CCSS-UPDATE-WRITTEN AND OPS-04-LEGAL                  00025950
               ADD 1      TO RTA-UPDATE-OUT.                            00026030
                                                                        00026040
      *----------------------------------------------------------------*00026050
      * PR41002C CORRECT RTA-UPDATE-OUT COUNTING 2/8/95: IF THE         00026060
      * CURRENT RECORD IS FLAGGED TO GO TO FILE, SAVE ITS SUBCODE       00026070
      * KEY VALUE FOR LATER RETRIEVAL OF THE RTA RECORD.  ALSO, WE      00026080
      * KNOW WHERE THIS IS IN THE SBX TABLE BECAUSE WE JUST "READ"      00026090
      * THAT RTA OUT OF CORE OR JUST RE-INITIALIZED AND RESERVED        00026100
      * THE NEXT AVAILABLE SLOT IN THE TABLE FOR THE NEXT "WRITE".      00026110
      * SO, SAVE THAT INDEX VALUE TO LIMIT THE CCLC200 TABLE SEARCH     00026120
      * WHEN WE WANT TO RETRIEVE IT LATER.                              00026130
      *----------------------------------------------------------------*00026140
           IF M99-OUTPUT-TO-CCSS                                        00026150
               MOVE SBX-NEW-SUBCODE-AND-FLAG TO                         00026160
                    M99-OLD-SUBCODE-AND-FLAG                            00026170
               MOVE SBX-INDEX-PASSED TO M99-INDEX-PASSED                00026180
           END-IF.                                                      00026190
                                                                        00026200
016130     MOVE ERC-NO            TO I02-CCSS-SAMPLE-LIMIT-FLAG.        00026220
                                                                        00026200
016150     IF  CCF-OUTPUT-TO-DISCARDS                                   00026280
016150     OR  CCF-OUTPUT-TO-BYPASS                                     00026280
016150     OR  CCF-CCSS-UPDATE-REC                                      00026280
016180         PERFORM 4S0200-CHECK-CCSS-SAMPLES.                       00026330
016190                                                                  00026340
016240     IF I02-SAMPLE-LIMIT-GEN-YES                                  00026380
016150        IF  CCF-OUTPUT-TO-DISCARDS                                00026280
016150        OR  CCF-OUTPUT-TO-BYPASS                                  00026280
016250             PERFORM 8W0825-OUTPUT-CCSS                           00026390
                   IF CCF-CCSS-UPDATE-WRITTEN                           00025950
                      PERFORM 4S0110-RTA-UPDATE-OUT-TRADE.              00025970
                                                                        00025980
024480     PERFORM 4S2000-COUNT-INPUT-TOTALS.                           00026430
024490                                                                  00026520
024580     IF  CCF-OUTPUT-TO-DISCARDS                                   00026530
024550         PERFORM 4S6000-COUNT-DISCARD-TOTALS                      00026540
024520     ELSE                                                         00026550
024590     IF  CCF-OUTPUT-TO-BYPASS                                     00026560
024540         PERFORM 4S5000-COUNT-BYPASS-TOTALS                       00026570
024520     ELSE                                                         00026580
024590     IF  CCF-OUTPUT-TO-RECYCLE                                    00026590
024530         PERFORM 4S4000-COUNT-RECYCLE-TOTALS                      00026600
               IF CCF-BASE-SEG
024620            PERFORM 4S7000-COUNT-MISC-BASE-TOTALS                 00026690
               END-IF
024620         PERFORM 4S7100-COUNT-MISC-SEGS-TOTALS                    00026690
024630         PERFORM 4S8000-COUNT-CONSUMER-ERRORS                     00026700
           ELSE
024500     IF  CCF-CCSS-UPDATE-REC                                      00026620
               IF CCF-BASE-SEG
                  PERFORM 4S3000-COUNT-UPD-BASE-TOTALS                  00026630
024620            PERFORM 4S7000-COUNT-MISC-BASE-TOTALS                 00026690
024700            PERFORM 4S8400-COUNT-GRID-ERRORS                      00026810
               END-IF
024510         PERFORM 4S3100-COUNT-UPD-SEGS-TOTALS                     00026630
024620         PERFORM 4S7100-COUNT-MISC-SEGS-TOTALS                    00026690
024630         PERFORM 4S8000-COUNT-CONSUMER-ERRORS.                    00026700
024570                                                                  00026640
024570                                                                  00026640
024610     IF  CCF-OUTPUT-TO-RECYCLE                                    00026680
024610     OR  CCF-OUTPUT-TO-DISCARDS                                   00026680
               IF OPS-04-BALANCE-REPORTER                               00026760
024690             PERFORM 4S8200-COUNT-TRADE-ERRORS                    00026770
               ELSE                                                     00026780
024710             PERFORM 4S8600-COUNT-LEGAL-ERRORS                    00026790
               END-IF                                                   00026800
           END-IF.                                                      00026820
       EJECT                                                            00026830
      ******************************************************************00026860
       4S0110-RTA-UPDATE-OUT-TRADE.                                     00026850
      ******************************************************************00026860
      *----------------------------------------------------------------*00027100
      * PR41002C CORRECT RTA-UPDATE-OUT COUNTING 2/8/95: PROCESS IS     00026880
      * PERFORMED WHEN A PRIOR CCSS TRADE RECORD WENT TO FILE ON THE    00026890
      * CURRENT CALL TO THIS PROGRAM.  WITH LUCK,  THE CORRESPONDING    00026900
      * RTA RECORD IS AVAILABLE BECAUSE THE CURRENT RECORD HAS THE      00026910
      * SAME SUBCODE KEY; THEN JUST INCREMENT THE COUNT AND EXIT.       00026920
      * OTHERWISE, THE RIGHT RTA MUST BE RETRIEVED FROM DYNAMIC CORE    00026930
      * BEFORE ADDING TO THE COUNT.                                     00026940
      *----------------------------------------------------------------*00027100
           IF M99-OLD-SUBCODE-AND-FLAG NOT = SPACES AND                 00026960
              M99-OLD-SUBCODE-AND-FLAG NOT =                            00026970
              SBX-OLD-SUBCODE-AND-FLAG                                  00026980
               PERFORM 4S0120-MANAGE-UPDATE-OUT-TRADE                   00026990
           ELSE                                                         00027000
               IF M99-OLD-SUBCODE-AND-FLAG NOT = SPACES                 00027010
                   ADD 1 TO RTA-UPDATE-OUT                              00027020
                   PERFORM 4S0130-COUNT-E1-L1-CHG
               END-IF                                                   00027030
           END-IF.                                                      00027040
                                                                        00027050
       EJECT                                                            00027060
      ******************************************************************00027070
       4S0120-MANAGE-UPDATE-OUT-TRADE.                                  00027080
      ******************************************************************00027090
      *----------------------------------------------------------------*00027100
      * PR41002C CORRECT RTA-UPDATE-OUT COUNTING 2/8/95: PROCESS        00027110
      * FETCHES THE RTA RECORD FOR THE CCSS TRADE REC THAT WENT TO FILE:00027120
      * FIRST, IT SAVES THE STATE OF THE CURRENT RTA; CALLS THE         00027130
      * CORE MGR MODULE WITH A READ REQUEST PASSING THE CORRECT         00027140
      * SUBCODE KEY INFORMATION; INCREMENTS THE COUNT; CALLS THE        00027150
      * CORE MGR MODULE AGAIN REQUESTING AN UPDATE OF THAT RTA RECORD;  00027160
      * FINALLY, THE PREVIOUSLY SAVED RTA STATE VALUES ARE RESTORED.    00027170
      *----------------------------------------------------------------*00027180
                                                                        00027190
           MOVE SBX-SUBCODE-CONTROL-AREA  TO M99-SUBCODE-CONTROL-AREA.  00027200
           MOVE RTA-LA351-SUBCODE-REC     TO WTA-LA351-SUBCODE-REC.     00027210
           MOVE SPACES                    TO SBX-OLD-SUBCODE-AND-FLAG.  00027220
           MOVE M99-OLD-SUBCODE-AND-FLAG  TO SBX-NEW-SUBCODE-AND-FLAG.  00027230
           MOVE M99-INDEX-PASSED          TO SBX-INDEX-PASSED.          00027240
           SET SBX-PROCESS-NEW-SUB-ONLY   TO TRUE.                      00027250
           PERFORM 8W0075-CALL-SUBC-DATA-MGR.                           00027260
           ADD 1                          TO RTA-UPDATE-OUT.            00027270
           PERFORM 4S0130-COUNT-E1-L1-CHG.
           SET SBX-PROCESS-OLD-SUB-ONLY   TO TRUE.                      00027280
           PERFORM 8W0075-CALL-SUBC-DATA-MGR.                           00027290
           MOVE M99-SUBCODE-CONTROL-AREA  TO SBX-SUBCODE-CONTROL-AREA.  00027300
           MOVE WTA-LA351-SUBCODE-REC     TO RTA-LA351-SUBCODE-REC.     00027310
           MOVE SPACES                    TO M99-OLD-SUBCODE-AND-FLAG.  00027320
                                                                        00027330
      ******************************************************************00027070
       4S0130-COUNT-E1-L1-CHG.                                          00027080
      ******************************************************************00027090
      *----------------------------------------------------------------*00027100
      * COUNT THE NUMBER OF E1/L1 SUBCODE AND ACCOUNT NUMBER CHANGES    00027110
      * SENT TO TRU.  LIKE THE TRU COUNT, THIS MUST HAPPEN AFTER THE    00027120
      * TRU RECORD IS WRITTEN.                                          00027130
      *----------------------------------------------------------------*00027180
                                                                        00027190
           IF CCF-SIN-CHG-TO-FILE
              ADD 1 TO RTA-L1-SIN-CHG-CT
           ELSE
              IF CCF-ACCT-NUM-CHG-TO-FILE
                 ADD 1 TO RTA-E1-L1-ACCT-CHG-CT
              ELSE
                 IF CCF-SIN-AND-ACCT-CHG-TO-FILE
                    ADD 1 TO RTA-L1-SIN-ACCT-CHG-CT
                 END-IF
              END-IF
           END-IF.
           SET CCF-NO-MKCS-TO-FILE TO TRUE.
024720 EJECT                                                            00027340
016890******************************************************************00027350
016900 4S0200-CHECK-CCSS-SAMPLES.                                       00027360
016910******************************************************************00027370
016920* IF THE CCSS SAMPLE REPORT LIMIT HAS BEEN EXCEEDED FOR THE       00027380
016930* SAMPLE REPORT TYPE AND SUBCODE ASSOCIATED WITH THE CURRENT      00027390
016940* TRANSACTION; AND THIS WILL NOT BE A VALID SAMPLE (CURRENT       00027400
016950* TRANSACTION IS NOT GOING TO CCSS UPDATE) - THEN, THERE IS       00027410
016960* NO NEED TO CALL THE CCSS OUTPUT MODULE TO POPULATE THE CCSS     00027420
016970* OUTPUT FIELDS.                                                  00027430
016980*                                                                 00027440
016990* THIS CHECK WILL LIMIT THE NUMBER OF CALLS, TO CCSS OUTPUTS,     00027450
017000* TO THE COUNTS PER SUBCODE SET OF NON VALID TRANSACTIONS.        00027460
017010*----------------------------------------------------------------*00027470
017020                                                                  00027480
017030     SET SBX-IDX             TO SBX-INDEX-PASSED.                 00027490
017040     SET CCF-SMP-OUTPUT-NO-DEST    TO TRUE.                       00027500
017050     SET CCF-SMP-OUTPUT-MP-NO-DEST TO TRUE.                       00027510
017070     IF CCF-OUTPUT-TO-DISCARDS                                    00027540
017080         SET CCF-SMP-OUTPUT-DISCARD TO TRUE                       00027570
017090     ELSE                                                         00027580
017100     IF CCF-REQUESTED-BYPASS                                      00027590
017110         SET CCF-SMP-OUTPUT-BYPASS  TO TRUE                       00027600
017120     ELSE                                                         00027610
017180         SET CCF-SMP-OUTPUT-VALID   TO TRUE.                      00027710
017190                                                                  00027760
017200     IF CCF-SMP-OUTPUT-DISCARD                                    00027770
017220        IF ((SBX-DISCARD-COUNT (SBX-IDX) + 1 NOT >                00027790
017230            OPS-62-DISCARD-RECORD-LIMIT  AND                      00027800
017250            OPS-62-PRINT-LIMIT)                                   00027820
017270            OR  OPS-62-PRINT-ALL)                                 00027840
017280                MOVE ERC-YES TO I02-CCSS-SAMPLE-LIMIT-FLAG        00027850
              END-IF
           END-IF.
017290                                                                  00027860
017300     IF CCF-SMP-OUTPUT-BYPASS                                     00027870
017320        IF ((SBX-BYPASS-COUNT (SBX-IDX) + 1 NOT >                 00027890
017330            OPS-61-BYPASS-RECORD-LIMIT AND                        00027900
017350            OPS-61-PRINT-LIMIT)                                   00027920
017370            OR  OPS-61-PRINT-ALL)                                 00027940
017380                MOVE ERC-YES TO I02-CCSS-SAMPLE-LIMIT-FLAG        00027950
              END-IF
           END-IF.
017390                                                                  00027960
017460     IF CCF-SMP-OUTPUT-VALID                                      00028030
017480        IF  ((SBX-VALID-COUNT (SBX-IDX) + 1  NOT >                00028050
017490            OPS-60-VALID-RECORD-LIMIT AND                         00028060
017510            OPS-60-PRINT-LIMIT)                                   00028080
017530            OR  OPS-60-PRINT-ALL)                                 00028100
017540                MOVE ERC-YES TO I02-CCSS-SAMPLE-LIMIT-FLAG        00028110
              END-IF
           END-IF.
                                                                        00028220
017620     IF TDA-PAY-AMT-PRINT-SCHED-ERR
017630        IF SBX-MP-OPT-S-ERR-COUNT (SBX-IDX) + 1 NOT >             240
017640           C01-MP-LIMIT                                           00028250
017650              MOVE ERC-YES TO I02-CCSS-SAMPLE-LIMIT-FLAG          00028260
017660              SET  CCF-PAY-AMT-PRINT-SCHED-ERR TO TRUE            00028270
              END-IF
            ELSE
017690        IF TDA-PAY-AMT-PRINT-TERMS-ERR                            00028300
017700           IF SBX-MP-OPT-T-ERR-COUNT (SBX-IDX) + 1 NOT >          00028310
017710              C01-MP-LIMIT                                        00028320
017720              MOVE ERC-YES TO I02-CCSS-SAMPLE-LIMIT-FLAG          00028330
017740              SET CCF-PAY-AMT-PRINT-TERMS-ERR TO TRUE             00028350
017750            END-IF                                                00028360
017760        ELSE                                                      00028370
01770            IF TDA-PAY-AMT-PRINT-TBL02-ERR                         00028380
017780              IF SBX-MP-TB02-ERR-COUNT (SBX-IDX) + 1 NOT >        00028390
017790                 C01-MP-LIMIT                                     00028400
017800                   MOVE ERC-YES TO I02-CCSS-SAMPLE-LIMIT-FLAG     00028410
017820                   SET CCF-PAY-AMT-PRINT-TBL02-ERR TO TRUE        00028430
017840              END-IF.                                             00028450
017870                                                                  00028480
017880 EJECT                                                            00028490
024730******************************************************************00028500
024740 4S1000-FIND-TABLE-POSITION.                                      00028510
024750******************************************************************00028520
024760                                                                  00028530
024770                                                                  00028540
024780***  THIS PARAGRAPH WILL POSITION ALL OF THE INDEXES TO THE VALUES00028550
024790***  ON THE INPUT RECORD.  WHEN THIS PROGRAM IS EXITED, ALL OF THE00028560
024800***  RTA INDEXES ARE SAVED IN WORKING STORAGE AS THE S01 FIELDS.  00028570
024810***  WHEN WE COME BACK INTO THE PROGRAM, WE SET THE INDEXES BACK  00028580
024820***  TO THE VALUES THAT WE LEFT THEM AT.  THE TRANSACTION VALUES  00028590
024830***  ARE CHECKED AGAINST THE TABLE VALUES.  IF THEY ARE THE SAME, 00028600
024840***  WE CAN CONTINUE PROCESSING.  IF NOT, THE TABLES ARE SEARCHED 00028610
024850***  IN ORDER TO FIND THE PROPER POSITIONING.  WHEN EITHER A MATCH00028620
024860***  IS FOUND, OR A NEW TABLE ENTRY IS ADDED, WE CAN BEGIN TO     00028630
024870***  ACCUMULATE TOTALS.                                           00028640
024880                                                                  00028650
024890                                                                  00028660
024900     PERFORM 4S1100-RESET-SEARCH-VARIABLES.                       00028670
024910                                                                  00028680
024920*----------------------------------------------------------------*00028690
024930* TO ENSURE THAT WE BYPASS THE OLD SUBCODE STORAGE PROCESS ON     00028700
024940* THE FIRST TIME PASS, AND ONLY DO THE PROCESS TO SETUP FOR       00028710
024950* THE NEW SUBCODE WE INDICATE THAT ONLY THE NEW SUBCODE IS THERE. 00028720
024960*----------------------------------------------------------------*00028730
024970     IF I01-FIRST-TIME                                            00028740
024980         SET I01-NOT-FIRST-TIME TO TRUE                           00028750
               MOVE 1                 TO SBX-INDEX-PASSED               00028760
024990         SET SBX-PROCESS-NEW-SUB-ONLY TO TRUE                     00028770
025000         PERFORM 8W0050-SUBCODE-DATA-MANAGER                      00028780
025010     ELSE                                                         00028790
025020         IF M99-SUBCODE-AND-FLAG NOT = SBX-OLD-SUBCODE-AND-FLAG   00028800
025050             SET SBX-PROCESS-BOTH-SUB TO TRUE                     00028810
025060             PERFORM 8W0050-SUBCODE-DATA-MANAGER                  00028820
025070         END-IF                                                   00028830
025080     END-IF.                                                      00028840
      *---------------------------------------------------------------* 00028850
      * PR41002C SEP 1.2.1.5 (AHA-LA351/DB2 EXPERT TABLES)              00028860
      * FOR THE CCSS AHA RECORD, WE MUST INDICATE THAT EITHER THIS      00028870
      * IS A NON-CYCLE REPORTER OR THAT THERE ARE MULTIPLE CYCLES       00028880
      * FOR A GIVEN SUBCODE BY SETTING THE RTA-CYCLE TO '00'.           00028890
      * OTHERWISE, THE SINGLE CYCLE ID VALUE FOR THAT SUBCODE WILL      00028900
      * BE PASSED.  THE PARALLEL CHECK TAKES PLACE IN THE               00028910
      * CCSS TRADE SORT/DEDUP STEP FOR WHEN THE AHA RECORD GETS         00028920
      * WRITTEN THERE.  ONLY RECORDS THAT ARE BEING WRITTEN TO THE      00028930
      * OUTPUT FILE SHOULD GO THROUGH THIS LOGIC.
      *---------------------------------------------------------------* 00028940
           IF M99-OUTPUT-TO-CCSS
               IF RTA-CYCLE-ID NOT = SPACES                             00028950
                   IF RTA-CYCLE-ID NOT = '00' AND                       00028960
                      TDA-CYCLE-IDENTIFIER NOT = RTA-CYCLE-ID           00028970
                      MOVE '00'           TO  RTA-CYCLE-ID              00029020
                   END-IF                                               00029030
               ELSE                                                     00029040
                   IF OPS-40-SELECTED                                   00029080
                      IF TDA-CYCLE-IDENTIFIER NOT = SPACES
                         MOVE TDA-CYCLE-IDENTIFIER TO RTA-CYCLE-ID      00029110
                      ELSE                                              00029120
                         MOVE '00'           TO RTA-CYCLE-ID            00029130
                      END-IF
                   ELSE
                       MOVE '00'             TO RTA-CYCLE-ID
                   END-IF
               END-IF
           END-IF.
                                                                        00029190
           MOVE TDA-BASE-KOB-CODE            TO RTA-KOB-CODE.
025090****************                                                  00029200
025100* ACCOUNT-TYPE, ECOA, SPECIAL COMMENTS, CUST INFO IND             00029210
025110* AND PROCESSING IND ARE ACCUMULATED WITH FROM AND TO VALUES      00029220
025240****************                                                  00029350
025240***********                                                       00029350
025240* ACCT TYPE                                                       00029350
025240***********                                                       00029350
025130     IF  M99-VALID-ACCT-TYPE                                      00029240
025140         IF  CRF-ACCOUNT-TYPE  =  RTA-FROM-TYPE (RTA-I2)          00029250
025150             CONTINUE                                             00029260
025160          ELSE                                                    00029270
025170             PERFORM 4S1550-SEARCH-FROM-TO-TYPE                   00029280
025180     ELSE                                                         00029290
025220     IF  M99-ACCT-TYPE-ERROR                                      00029330
025230         PERFORM 4S1200-SEARCH-UNEQ-TYPE.                         00029340
025240*******                                                           00029350
025240* ECOA                                                            00029350
025240*******                                                           00029350
025250     IF  CDA-VALID-ECOA-CODE                                      00029360
025260         IF CRF-HOLD-ECOA-CODE  =  RTA-FROM-ECOA (RTA-I3)         00029370
025270            CONTINUE                                              00029380
025280         ELSE                                                     00029390
025290             PERFORM 4S1525-SEARCH-FROM-TO-ECOA                   00029400
025300     ELSE                                                         00029410
025310     IF  CDA-ECOA-CODE-ERROR                                      00029420
025330         PERFORM 4S1225-SEARCH-UNEQ-ECOA.                         00029460
025340                                                                  00029470
025240*********                                                         00029350
025240* STATUS                                                          00029350
025240*********                                                         00029350
025470     IF  M99-VALID-STATUS                                         00029600
025440         IF  M99-STATUS  =  RTA-STATUS (RTA-I5)                   00029570
025450             CONTINUE                                             00029580
025460         ELSE                                                     00029590
025510             PERFORM 4S1300-SEARCH-STATUS                         00029650
025520     ELSE                                                         00029660
               IF LDA-STATUS-DISCARD
                  CONTINUE
               ELSE
025530            IF  M99-STATUS-ERROR                                  00029670
025540                PERFORM 4S1325-SEARCH-UNEQ-STATUS.                00029680
025550                                                                  00029690
025240*************                                                     00029350
025240* SPECIAL COMMENT                                                 00029350
025240*************                                                     00029350
025560     IF  M99-VALID-SP-COM                                         00029700
025570         IF CRF-HOLD-SPECIAL-COMMENT = RTA-FROM-SP-COM (RTA-I6)   00029710
025580            CONTINUE                                              00029720
025590          ELSE                                                    00029730
025600             PERFORM 4S1500-SEARCH-FROM-TO-SP-COM                 00029740
025610     ELSE                                                         00029750
025620     IF  M99-SP-COM-ERROR                                         00029760
025660         PERFORM 4S1350-SEARCH-UNEQ-SP-COM.                       00029800
025670                                                                  00029810
025240*******                                                           00029350
025240* CYCLE                                                           00029350
025240*******                                                           00029350
025710     IF  TDA-CYCLE-ID-ERROR AND OPS-40-CYCLE-TBL07                00029850
025720         PERFORM 4S1375-SEARCH-UNEQ-CYCLE.                        00029860
025730                                                                  00029870
      *************
      ** CII
      *************
           IF TDA-CONSUMER-INFO-IND-2 = SPACES
              CONTINUE
           ELSE
              MOVE TDA-CONSUMER-INFO-IND-2 TO M99-CII
              PERFORM 4S1575-SEARCH-FROM-TO-CII
              SET S01-SECOND-CII TO RTA-I7.

           MOVE TDA-CONSUMER-INFO-IND TO M99-CII.

025130     IF  M99-VALID-CII                                            00029240
025140         IF  (CRF-HOLD-CII = RTA-FROM-CII (RTA-I7)                00029250
                   AND OPS-03-NEW-METRO)
               OR  (M99-CII = RTA-FROM-CII (RTA-I7)
                    AND OPS-03-OLD-METRO)
025150             CONTINUE                                             00029260
025160          ELSE                                                    00029270
025170             PERFORM 4S1575-SEARCH-FROM-TO-CII                    00029280
025180     ELSE                                                         00029290
025190     IF  CRF-HOLD-CII = RTA-UNEQ-CII (RTA-IG)                     00029300
025200         CONTINUE                                                 00029310
025210     ELSE                                                         00029320
025220     IF  M99-CII-INVALID                                          00029330
025230         PERFORM 4S1400-SEARCH-UNEQ-CII.                          00029340
025240                                                                  00029350
      *************
      ** PI
      *************
025130     IF  M99-VALID-PI                                             00029240
025140         IF  CRF-PROCESSING-INDICATOR  =  RTA-FROM-PI (RTA-I8)    00029250
025150             CONTINUE                                             00029260
025160          ELSE                                                    00029270
025170             PERFORM 4S1600-SEARCH-FROM-TO-PI                     00029280
025180     ELSE                                                         00029290
025220     IF  M99-PI-INVALID                                           00029330
025230         PERFORM 4S1425-SEARCH-UNEQ-PI.                           00029340
025240                                                                  00029350
025240*********                                                         00029350
025240* CCC                                                             00029350
025240*********                                                         00029350
025470     IF  TDA-CCC-VALID                                            00029600
025440         IF  TDA-COMPLIANCE-COND-CODE  =  RTA-CCC (RTA-I9)        00029570
025450             CONTINUE                                             00029580
025460         ELSE                                                     00029590
025510             PERFORM 4S1625-SEARCH-CCC.                           00029650
025550                                                                  00029690
025240*********                                                         00029350
025240* CREDITOR CLASSIFICATION                                         00029350
025240*********                                                         00029350
025470     IF  TDA-CREDITOR-CLASS-VALID                                 00029600
025440         IF  TDA-CREDITOR-CLASS        =  RTA-CRCL (RTA-IJ)       00029570
025450             CONTINUE                                             00029580
025460         ELSE                                                     00029590
025510             PERFORM 4S1650-SEARCH-CREDITOR-CLASS.                00029650
025550                                                                  00029690
025240*********                                                         00029350
025240* COURT CODE/STATUS                                               00029350
025240*********                                                         00029350
025470     IF  LDA-COURT-CODE-STATUS-XERR-Y                             00029600
025440         IF  LDA-LEGAL-STATUS  =  RTA-LEGAL-STATUS (RTA-IK)       00029570
025450             CONTINUE                                             00029580
025460         ELSE                                                     00029590
025510             PERFORM 4S1675-SEARCH-LEGAL-STATUS.                  00029650
025550                                                                  00029690
025240*********                                                         00029350
025240* COURT CODE/COLLECTOR ID                                         00029350
025240*********                                                         00029350
025470     IF  LDA-COLLECTOR-ID-ERROR                                   00029600
025440         IF  LDA-COLLECTOR-ID  =  RTA-COLLECTOR-ID (RTA-IL)       00029570
025450             CONTINUE                                             00029580
025460         ELSE                                                     00029590
025510             PERFORM 4S1700-SEARCH-COLLECTOR-ID.                  00029650
025550                                                                  00029690
      *************
      ** BASE KOB/ACCOUNT TYPE ERRORS
      *************
025220     IF  TDA-BASE-SUB-KOB-AT-XERR-Y                               00029330
025440         IF  TDA-ACCOUNT-TYPE  =  RTA-BASE-KOB-AT (RTA-IN)        00029570
025450             CONTINUE                                             00029580
025460         ELSE                                                     00029590
025230             PERFORM 4S1725-SEARCH-KOB-ACCT-TYPE.                 00029340
025240                                                                  00029350
      *************
      ** L1 KOB/ACCOUNT TYPE ERRORS
      *************
025220     IF  TDA-L1-SUB-KOB-AT-XERR-Y                                 00029330
025440         IF  TDA-ACCOUNT-TYPE  = RTA-L1-KOB-AT (RTA-IO)           00029570
               AND TDA-L1SIN         = RTA-L1-KOB-SIN (RTA-IO)
               AND TDA-L1-KOB-CODE   = RTA-L1-KOB-CODE (RTA-IO)
025450             CONTINUE                                             00029580
025460         ELSE                                                     00029590
025230             PERFORM 4S1750-SEARCH-L1-KOB-ACCT-TYPE.              00029340

025240*********                                                         00029350
025240* PORTFOLIO-TYPE                                                  00029350
025240*********                                                         00029350
025470                                                                  00029600
025470     IF  TDA-PORTFOLIO-TYPE-VALID                                 00029600
025440         IF  TDA-PORTFOLIO-TYPE  =  RTA-PT (RTA-IP)               00029570
 25450             CONTINUE                                             00029580
025460         ELSE                                                     00029590
025510             PERFORM 4S1775-SEARCH-PT.                            00029650
025550                                                                  00029690
      *************
      ** L1SIN
      *************
025220     IF  TDA-L1SIN-INVALID                                        00029330
025230         PERFORM 4S1450-SEARCH-UNEQ-L1SIN.                        00029340
025240                                                                  00029350
      *************
      ** CROSS FIELD ERRORS
      *************
           IF  TDA-SCC-STAT-AX-C-XERR-Y
           OR  TDA-SCC-STAT-BA-XERR-Y
           OR  TDA-SCC-STAT-BP-XERR-Y
           OR  TDA-ST91-ACCTYPE-XERR-Y
           OR  TDA-SPECIAL-COMMENT-H-XERR
           OR  TDA-SPECIAL-COMMENT-ATY-XERR
025230         PERFORM 4S1475-CROSSFIELD-COUNTS.                        00029340
425740 EJECT                                                            00029880
025750******************************************************************00029890
025760 4S1100-RESET-SEARCH-VARIABLES.                                   00029900
025770******************************************************************00029910
025780***  THIS WILL RESET THE INDEXES TO THEIR PREVIOUS VALUES SO WE   00029920
025790***  CAN PICK UP TABLE PROCESSING AT THE PLACE WE LEFT OFF.       00029930
025800                                                                  00029940
025810     SET RTA-I2                 TO  S01-PREV-RTA2.                00029950
025820     SET RTA-I3                 TO  S01-PREV-RTA3.                00029960
025840     SET RTA-I5                 TO  S01-PREV-RTA5.                00029980
025850     SET RTA-I6                 TO  S01-PREV-RTA6.                00029990
025860     SET RTA-I7                 TO  S01-PREV-RTA7.                00030000
025870     SET RTA-I8                 TO  S01-PREV-RTA8.                00030010
025870     SET RTA-I9                 TO  S01-PREV-RTA9.                00030010
025890     SET RTA-IA                 TO  S01-PREV-RTAA.                00030030
025900     SET RTA-IB                 TO  S01-PREV-RTAB.                00030040
025910     SET RTA-ID                 TO  S01-PREV-RTAD.                00030050
025910     SET RTA-IE                 TO  S01-PREV-RTAE.                00030050
025910     SET RTA-IF                 TO  S01-PREV-RTAF.                00030050
025910     SET RTA-IG                 TO  S01-PREV-RTAG.                00030050
025910     SET RTA-IH                 TO  S01-PREV-RTAH.                00030050
025910     SET RTA-II                 TO  S01-PREV-RTAI.                00030050
025910     SET RTA-IJ                 TO  S01-PREV-RTAJ.                00030050
025910     SET RTA-IK                 TO  S01-PREV-RTAK.                00030050
025910     SET RTA-IL                 TO  S01-PREV-RTAL.                00030050
025910     SET RTA-IM                 TO  S01-PREV-RTAM.                00030050
025910     SET RTA-IN                 TO  S01-PREV-RTAN.                00030050
025910     SET RTA-IO                 TO  S01-PREV-RTAO.                00030050
025910     SET RTA-IP                 TO  S01-PREV-RTAP.                00030050
025920                                                                  00030060
026080     IF OPS-04-BALANCE-REPORTER                                   00030220
026090         MOVE TDA-SUBCODE        TO  M99-SUBCODE                  00030230
026100         IF TDA-VALID-SUBCODE                                     00030240
026110             SET M99-VALID-SUBCODE TO TRUE                        00030250
026120         ELSE                                                     00030260
026130             SET M99-SUBCODE-ERROR TO TRUE                        00030270
026140         END-IF                                                   00030280
026150         MOVE TDA-STATUS                    TO  M99-STATUS        00030290
026180         MOVE TDA-SPECIAL-COMMENT           TO  M99-SP-COM        00030320
026160         MOVE TDA-STATUS-FLAG               TO  M99-STATUS-FLAG   00030300
026260         MOVE TDA-SPECIAL-COMMENT-FLAG      TO  M99-SP-COM-FLAG   00030400
016510         MOVE TDA-ACCOUNT-TYPE-FLAG         TO  M99-ACCT-TYPE-FLAG00030460
016510         MOVE TDA-CONSUMER-INFO-IND-FLAG    TO  M99-CII-FLAG      00030460
016500         MOVE TDA-PROCESSING-IND-FLAG       TO  M99-PI-FLAG       00030450
026280     ELSE                                                         00030480
026290         MOVE LDA-COURT-CODE       TO  M99-SUBCODE                00030490
026300         IF LDA-VALID-COURT-CODE                                  00030500
026310             SET M99-VALID-SUBCODE TO TRUE                        00030510
026320         ELSE                                                     00030520
026330             SET M99-SUBCODE-ERROR TO TRUE                        00030530
026340         END-IF                                                   00030540
026360         MOVE LDA-SPECIAL-COMMENT  TO  M99-SP-COM                 00030550
026370         MOVE LDA-SPECIAL-COMMENT-FLAG                            00030560
026380                                   TO  M99-SP-COM-FLAG            00030570
026390         IF LDA-VALID-PR-STATUS                                   00030590
026390            MOVE LDA-CCSS-PR-STATUS      TO  M99-STATUS           00030610
026410            MOVE LDA-CCSS-PR-STATUS-FLAG TO  M99-STATUS-FLAG      00030620
026320         ELSE                                                     00030630
026390            MOVE LDA-LEGAL-STATUS        TO  M99-STATUS           00030640
026410            MOVE LDA-LEGAL-STATUS-FLAG   TO  M99-STATUS-FLAG.     00030650
026420 EJECT                                                            00030670
026430******************************************************************00030680
026440 4S1200-SEARCH-UNEQ-TYPE.                                         00030690
026450******************************************************************00030700
026460                                                                  00030710
026470     SET RTA-IF            TO  1.                                 00030720
026480                                                                  00030730
026490     SEARCH RTA-UNEQ-TYPE-ENTRIES                                 00030740
026500         AT END                                                   00030750
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00030760
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00030770
026910                            TO CCF-USER-ABEND-CODE                00030780
026920             MOVE C02-SUBROUTINE-NAME                             00030790
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00030800
026940             MOVE C02-PARAGRAPH-4S1200                            00030810
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00030820
026960             DISPLAY 'RTA UNEQ TYPE TABLE CAPACITY EXCEEDED'      00030830
026970             DISPLAY 'CRF-ACCOUNT-TYPE = '                        00030840
026980                      CRF-ACCOUNT-TYPE                            00030850
026520         WHEN (CRF-ACCOUNT-TYPE = RTA-UNEQ-TYPE (RTA-IF)) AND     00030860
026530              (RTA-IF <= RTA-UNEQ-TYPE-TBL-ENTRY-COUNT)           00030870
026540              CONTINUE                                            00030880
026550         WHEN (RTA-IF >  RTA-UNEQ-TYPE-TBL-ENTRY-COUNT) AND       00030890
026560              (RTA-IF <= TLC-MAX-RTAF)                            00030900
026570              MOVE CRF-ACCOUNT-TYPE TO  RTA-UNEQ-TYPE (RTA-IF)    00030910
026580              SET RTA-UNEQ-TYPE-TBL-ENTRY-COUNT TO RTA-IF         00030920
026590     END-SEARCH.                                                  00030930
026600                                                                  00030940
026610 EJECT                                                            00030950
026620******************************************************************00030960
026630 4S1225-SEARCH-UNEQ-ECOA.                                         00030970
026640******************************************************************00030980
026650                                                                  00030990
026660     SET RTA-IB           TO  1.                                  00031000
026670                                                                  00031010
026680     SEARCH RTA-UNEQ-ECOA-ENTRIES                                 00031020
026690         AT END                                                   00031030
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00031040
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00031050
026910                            TO CCF-USER-ABEND-CODE                00031060
026920             MOVE C02-SUBROUTINE-NAME                             00031070
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00031080
026940             MOVE C02-PARAGRAPH-4S1225                            00031090
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00031100
026960             DISPLAY 'RTA UNEQ ECOA TABLE CAPACITY EXCEEDED'      00031110
026970             DISPLAY 'CDA-ECOA-CODE = '  CDA-ECOA-CODE            00031120
026710         WHEN (CDA-ECOA-CODE  =  RTA-UNEQ-ECOA (RTA-IB)) AND      00031130
026720              (RTA-IB <= RTA-UNEQ-ECOA-TBL-ENTRY-COUNT)           00031140
026730              CONTINUE                                            00031150
026740         WHEN (RTA-IB > RTA-UNEQ-ECOA-TBL-ENTRY-COUNT) AND        00031160
026750              (RTA-IB <= TLC-MAX-RTAB)                            00031170
026760              MOVE CDA-ECOA-CODE TO  RTA-UNEQ-ECOA (RTA-IB)       00031180
026770              SET RTA-UNEQ-ECOA-TBL-ENTRY-COUNT TO RTA-IB         00031190
026780     END-SEARCH.                                                  00031200
026790                                                                  00031210
026800 EJECT                                                            00031220
027280******************************************************************00031790
027290 4S1300-SEARCH-STATUS.                                            00031800
027300******************************************************************00031810
027310                                                                  00031820
027320     SET RTA-I5               TO  1.                              00031830
027330                                                                  00031840
027340     SEARCH RTA-STATUS-ENTRIES                                    00031850
027350         AT END                                                   00031860
027360             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00031870
027370             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00031880
027380                            TO CCF-USER-ABEND-CODE                00031890
027390             MOVE C02-SUBROUTINE-NAME                             00031900
027400                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00031910
027410             MOVE C02-PARAGRAPH-4S1300                            00031920
027420                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00031930
027430             DISPLAY 'RTA STATUS TABLE CAPACITY EXCEEDED'         00031940
027440             DISPLAY 'M99-STATUS = ' M99-STATUS                   00031950
027450         WHEN (M99-STATUS   =  RTA-STATUS (RTA-I5)) AND           00031960
027460              (RTA-I5 <= RTA-STATUS-TBL-ENTRY-COUNT)              00031970
027470              CONTINUE                                            00031980
027480         WHEN (RTA-I5 > RTA-STATUS-TBL-ENTRY-COUNT) AND           00031990
027490              (RTA-I5 <= TLC-MAX-RTA5)                            00032000
027500              MOVE M99-STATUS     TO RTA-STATUS (RTA-I5)          00032010
027510              SET RTA-STATUS-TBL-ENTRY-COUNT TO RTA-I5            00032020
027520     END-SEARCH.                                                  00032030
027530                                                                  00032040
027540 EJECT                                                            00032050
027550******************************************************************00032060
027560 4S1325-SEARCH-UNEQ-STATUS.                                       00032070
027570******************************************************************00032080
027580                                                                  00032090
027590     SET RTA-ID          TO  1.                                   00032100
027600                                                                  00032110
027610     SEARCH RTA-UNEQ-STATUS-ENTRIES                               00032120
027620         AT END                                                   00032130
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032140
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00032150
026910                            TO CCF-USER-ABEND-CODE                00032160
026920             MOVE C02-SUBROUTINE-NAME                             00032170
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032180
026940             MOVE C02-PARAGRAPH-4S1325                            00032190
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00032200
026960             DISPLAY 'RTA UNEQ STATUS TABLE CAPACITY EXCEEDED'    00032210
027440             DISPLAY 'M99-STATUS = ' M99-STATUS                   00032220
027640         WHEN (M99-STATUS  =  RTA-UNEQ-STATUS (RTA-ID)) AND       00032230
027650              (RTA-ID <= RTA-UNEQ-STAT-TBL-ENTRY-COUNT)           00032240
027660              CONTINUE                                            00032250
027670         WHEN (RTA-ID > RTA-UNEQ-STAT-TBL-ENTRY-COUNT) AND        00032260
027680              (RTA-ID <= TLC-MAX-RTAD)                            00032270
027690              MOVE M99-STATUS TO RTA-UNEQ-STATUS (RTA-ID)         00032280
027700              SET RTA-UNEQ-STAT-TBL-ENTRY-COUNT TO RTA-ID         00032290
027710     END-SEARCH.                                                  00032300
027720                                                                  00032310
027730 EJECT                                                            00032320
027740******************************************************************00032330
027750 4S1350-SEARCH-UNEQ-SP-COM.                                       00032340
027760******************************************************************00032350
027770                                                                  00032360
027780     SET RTA-IE          TO  1.                                   00032370
027790                                                                  00032380
027800     SEARCH RTA-UNEQ-SP-COM-ENTRIES                               00032390
027810         AT END                                                   00032400
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032410
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00032420
026910                            TO CCF-USER-ABEND-CODE                00032430
026920             MOVE C02-SUBROUTINE-NAME                             00032440
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032450
026940             MOVE C02-PARAGRAPH-4S1350                            00032460
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00032470
026960             DISPLAY 'RTA UNEQ SP COM TABLE CAPACITY EXCEEDED'    00032480
027440             DISPLAY 'M99-SP-COM = ' M99-SP-COM                   00032490
027830         WHEN (M99-SP-COM  =  RTA-UNEQ-SP-COM (RTA-IE)) AND       00032500
027840              (RTA-IE <= RTA-UNEQ-SPCOM-TBL-ENTRY-COUNT)          00032510
027850              CONTINUE                                            00032520
027860         WHEN (RTA-IE > RTA-UNEQ-SPCOM-TBL-ENTRY-COUNT) AND       00032530
027870              (RTA-IE <= TLC-MAX-RTAE)                            00032540
027880              MOVE M99-SP-COM TO RTA-UNEQ-SP-COM (RTA-IE)         00032550
027890              SET RTA-UNEQ-SPCOM-TBL-ENTRY-COUNT TO RTA-IE        00032560
027900     END-SEARCH.                                                  00032570
027910                                                                  00032580
027920 EJECT                                                            00032590
027930******************************************************************00032600
027940 4S1375-SEARCH-UNEQ-CYCLE.                                        00032610
027950******************************************************************00032620
027960                                                                  00032630
027970     SET RTA-IA           TO  1.                                  00032640
027980                                                                  00032650
027990     SEARCH RTA-UNEQ-CYCLE-ENTRIES                                00032660
028000         AT END                                                   00032670
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032680
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00032690
026910                            TO CCF-USER-ABEND-CODE                00032700
026920             MOVE C02-SUBROUTINE-NAME                             00032710
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032720
026940             MOVE C02-PARAGRAPH-4S1375                            00032730
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00032740
026960             DISPLAY 'RTA UNEQ CYCLE TABLE CAPACITY EXCEEDED'     00032750
027440             DISPLAY 'TDA-CYCLE-IDENTIFIER = '                    00032760
027440             DISPLAY TDA-CYCLE-IDENTIFIER                         00032770
028020         WHEN (TDA-CYCLE-IDENTIFIER  = RTA-UNEQ-CYCLE (RTA-IA))   00032780
028030          AND (RTA-IA <= RTA-UNEQ-CYCLE-TBL-ENTRY-COUNT)          00032790
028040              CONTINUE                                            00032800
028050         WHEN (RTA-IA > RTA-UNEQ-CYCLE-TBL-ENTRY-COUNT) AND       00032810
028060              (RTA-IA <= TLC-MAX-RTAA)                            00032820
028070              MOVE TDA-CYCLE-IDENTIFIER                           00032830
028080                          TO  RTA-UNEQ-CYCLE (RTA-IA)             00032840
028090              SET RTA-UNEQ-CYCLE-TBL-ENTRY-COUNT TO RTA-IA        00032850
028100     END-SEARCH.                                                  00032860
028110                                                                  00032870
028120 EJECT                                                            00032880
027930******************************************************************00032600
027940 4S1400-SEARCH-UNEQ-CII.                                          00032610
027950******************************************************************00032620
027960                                                                  00032630
027970     SET RTA-IG           TO  1.                                  00032640
027980                                                                  00032650
027990     SEARCH RTA-UNEQ-CII-ENTRIES                                  00032660
028000         AT END                                                   00032670
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032680
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00032690
026910                            TO CCF-USER-ABEND-CODE                00032700
026920             MOVE C02-SUBROUTINE-NAME                             00032710
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032720
026940             MOVE C02-PARAGRAPH-4S1400                            00032730
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00032740
026960             DISPLAY 'RTA UNEQ CII TABLE CAPACITY EXCEEDED'       00032750
027440             DISPLAY 'CRF-CONSUMER INFO IND = '                   00032760
027440             DISPLAY TDA-CONSUMER-INFO-IND                        00032770
028020         WHEN (CRF-HOLD-CII = RTA-UNEQ-CII (RTA-IG))              00032780
028030          AND (RTA-IG <= RTA-UNEQ-CII-TBL-ENTRY-COUNT)            00032790
028040              CONTINUE                                            00032800
028050         WHEN (RTA-IG > RTA-UNEQ-CII-TBL-ENTRY-COUNT) AND         00032810
028060              (RTA-IG <= TLC-MAX-RTAG)                            00032820
028070              MOVE CRF-HOLD-CII                                   00032830
028080                          TO  RTA-UNEQ-CII (RTA-IG)               00032840
028090              SET RTA-UNEQ-CII-TBL-ENTRY-COUNT TO RTA-IG          00032850
028100     END-SEARCH.                                                  00032860
028110                                                                  00032870
028120 EJECT                                                            00032880
027930******************************************************************00032600
027940 4S1425-SEARCH-UNEQ-PI.                                           00032610
027950******************************************************************00032620
027960                                                                  00032630
027970     SET RTA-IH           TO  1.                                  00032640
027980                                                                  00032650
027990     SEARCH RTA-UNEQ-PI-ENTRIES                                   00032660
028000         AT END                                                   00032670
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032680
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00032690
026910                            TO CCF-USER-ABEND-CODE                00032700
026920             MOVE C02-SUBROUTINE-NAME                             00032710
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032720
026940             MOVE C02-PARAGRAPH-4S1425                            00032730
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00032740
026960             DISPLAY 'RTA UNEQ PI TABLE CAPACITY EXCEEDED'        00032750
027440             DISPLAY 'CRF-PROCESSING INDICATOR = '                00032760
027440             DISPLAY CRF-PROCESSING-INDICATOR                     00032770
028020         WHEN (CRF-PROCESSING-INDICATOR  = RTA-UNEQ-PI (RTA-IH))  00032780
028030          AND (RTA-IH <= RTA-UNEQ-PI-TBL-ENTRY-COUNT)             00032790
028040              CONTINUE                                            00032800
028050         WHEN (RTA-IH > RTA-UNEQ-PI-TBL-ENTRY-COUNT) AND          00032810
028060              (RTA-IH <= TLC-MAX-RTAH)                            00032820
028070              MOVE CRF-PROCESSING-INDICATOR                       00032830
028080                          TO  RTA-UNEQ-PI (RTA-IH)                00032840
028090              SET RTA-UNEQ-PI-TBL-ENTRY-COUNT TO RTA-IH           00032850
028100     END-SEARCH.                                                  00032860
028110                                                                  00032870
028120 EJECT                                                            00032880
027930******************************************************************00032600
027940 4S1450-SEARCH-UNEQ-L1SIN.                                        00032610
027950******************************************************************00032620
027960                                                                  00032630
027970     SET RTA-II           TO  1.                                  00032640
027980                                                                  00032650
027990     SEARCH RTA-UNEQ-L1SIN-ENTRIES                                00032660
028000         AT END                                                   00032670
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032680
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00032690
026910                            TO CCF-USER-ABEND-CODE                00032700
026920             MOVE C02-SUBROUTINE-NAME                             00032710
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032720
026940             MOVE C02-PARAGRAPH-4S1450                            00032730
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00032740
026960             DISPLAY 'RTA UNEQ L1 SUBCODE TABLE CAPACITY EXCEEDED'00032750
027440             DISPLAY 'CRF-L1-NEW-SUBCODE = '                      00032760
027440             DISPLAY CRF-L1-NEW-SUBCODE                           00032770
028020         WHEN (CRF-L1-NEW-SUBCODE  = RTA-UNEQ-L1SIN (RTA-II))     00032780
028030          AND (RTA-II <= RTA-UNEQ-L1SIN-TBL-ENTRY-COUNT)          00032790
028040              CONTINUE                                            00032800
028050         WHEN (RTA-II > RTA-UNEQ-L1SIN-TBL-ENTRY-COUNT) AND       00032810
028060              (RTA-II <= TLC-MAX-RTAI)                            00032820
028080              MOVE CRF-L1-NEW-SUBCODE TO  RTA-UNEQ-L1SIN (RTA-II) 00032840
028090              SET RTA-UNEQ-L1SIN-TBL-ENTRY-COUNT TO RTA-II        00032850
028100     END-SEARCH.                                                  00032860
028110                                                                  00032870
028120 EJECT                                                            00032880
027930******************************************************************00032600
027940 4S1475-CROSSFIELD-COUNTS.                                        00032610
027950******************************************************************00032620
027960                                                                  00032630
027980     IF  TDA-SCC-STAT-AX-C-XERR-Y                                 00032650
027990     OR  TDA-SCC-STAT-BA-XERR-Y                                   00032660
028000     OR  TDA-SCC-STAT-BP-XERR-Y                                   00032670
               MOVE SPACES                TO M01-XFIELD-DATA
               SET M01-XFIELD-TYPE-M TO TRUE
               STRING TDA-SPECIAL-COMMENT DELIMITED BY SPACE
                      '/'                 DELIMITED BY SIZE
                      TDA-STATUS          DELIMITED BY SIZE
               INTO                M01-XFIELD-VALUE
               PERFORM 4S1475-SEARCH-CROSSFIELD
           END-IF.

           IF  TDA-ST91-ACCTYPE-XERR-Y                                  00032640
               MOVE SPACES                TO M01-XFIELD-DATA
               SET M01-XFIELD-TYPE-N TO TRUE
               STRING TDA-STATUS          DELIMITED BY SPACE
                      '/'                 DELIMITED BY SIZE
                      TDA-ACCOUNT-TYPE    DELIMITED BY SIZE
               INTO                M01-XFIELD-VALUE
               PERFORM 4S1475-SEARCH-CROSSFIELD
           END-IF.

026890     IF  TDA-SPECIAL-COMMENT-H-XERR                               00032680
               MOVE SPACES                TO M01-XFIELD-DATA
               SET M01-XFIELD-TYPE-O TO TRUE
               STRING TDA-SPECIAL-COMMENT DELIMITED BY SPACE
                      '/'                 DELIMITED BY SIZE
                      CDA-ECOA-CODE       DELIMITED BY SIZE
               INTO                M01-XFIELD-VALUE
               PERFORM 4S1475-SEARCH-CROSSFIELD
           END-IF.

           IF  TDA-SPECIAL-COMMENT-ATY-XERR
               MOVE SPACES                TO M01-XFIELD-DATA
               SET M01-XFIELD-TYPE-R TO TRUE
               STRING TDA-SPECIAL-COMMENT DELIMITED BY SPACE
                      '/'                 DELIMITED BY SIZE
                      TDA-ACCOUNT-TYPE    DELIMITED BY SIZE
               INTO                M01-XFIELD-VALUE
               PERFORM 4S1475-SEARCH-CROSSFIELD
           END-IF.

028110                                                                  00032870
028120 EJECT                                                            00032880
027930******************************************************************00032600
027940 4S1475-SEARCH-CROSSFIELD.                                        00032610
027950******************************************************************00032620
027960                                                                  00032630
027970     SET RTA-IM           TO  1.                                  00032640
027980                                                                  00032650
027990     SEARCH RTA-XFIELD-RECY-ENTRIES                               00032660
028000         AT END                                                   00032670
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032680
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00032690
026910                            TO CCF-USER-ABEND-CODE                00032700
026920             MOVE C02-SUBROUTINE-NAME                             00032710
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032720
026940             MOVE C02-PARAGRAPH-4S1475                            00032730
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00032740
026960             DISPLAY 'RTA XFIELD RECY TABLE CAPACITY EXCEEDED'    00032750
027440             DISPLAY 'XFIELD TYPE = ' M01-XFIELD-TYPE             00032760
027440             DISPLAY 'XFIELD VALUE = ' M01-XFIELD-VALUE           00032770
028020         WHEN (M01-XFIELD-TYPE  = RTA-XFIELD-TYPE (RTA-IM))       00032780
028030          AND (M01-XFIELD-VALUE = RTA-XFIELD-VALUE (RTA-IM))      00032790
028030          AND (RTA-IM <= RTA-XFIELD-RECY-ENTRY-COUNT)             00032790
028040              ADD +1          TO  RTA-XFIELD-RECY-COUNT (RTA-IM)  00032800
028050         WHEN (RTA-IM > RTA-XFIELD-RECY-ENTRY-COUNT) AND          00032810
028060              (RTA-IM <= TLC-MAX-RTAM)                            00032820
028080              MOVE M01-XFIELD-TYPE TO  RTA-XFIELD-TYPE (RTA-IM)   00032840
028080              MOVE M01-XFIELD-VALUE TO  RTA-XFIELD-VALUE (RTA-IM) 00032840
028040              MOVE +1         TO  RTA-XFIELD-RECY-COUNT (RTA-IM)  00032800
028090              SET RTA-XFIELD-RECY-ENTRY-COUNT TO RTA-IM           00032850
028100     END-SEARCH.                                                  00032860
028110                                                                  00032870
028120 EJECT                                                            00032880
028130******************************************************************00032890
028140 4S1500-SEARCH-FROM-TO-SP-COM.                                    00032900
028150******************************************************************00032910
028160                                                                  00032920
028170     SET RTA-I6             TO  1.                                00032930
028180                                                                  00032940
028190     SEARCH RTA-SP-COM-ENTRIES                                    00032950
028200         AT END                                                   00032960
028210             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032970
028220             MOVE ERC-ABEND-CONTROL-SET-ERROR                     00032980
028230                            TO CCF-USER-ABEND-CODE                00032990
028240             MOVE C02-SUBROUTINE-NAME                             00033000
028250                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00033010
028260             MOVE C02-PARAGRAPH-4S1500                            00033020
028270                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00033030
028280             DISPLAY 'FROM/TO SPECIAL COMMENT NOT IN CONTROL DECK'00033040
028290             DISPLAY 'CRF-HOLD-SPECIAL-COMMENT = '                00033050
028290                      CRF-HOLD-SPECIAL-COMMENT                    00033060
028300         WHEN (CRF-HOLD-SPECIAL-COMMENT                           00033070
028300                                   = RTA-FROM-SP-COM (RTA-I6))    00033080
028310          AND (RTA-I6 <= RTA-SP-COM-TBL-ENTRY-COUNT)              00033090
028320              CONTINUE                                            00033100
028330     END-SEARCH.                                                  00033110
028340                                                                  00033120
028350 EJECT                                                            00033130
028360******************************************************************00033140
028370 4S1525-SEARCH-FROM-TO-ECOA.                                      00033150
028380******************************************************************00033160
028390                                                                  00033170
028400     SET RTA-I3          TO  1.                                   00033180
028410                                                                  00033190
028420     SEARCH RTA-ECOA-ENTRIES                                      00033200
028430         AT END                                                   00033210
028440             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00033220
028450             MOVE ERC-ABEND-CONTROL-SET-ERROR                     00033230
028460                            TO CCF-USER-ABEND-CODE                00033240
028470             MOVE C02-SUBROUTINE-NAME                             00033250
028480                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00033260
028490             MOVE C02-PARAGRAPH-4S1525                            00033270
028500                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00033280
028510             DISPLAY 'FROM/TO ECOA CODE NOT IN CONTROL DECK'      00033290
028520             DISPLAY 'CRF-HOLD-ECOA-CODE = '                      00033300
028520                      CRF-HOLD-ECOA-CODE                          00033310
028530         WHEN (CRF-HOLD-ECOA-CODE                                 00033320
028530                              =  RTA-FROM-ECOA (RTA-I3)) AND      00033330
028540              (RTA-I3 <= RTA-ECOA-TBL-ENTRY-COUNT)                00033340
028550             CONTINUE                                             00033350
028560     END-SEARCH.                                                  00033360
028570 EJECT                                                            00033370
028580******************************************************************00033380
028590 4S1550-SEARCH-FROM-TO-TYPE.                                      00033390
028600******************************************************************00033400
028610                                                                  00033410
028620     SET RTA-I2          TO  1.                                   00033420
028630                                                                  00033430
028640     SEARCH RTA-TYPE-ENTRIES                                      00033440
028650         AT END                                                   00033450
028870             MOVE ERC-YES    TO  CCF-ABEND-FLAG                   00033680
028880             MOVE ERC-ABEND-CONTROL-SET-ERROR                     00033690
028890                             TO CCF-USER-ABEND-CODE               00033700
028900             MOVE C02-SUBROUTINE-NAME                             00033710
028910                             TO CCF-SUBROUTINE-WHICH-SET-ABEND    00033720
028920             MOVE C02-PARAGRAPH-4S1550                            00033730
028930                             TO CCF-PARAGRAPH-WHICH-SET-ABEND     00033740
028950             DISPLAY 'FROM/TO ACCOUNT TYPE NOT IN CONTROL DECK'   00033760
028960             DISPLAY 'CRF-ACCOUNT-TYPE = ' CRF-ACCOUNT-TYPE       00033770
028670         WHEN (CRF-ACCOUNT-TYPE                                   00033470
028670                                = RTA-FROM-TYPE (RTA-I2)) AND     00033480
028680              (RTA-I2 <= RTA-TYPE-TBL-ENTRY-COUNT)                00033490
028690              CONTINUE                                            00033500
028700     END-SEARCH.                                                  00033510
028710 EJECT                                                            00033520
028130******************************************************************00032890
028140 4S1575-SEARCH-FROM-TO-CII.                                       00032900
028150******************************************************************00032910
028160                                                                  00032920
           IF OPS-03-NEW-METRO
028170        SET RTA-I7             TO  1                              00032930
028190        SEARCH RTA-CII-ENTRIES                                    00032950
028200          AT END                                                  00032960
028210              MOVE ERC-YES   TO  CCF-ABEND-FLAG                   00032970
028220              MOVE ERC-ABEND-CONTROL-SET-ERROR                    00032980
028230                             TO CCF-USER-ABEND-CODE               00032990
028240              MOVE C02-SUBROUTINE-NAME                            00033000
028250                             TO CCF-SUBROUTINE-WHICH-SET-ABEND    00033010
028260              MOVE C02-PARAGRAPH-4S1575                           00033020
028270                             TO CCF-PARAGRAPH-WHICH-SET-ABEND     00033030
028280              DISPLAY 'FROM/TO CONSUMER INFO NOT IN CONTROL DECK' 00033040
028290              DISPLAY 'CRF-HOLD-CII = ' CRF-HOLD-CII              00033050
028300          WHEN (CRF-HOLD-CII  = RTA-FROM-CII (RTA-I7))            00033080
028310           AND (RTA-I7 <= RTA-CII-TBL-ENTRY-COUNT)                00033090
028320               CONTINUE                                           00033100
028330       END-SEARCH                                                 00033110
028340     ELSE                                                         00033120
027970       SET RTA-I7           TO  1                                 00032640
027990       SEARCH RTA-CII-ENTRIES                                     00032660
028000           AT END                                                 00032670
026890               MOVE ERC-YES   TO  CCF-ABEND-FLAG                  00032680
026900               MOVE ERC-ABEND-RTA-TBL-OVERFLOW                    00032690
026910                              TO CCF-USER-ABEND-CODE              00032700
026920               MOVE C02-SUBROUTINE-NAME                           00032710
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032720
026940               MOVE C02-PARAGRAPH-4S1575                          00032730
026950                              TO CCF-PARAGRAPH-WHICH-SET-ABEND    00032740
026960               DISPLAY 'RTA FROM/TO CII TABLE CAPACITY EXCEEDED'  00032750
027440               DISPLAY 'M99-CII = ' M99-CII                       00032760
028020           WHEN (M99-CII  = RTA-FROM-CII (RTA-I7))                00032780
028030            AND (RTA-I7 <= RTA-CII-TBL-ENTRY-COUNT)               00032790
028040                CONTINUE                                          00032800
028050           WHEN (RTA-I7 > RTA-CII-TBL-ENTRY-COUNT) AND            00032810
028060                (RTA-I7 <= TLC-MAX-RTA7)                          00032820
028070                MOVE M99-CII                                      00032830
028080                                     TO  RTA-FROM-CII (RTA-I7)    00032840
028080                                         RTA-TO-CII (RTA-I7)      00032840
028090                SET RTA-CII-TBL-ENTRY-COUNT TO RTA-I7             00032850
028100        END-SEARCH                                                00032860
            END-IF.
028110                                                                  00032870
028350 EJECT                                                            00033130
028130******************************************************************00032890
028140 4S1600-SEARCH-FROM-TO-PI.                                        00032900
028150******************************************************************00032910
028160                                                                  00032920
           IF OPS-03-NEW-METRO
028170        SET RTA-I8             TO  1                              00032930
028190        SEARCH RTA-PI-ENTRIES                                     00032950
028200          AT END                                                  00032960
028210             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032970
028220             MOVE ERC-ABEND-CONTROL-SET-ERROR                     00032980
028230                            TO CCF-USER-ABEND-CODE                00032990
028240             MOVE C02-SUBROUTINE-NAME                             00033000
028250                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00033010
028260             MOVE C02-PARAGRAPH-4S1600                            00033020
028270                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00033030
028280             DISPLAY 'FROM/TO PROCESSING IND NOT IN CONTROL DECK' 00033040
028290             DISPLAY 'CRF-PROCESSING INDICATOR = '                00033050
028290                      CRF-PROCESSING-INDICATOR                    00033060
028300           WHEN (CRF-PROCESSING-INDICATOR  = RTA-FROM-PI (RTA-I8))00033080
028310            AND (RTA-I8 <= RTA-PI-TBL-ENTRY-COUNT)                00033090
028320                CONTINUE                                          00033100
028330        END-SEARCH                                                00033110
028340     ELSE                                                         00033120
027970        SET RTA-I8           TO  1                                00032640
027990        SEARCH RTA-PI-ENTRIES                                     00032660
028000           AT END                                                 00032670
026890             MOVE ERC-YES   TO  CCF-ABEND-FLAG                    00032680
026900             MOVE ERC-ABEND-RTA-TBL-OVERFLOW                      00032690
026910                            TO CCF-USER-ABEND-CODE                00032700
026920             MOVE C02-SUBROUTINE-NAME                             00032710
026930                            TO CCF-SUBROUTINE-WHICH-SET-ABEND     00032720
026940             MOVE C02-PARAGRAPH-4S1600                            00032730
026950                            TO CCF-PARAGRAPH-WHICH-SET-ABEND      00032740
026960             DISPLAY 'RTA FROM/TO PI TABLE CAPACITY EXCEEDED'     00032750
027440             DISPLAY 'TDA-PROCESSING INDICATOR = '                00032760
027440             DISPLAY TDA-PROCESSING-INDICATOR                     00032770
028020           WHEN (TDA-PROCESSING-INDICATOR  = RTA-FROM-PI (RTA-I8))00032780
028030            AND (RTA-I8 <= RTA-PI-TBL-ENTRY-COUNT)                00032790
028040                 CONTINUE                                         00032800
028050           WHEN (RTA-I8 > RTA-PI-TBL-ENTRY-COUNT) AND             00032810
028060                (RTA-I8 <= TLC-MAX-RTA8)                          00032820
028070                 MOVE TDA-PROCESSING-INDICATOR                    00032830
028080                                 TO  RTA-FROM-PI (RTA-I8)         00032840
028080                                     RTA-TO-PI (RTA-I8)           00032840
028090                 SET RTA-PI-TBL-ENTRY-COUNT TO RTA-I8             00032850
028100        END-SEARCH                                                00032860
            END-IF.
028110                                                                  00032870
028350 EJECT                                                            00033130
028130******************************************************************00032890
028140 4S1625-SEARCH-CCC.                                               00032900
028150******************************************************************00032910
028160                                                                  00032920
027970       SET RTA-I9           TO  1.                                00032640
027990       SEARCH RTA-CCC-ENTRIES                                     00032660
028000          AT END                                                  00032670
026890            MOVE ERC-YES   TO  CCF-ABEND-FLAG                     00032680
026900            MOVE ERC-ABEND-RTA-TBL-OVERFLOW                       00032690
026910                           TO CCF-USER-ABEND-CODE                 00032700
026920            MOVE C02-SUBROUTINE-NAME                              00032710
026930                           TO CCF-SUBROUTINE-WHICH-SET-ABEND      00032720
026940            MOVE C02-PARAGRAPH-4S1625                             00032730
026950                           TO CCF-PARAGRAPH-WHICH-SET-ABEND       00032740
026960            DISPLAY 'RTA CCC TABLE CAPACITY EXCEEDED'             00032750
027440            DISPLAY 'TDA-COMPLIANCE-COND-CODE = '                 00032760
027440            DISPLAY TDA-COMPLIANCE-COND-CODE                      00032770
028020          WHEN (TDA-COMPLIANCE-COND-CODE  = RTA-CCC (RTA-I9))     00032780
028030            AND (RTA-I9 <= RTA-CCC-TBL-ENTRY-COUNT)               00032790
028040                 CONTINUE                                         00032800
028050          WHEN (RTA-I9 > RTA-CCC-TBL-ENTRY-COUNT) AND             00032810
028060               (RTA-I9 <= TLC-MAX-RTA9)                           00032820
028070                MOVE TDA-COMPLIANCE-COND-CODE                     00032830
028080                                TO  RTA-CCC (RTA-I9)              00032840
028090                SET RTA-CCC-TBL-ENTRY-COUNT TO RTA-I9             00032850
028100       END-SEARCH.                                                00032860
028350 EJECT                                                            00033130
028130******************************************************************00032890
028140 4S1650-SEARCH-CREDITOR-CLASS.                                    00032900
028150******************************************************************00032910
028160                                                                  00032920
027970       SET RTA-IJ           TO  1.                                00032640
027990       SEARCH RTA-CRCL-ENTRIES                                    00032660
028000          AT END                                                  00032670
026890            MOVE ERC-YES   TO  CCF-ABEND-FLAG                     00032680
026900            MOVE ERC-ABEND-RTA-TBL-OVERFLOW                       00032690
026910                           TO CCF-USER-ABEND-CODE                 00032700
026920            MOVE C02-SUBROUTINE-NAME                              00032710
026930                           TO CCF-SUBROUTINE-WHICH-SET-ABEND      00032720
026940            MOVE C02-PARAGRAPH-4S1650                             00032730
026950                           TO CCF-PARAGRAPH-WHICH-SET-ABEND       00032740
026960            DISPLAY 'RTA CREDITOR CLASS TABLE CAPACITY EXCEEDED'  00032750
027440            DISPLAY 'TDA-CREDITOR-CLASS = '                       00032760
027440            DISPLAY TDA-CREDITOR-CLASS                            00032770
028020          WHEN (TDA-CREDITOR-CLASS  = RTA-CRCL (RTA-IJ))          00032780
028030            AND (RTA-IJ <= RTA-CRCL-TBL-ENTRY-COUNT)              00032790
028040                 CONTINUE                                         00032800
028050          WHEN (RTA-IJ > RTA-CRCL-TBL-ENTRY-COUNT) AND            00032810
028060               (RTA-IJ <= TLC-MAX-RTAJ)                           00032820
028070                MOVE TDA-CREDITOR-CLASS                           00032830
028080                                TO  RTA-CRCL (RTA-IJ)             00032840
028090                SET RTA-CRCL-TBL-ENTRY-COUNT TO RTA-IJ            00032850
028100       END-SEARCH.                                                00032860
028350 EJECT                                                            00033130
028130******************************************************************00032890
028140 4S1675-SEARCH-LEGAL-STATUS.                                      00032900
028150******************************************************************00032910
028160                                                                  00032920
027970       SET RTA-IK           TO  1.                                00032640
027990       SEARCH RTA-COURT-CODE-STATUS-ENTRIES                       00032660
028000          AT END                                                  00032670
026890            MOVE ERC-YES   TO  CCF-ABEND-FLAG                     00032680
026900            MOVE ERC-ABEND-RTA-TBL-OVERFLOW                       00032690
026910                           TO CCF-USER-ABEND-CODE                 00032700
026920            MOVE C02-SUBROUTINE-NAME                              00032710
026930                           TO CCF-SUBROUTINE-WHICH-SET-ABEND      00032720
026940            MOVE C02-PARAGRAPH-4S1675                             00032730
026950                           TO CCF-PARAGRAPH-WHICH-SET-ABEND       00032740
026960            DISPLAY                                               00032750
026960            'RTA COURT CODE STATUS TABLE CAPACITY EXCEEDED'       00032750
027440            DISPLAY 'LDA-COURT-CODE   = ' LDA-COURT-CODE          00032770
027440            DISPLAY 'LDA-LEGAL-STATUS = ' LDA-LEGAL-STATUS        00032760
028020          WHEN (LDA-LEGAL-STATUS  = RTA-LEGAL-STATUS(RTA-IK))     00032780
028030            AND (RTA-IK <= RTA-CCST-TBL-ENTRY-COUNT)              00032790
028040                 CONTINUE                                         00032800
028050          WHEN (RTA-IK > RTA-CCST-TBL-ENTRY-COUNT) AND            00032810
028060               (RTA-IK <= TLC-MAX-RTAK)                           00032820
028070                MOVE LDA-LEGAL-STATUS                             00032830
028080                                TO  RTA-LEGAL-STATUS(RTA-IK)      00032840
028090                SET RTA-CCST-TBL-ENTRY-COUNT TO RTA-IK            00032850
028100       END-SEARCH.                                                00032860
028130******************************************************************00032890
028140 4S1700-SEARCH-COLLECTOR-ID.                                      00032900
028150******************************************************************00032910
028160                                                                  00032920
027970       SET RTA-IL           TO  1.                                00032640
027990       SEARCH RTA-COURT-CODE-COLLID-ENTRIES                       00032660
028000          AT END                                                  00032670
026890            MOVE ERC-YES   TO  CCF-ABEND-FLAG                     00032680
026900            MOVE ERC-ABEND-RTA-TBL-OVERFLOW                       00032690
026910                           TO CCF-USER-ABEND-CODE                 00032700
026920            MOVE C02-SUBROUTINE-NAME                              00032710
026930                           TO CCF-SUBROUTINE-WHICH-SET-ABEND      00032720
026940            MOVE C02-PARAGRAPH-4S1700                             00032730
026950                           TO CCF-PARAGRAPH-WHICH-SET-ABEND       00032740
026960            DISPLAY                                               00032750
026960            'RTA COURT CODE COLLECTOR ID TABLE CAPACITY EXCEEDED' 00032750
027440            DISPLAY 'LDA-COURT-CODE   = ' LDA-COURT-CODE          00032770
027440            DISPLAY 'LDA-COLLECTOR-ID = ' LDA-COLLECTOR-ID        00032760
028020          WHEN (LDA-COLLECTOR-ID  = RTA-COLLECTOR-ID(RTA-IL))     00032780
028030            AND (RTA-IL <= RTA-CCCI-TBL-ENTRY-COUNT)              00032790
028040                 CONTINUE                                         00032800
028050          WHEN (RTA-IL > RTA-CCCI-TBL-ENTRY-COUNT) AND            00032810
028060               (RTA-IL <= TLC-MAX-RTAL)                           00032820
028070                MOVE LDA-COLLECTOR-ID                             00032830
028080                                TO  RTA-COLLECTOR-ID(RTA-IL)      00032840
028090                SET RTA-CCCI-TBL-ENTRY-COUNT TO RTA-IL            00032850
028100       END-SEARCH.                                                00032860
028350 EJECT                                                            00033130
028130******************************************************************00032890
028140 4S1725-SEARCH-KOB-ACCT-TYPE.                                     00032900
028150******************************************************************00032910
028160                                                                  00032920
027970       SET RTA-IN           TO  1.                                00032640
027990       SEARCH RTA-BASE-KOB-AT-ENTRIES                             00032660
028000          AT END                                                  00032670
026890            MOVE ERC-YES   TO  CCF-ABEND-FLAG                     00032680
026900            MOVE ERC-ABEND-RTA-TBL-OVERFLOW                       00032690
026910                           TO CCF-USER-ABEND-CODE                 00032700
026920            MOVE C02-SUBROUTINE-NAME                              00032710
026930                           TO CCF-SUBROUTINE-WHICH-SET-ABEND      00032720
026940            MOVE C02-PARAGRAPH-4S1725                             00032730
026950                           TO CCF-PARAGRAPH-WHICH-SET-ABEND       00032740
026960            DISPLAY                                               00032750
026960            'RTA BASE KOB/ACCOUNT TYPE TABLE CAPACITY EXCEEDED'   00032750
027440            DISPLAY 'SUBCODE  = ' TDA-SUBCODE                     00032770
027440            DISPLAY 'ACCOUNT TYPE = ' TDA-ACCOUNT-TYPE            00032760
028020          WHEN (TDA-ACCOUNT-TYPE  = RTA-BASE-KOB-AT(RTA-IN))      00032780
028030            AND (RTA-IN <= RTA-BASE-KOB-AT-ENTRY-COUNT)           00032790
028040                 CONTINUE                                         00032800
028050          WHEN (RTA-IN > RTA-BASE-KOB-AT-ENTRY-COUNT) AND         00032810
028060               (RTA-IN <= TLC-MAX-RTAN)                           00032820
028070                MOVE TDA-ACCOUNT-TYPE                             00032830
028080                                TO  RTA-BASE-KOB-AT(RTA-IN)       00032840
028090                SET RTA-BASE-KOB-AT-ENTRY-COUNT TO RTA-IN         00032850
028100       END-SEARCH.                                                00032860
028130******************************************************************00032890
028140 4S1750-SEARCH-L1-KOB-ACCT-TYPE.                                  00032900
028150******************************************************************00032910
027970       SET RTA-IO           TO  1.                                00032640
027990       SEARCH RTA-L1-KOB-AT-ENTRIES                               00032660
028000          AT END                                                  00032670
026890            MOVE ERC-YES   TO  CCF-ABEND-FLAG                     00032680
026900            MOVE ERC-ABEND-RTA-TBL-OVERFLOW                       00032690
026910                           TO CCF-USER-ABEND-CODE                 00032700
026920            MOVE C02-SUBROUTINE-NAME                              00032710
026930                           TO CCF-SUBROUTINE-WHICH-SET-ABEND      00032720
026940            MOVE C02-PARAGRAPH-4S1750                             00032730
026950                           TO CCF-PARAGRAPH-WHICH-SET-ABEND       00032740
026960            DISPLAY                                               00032750
026960            'RTA L1 KOB/ACCOUNT TYPE TABLE CAPACITY EXCEEDED'     00032750
027440            DISPLAY 'SUBCODE  = ' TDA-SUBCODE                     00032770
027440            DISPLAY 'L1 SUBCODE  = ' TDA-L1SIN                    00032770
027440            DISPLAY 'ACCOUNT TYPE = ' TDA-ACCOUNT-TYPE            00032760
                  DISPLAY 'L1 KOB CODE = ' TDA-L1-KOB-CODE
028020          WHEN (TDA-ACCOUNT-TYPE  = RTA-L1-KOB-AT(RTA-IO)         00032780
                  AND TDA-L1SIN =  RTA-L1-KOB-SIN (RTA-IO)
                  AND TDA-L1-KOB-CODE =  RTA-L1-KOB-CODE (RTA-IO)
028030            AND (RTA-IO <= RTA-L1-KOB-AT-ENTRY-COUNT))            00032790
028040                 CONTINUE                                         00032800
028050          WHEN (RTA-IO > RTA-L1-KOB-AT-ENTRY-COUNT) AND           00032810
028060               (RTA-IO <= TLC-MAX-RTAO)                           00032820
028070                MOVE TDA-L1SIN        TO  RTA-L1-KOB-SIN (RTA-IO) 00032830
028070                MOVE TDA-ACCOUNT-TYPE TO  RTA-L1-KOB-AT (RTA-IO)  00032830
028070                MOVE TDA-L1-KOB-CODE  TO  RTA-L1-KOB-CODE (RTA-IO)00032830
028090                SET RTA-L1-KOB-AT-ENTRY-COUNT TO RTA-IO           00032850
028100       END-SEARCH.                                                00032860
028350 EJECT                                                            00033130
028130******************************************************************00032890
028140 4S1775-SEARCH-PT.                                                00032900
028150******************************************************************00032910
028160                                                                  00032920
027970       SET RTA-IP           TO  1.                                00032640
027990       SEARCH RTA-PT-ENTRIES                                      00032660
028000          AT END                                                  00032670
026890            MOVE ERC-YES   TO  CCF-ABEND-FLAG                     00032680
026900            MOVE ERC-ABEND-RTA-TBL-OVERFLOW                       00032690
026910                           TO CCF-USER-ABEND-CODE                 00032700
026920            MOVE C02-SUBROUTINE-NAME                              00032710
026930                           TO CCF-SUBROUTINE-WHICH-SET-ABEND      00032720
026940            MOVE C02-PARAGRAPH-4S1775                             00032730
026950                           TO CCF-PARAGRAPH-WHICH-SET-ABEND       00032740
026960            DISPLAY 'RTA PORTFOLIO TYPE TABLE CAPACITY EXCEEDED'  00032750
027440            DISPLAY 'TDA-PORTFOLIO-TYPE = ' TDA-PORTFOLIO-TYPE    00032760
028020          WHEN (TDA-PORTFOLIO-TYPE = RTA-PT (RTA-IP))             00032780
028030            AND (RTA-IP <= RTA-PT-TBL-ENTRY-COUNT)                00032790
028040                 CONTINUE                                         00032800
028050          WHEN (RTA-IP > RTA-PT-TBL-ENTRY-COUNT) AND              00032810
028060               (RTA-IP <= TLC-MAX-RTAP)                           00032820
028070                MOVE TDA-PORTFOLIO-TYPE                           00032830
028080                                TO  RTA-PT (RTA-IP)               00032840
028090                SET RTA-PT-TBL-ENTRY-COUNT TO RTA-IP              00032850
028100       END-SEARCH.                                                00032860
028350 EJECT                                                            00033130
029000******************************************************************00033820
029010 4S2000-COUNT-INPUT-TOTALS.                                       00033830
029020******************************************************************00033840
029030                                                                  00033850
029040***  THE FOLLOWING TWO PARAGRAPHS WILL COUNT THE INPUT SEGMENTS.  00033860
029050***  THIS LOGIC WAS COPIED FROM CCLB100.  SINCE WE HAD TO ADD     00033870
029060***  LOGIC TO COUNT THE NEW SEGMENT TYPES, WE DECIDED TO COUNT    00033880
029070***  EVERYTHING HERE INSTEAD OF IN CCLB100  WHEN THE PARALLEL     00033890
029080***  IS OVER, THE COUNTING IN LB100 CAN BE REMOVED.               00033900
029090*                                                                 00033910
029310                                                                  00033920
029320     EVALUATE TRUE                                                00033930
029310                                                                  00033920
029330         WHEN CCF-BASE-SEG                                        00033940
029340              PERFORM 4S2100-COUNT-BASE-SEGS                      00033950
029310                                                                  00033920
029350         WHEN CCF-A1-SEG                                          00033960
029360              ADD +1            TO  RTA-A1-SEGMENTS-IN            00033970
                                          IOT-IN-TOTAL
                                          IOT-IN-A1-SEGMENTS
029370         WHEN CCF-A2-SEG                                          00033980
029380              ADD +1            TO  RTA-A2-SEGMENTS-IN            00033990
                                          IOT-IN-TOTAL
                                          IOT-IN-A2-SEGMENTS
029390         WHEN CCF-A3-SEG                                          00034000
029400              ADD +1            TO  RTA-A3-SEGMENTS-IN            00034010
                                          IOT-IN-TOTAL
029390         WHEN CCF-J1-SEG                                          00034000
029400              ADD +1            TO  RTA-J1-SEGMENTS-IN            00034010
                                          IOT-IN-TOTAL
029390         WHEN CCF-J2-SEG                                          00034000
029400              ADD +1            TO  RTA-J2-SEGMENTS-IN            00034010
                                          IOT-IN-TOTAL
029410     END-EVALUATE.                                                00034020

           IF CCF-CONSECUTIVE-ERROR
              ADD +1                  TO  RTA-CONSECUTIVE-ERR-CT.
029420 EJECT                                                            00034030
029430******************************************************************00034040
029440 4S2100-COUNT-BASE-SEGS.                                          00034050
029450******************************************************************00034060
029460                                                                  00034070
029470     ADD +1                TO  RTA-BASE-SEGMENTS-IN               00034080
                                     IOT-IN-TOTAL
                                     IOT-IN-BASE-SEGMENTS.
029480                                                                  00034090
029490     IF  CCF-B1-DATA                                              00034100
029500         ADD +1            TO  RTA-B1-SEGMENTS-IN.                00034110
029510                                                                  00034120
029520     IF  CCF-B2-GRID OR                                           00034130
               (OPS-03-NEW-METRO AND TDA-PAYMENT-HISTORY NOT = SPACES)
029530         ADD +1            TO  RTA-B2-SEGMENTS-IN.                00034140
029540                                                                  00034150
029550     IF  CCF-MULTI-B2-GRID                                        00034160
029560         ADD +1            TO  RTA-B2-SEGMENTS-IN.                00034170
029570                                                                  00034180
029580     IF  CCF-B3-GRID                                              00034190
029590         ADD +1            TO  RTA-B3-SEGMENTS-IN.                00034200
029600                                                                  00034210
029610     IF  CCF-MULTI-B3-GRID                                        00034220
029620         ADD +1            TO  RTA-B3-SEGMENTS-IN.                00034230
029630                                                                  00034240
029640     IF  CCF-C1-DATA                                              00034250
029650         IF  OPS-07-BYPASS-C1                                     00034260
029660         AND OPS-04-BALANCE-REPORTER                              00034270
029670             ADD +1        TO  RTA-C1-SEGMENTS-BYPASS             00034280
029680             ADD +1        TO  RTA-C1-SEGMENTS-IN                 00034290
029690         ELSE                                                     00034300
029700             ADD +1        TO  RTA-C1-SEGMENTS-IN.                00034310
029710                                                                  00034320
029720     IF  CCF-D1-DATA                                              00034330
029770         ADD +1            TO  RTA-D1-SEGMENTS-IN.                00034380
029780                                                                  00034390
030090     IF  CCF-E1-DATA                                              00034730
030100         ADD +1            TO  RTA-E1-SEGMENTS-IN                 00034740
030100                               IOT-IN-E1-SEGMENTS.                00034740
030110                                                                  00034750
029800     IF  CCF-F1-DATA                                              00034410
029810         IF  OPS-07-BYPASS-F1                                     00034420
029820         AND OPS-04-BALANCE-REPORTER                              00034430
029830             ADD +1        TO  RTA-F1-SEGMENTS-BYPASS             00034440
029840             ADD +1        TO  RTA-F1-SEGMENTS-IN                 00034450
029850         ELSE                                                     00034460
029860             ADD +1        TO  RTA-F1-SEGMENTS-IN.                00034470
029870                                                                  00034480
029880                                                                  00034490
029890     IF  CCF-G1-DATA                                              00034500
029900         IF  OPS-07-BYPASS-G1                                     00034510
029910         AND OPS-04-BALANCE-REPORTER                              00034520
029920             ADD +1        TO  RTA-G1-SEGMENTS-BYPASS             00034530
029930             ADD +1        TO  RTA-G1-SEGMENTS-IN                 00034540
029940         ELSE                                                     00034550
029950             ADD +1        TO  RTA-G1-SEGMENTS-IN.                00034560
029960                                                                  00034570
029970     IF  CCF-H1-DATA                                              00034580
029980         ADD +1            TO  RTA-H1-SEGMENTS-IN                 00034590
029990                               RTA-H1-SEGMENTS-BYPASS.            00034600

029640     IF  CCF-M1-DATA                                              00034250
029650         IF  OPS-07-BYPASS-M1                                     00034260
029660         AND OPS-04-BALANCE-REPORTER                              00034270
029670             ADD +1        TO  RTA-M1-SEGMENTS-BYPASS             00034280
029680             ADD +1        TO  RTA-M1-SEGMENTS-IN                 00034290
029690         ELSE                                                     00034300
029700             ADD +1        TO  RTA-M1-SEGMENTS-IN.                00034310
029710                                                                  00034320
029970     IF  CCF-N1-DATA                                              00034610
029650         IF  OPS-08-BYPASS-N1                                     00034260
029660         AND OPS-04-BALANCE-REPORTER                              00034270
029670             ADD +1        TO  RTA-N1-SEGMENTS-BYPASS             00034280
029680             ADD +1        TO  RTA-N1-SEGMENTS-IN                 00034290
029690         ELSE                                                     00034300
029980             ADD +1            TO  RTA-N1-SEGMENTS-IN.            00034620
029990                                                                  00034630
029640     IF  CCF-K1-DATA                                              00034250
029650         IF  OPS-08-BYPASS-K1                                     00034260
029660         AND OPS-04-BALANCE-REPORTER                              00034270
029670             ADD +1        TO  RTA-K1-SEGMENTS-BYPASS             00034280
029680             ADD +1        TO  RTA-K1-SEGMENTS-IN                 00034290
029690         ELSE                                                     00034300
029700             ADD +1        TO  RTA-K1-SEGMENTS-IN.                00034310
029710                                                                  00034320
029640     IF  CCF-K2-DATA                                              00034250
029650         IF  OPS-08-BYPASS-K2                                     00034260
029660         AND OPS-04-BALANCE-REPORTER                              00034270
029670             ADD +1        TO  RTA-K2-SEGMENTS-BYPASS             00034280
029680             ADD +1        TO  RTA-K2-SEGMENTS-IN                 00034290
029690         ELSE                                                     00034300
029700             ADD +1        TO  RTA-K2-SEGMENTS-IN.                00034310
029710                                                                  00034320
029640     IF  CCF-K3-DATA                                              00034250
029650         IF  OPS-08-BYPASS-K3                                     00034260
029660         AND OPS-04-BALANCE-REPORTER                              00034270
029670             ADD +1        TO  RTA-K3-SEGMENTS-BYPASS             00034280
029680             ADD +1        TO  RTA-K3-SEGMENTS-IN                 00034290
029690         ELSE                                                     00034300
029700             ADD +1        TO  RTA-K3-SEGMENTS-IN.                00034310
029710                                                                  00034320
029640     IF  CCF-K4-DATA                                              00034250
029650         IF  OPS-08-BYPASS-K4                                     00034260
029660         AND OPS-04-BALANCE-REPORTER                              00034270
029670             ADD +1        TO  RTA-K4-SEGMENTS-BYPASS             00034280
029680             ADD +1        TO  RTA-K4-SEGMENTS-IN                 00034290
029690         ELSE                                                     00034300
029700             ADD +1        TO  RTA-K4-SEGMENTS-IN.                00034310
029710                                                                  00034320
029640     IF  CCF-L1-DATA                                              00034250
029650         IF  OPS-54-DO-NOT-PROCESS-L1                             00034260
029660         AND OPS-04-BALANCE-REPORTER                              00034270
029670             ADD +1        TO  RTA-L1-SEGMENTS-BYPASS             00034280
029680             ADD +1        TO  RTA-L1-SEGMENTS-IN                 00034290
029690         ELSE                                                     00034300
029700             ADD +1        TO  RTA-L1-SEGMENTS-IN.                00034310

           IF  LDA-BANKRUPTCY-COURT
               ADD +1            TO RTA-BK-SEGMENTS-CREATE
           ELSE
           IF  LDA-JUDGEMENT-OR-SUIT-COURT
               ADD +1            TO RTA-CV-SEGMENTS-CREATE
           ELSE
           IF  LDA-LIEN-COURT
               ADD +1            TO RTA-LN-SEGMENTS-CREATE.


029710*************************                                         00034320
029100*** 10/27/94 FOR EVERY INPUT ACCOUNT ACCUMULATE                   00034760
029110***          VALID AMOUNT FIELDS (IN DOLLARS  O-N-L-Y)            00034770
029110***          AND COUNT NUMBER OF                                  00034780
029120***          ACCOUNTS WITH DEFAULT VALUE IN THE TERMS FIELD.      00034790
029710*************************                                         00034320
           IF OPS-03-NEW-METRO
029140        IF  CRF-AMOUNT-NUMERIC          IS NUMERIC                00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-LOAN-AMOUNTS                 00034830
029160                       =  RTA-SUM-OF-LOAN-AMOUNTS                 00034840
029150                       + (CRF-AMOUNT-NUMERIC  / 100)              00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-AMOUNT-NUMERIC TO                        00034870
029160                          RTA-SUM-OF-LOAN-AMOUNTS                 00034880
                  END-IF
              END-IF
           ELSE
029140        IF  CRF-AMOUNT7-NUMERIC         IS NUMERIC                00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-LOAN-AMOUNTS                 00034830
029160                       =  RTA-SUM-OF-LOAN-AMOUNTS                 00034840
029150                       + (CRF-AMOUNT7-NUMERIC / 100)              00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-AMOUNT7-NUMERIC TO                       00034870
029160                          RTA-SUM-OF-LOAN-AMOUNTS                 00034880
                  END-IF
              END-IF
           END-IF.
029160                                                                  00034890
           IF OPS-03-NEW-METRO
029140        IF  CRF-BALANCE-AMOUNT-NUMERIC  IS NUMERIC                00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-BALANCE-AMOUNTS              00034830
029160                       =  RTA-SUM-OF-BALANCE-AMOUNTS              00034840
029150                       + (CRF-BALANCE-AMOUNT-NUMERIC / 100)       00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-BALANCE-AMOUNT-NUMERIC TO                00034870
029160                          RTA-SUM-OF-BALANCE-AMOUNTS              00034880
                  END-IF
              END-IF
           ELSE
029140        IF  CRF-BALANCE-AMOUNT7-NUMERIC IS NUMERIC                00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-BALANCE-AMOUNTS              00034830
029160                       =  RTA-SUM-OF-BALANCE-AMOUNTS              00034840
029150                       + (CRF-BALANCE-AMOUNT7-NUMERIC / 100)      00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-BALANCE-AMOUNT7-NUMERIC TO               00034870
029160                          RTA-SUM-OF-BALANCE-AMOUNTS              00034880
                  END-IF
              END-IF
           END-IF.
029160                                                                  00034890
           IF OPS-03-NEW-METRO
029140        IF  CRF-AMOUNT-PAST-DUE-NUMERIC IS NUMERIC                00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-PAST-DUE-AMOUNTS             00034830
029160                       =  RTA-SUM-OF-PAST-DUE-AMOUNTS             00034840
029150                       + (CRF-AMOUNT-PAST-DUE-NUMERIC / 100)      00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-AMOUNT-PAST-DUE-NUMERIC TO               00034870
029160                          RTA-SUM-OF-PAST-DUE-AMOUNTS             00034880
                  END-IF
              END-IF
           ELSE
029140        IF  CRF-AMOUNT-PAST-DUE7-NUMERIC IS NUMERIC               00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-PAST-DUE-AMOUNTS             00034830
029160                       =  RTA-SUM-OF-PAST-DUE-AMOUNTS             00034840
029150                       + (CRF-AMOUNT-PAST-DUE7-NUMERIC / 100)     00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-AMOUNT-PAST-DUE7-NUMERIC TO              00034870
029160                          RTA-SUM-OF-PAST-DUE-AMOUNTS             00034880
                  END-IF
              END-IF
           END-IF.
029160                                                                  00034890
           IF OPS-03-NEW-METRO
029140        IF  CRF-CREDIT-LIMIT-NUMERIC IS NUMERIC                   00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-CREDIT-LIMITS                00034830
029160                       =  RTA-SUM-OF-CREDIT-LIMITS                00034840
029150                       + (CRF-CREDIT-LIMIT-NUMERIC / 100)         00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-CREDIT-LIMIT-NUMERIC TO                  00034870
029160                          RTA-SUM-OF-CREDIT-LIMITS                00034880
                  END-IF
              END-IF
           ELSE
029140        IF  CRF-CREDIT-LIMIT7-NUMERIC IS NUMERIC                  00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-CREDIT-LIMITS                00034830
029160                       =  RTA-SUM-OF-CREDIT-LIMITS                00034840
029150                       + (CRF-CREDIT-LIMIT7-NUMERIC / 100)        00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-CREDIT-LIMIT7-NUMERIC TO                 00034870
029160                          RTA-SUM-OF-CREDIT-LIMITS                00034880
                  END-IF
              END-IF
           END-IF.
029160                                                                  00034890
           IF OPS-03-NEW-METRO
029140        IF  CRF-PAYMENT-AMOUNT-NUMERIC IS NUMERIC                 00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-MONTHLY-PAYMENTS             00034830
029160                       =  RTA-SUM-OF-MONTHLY-PAYMENTS             00034840
029150                       + (CRF-PAYMENT-AMOUNT-NUMERIC / 100)       00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-PAYMENT-AMOUNT-NUMERIC TO                00034870
029160                          RTA-SUM-OF-MONTHLY-PAYMENTS             00034880
                  END-IF
              END-IF
           ELSE
029140        IF  CRF-PAYMENT-AMOUNT7-NUMERIC IS NUMERIC                00034810
029160            IF  OPS-31-AMOUNT-CENTS                               00034820
029160                COMPUTE   RTA-SUM-OF-MONTHLY-PAYMENTS             00034830
029160                       =  RTA-SUM-OF-MONTHLY-PAYMENTS             00034840
029150                       + (CRF-PAYMENT-AMOUNT7-NUMERIC / 100)      00034850
029150            ELSE                                                  00034860
029150                ADD  CRF-PAYMENT-AMOUNT7-NUMERIC TO               00034870
029160                          RTA-SUM-OF-MONTHLY-PAYMENTS             00034880
                  END-IF
              END-IF
           END-IF.
029160                                                                  00035070
029290     IF  TDA-DEFAULT-TERMS                                        00035250
029300         ADD  +1           TO    RTA-TERMS-DEFAULTED.             00035260
030120 EJECT                                                            00035270
030130******************************************************************00035280
030140 4S3000-COUNT-UPD-BASE-TOTALS.                                    00035290
030150******************************************************************00035300

030440     IF M99-VALID-ACCT-TYPE                                       00035520
030450         ADD +1   TO  RTA-TYPE-PROCESS  (RTA-I2).                 00035530
030490                                                                  00035640
030500     IF M99-VALID-STATUS                                          00035650
030510         ADD +1   TO  RTA-STATUS-PROCESS  (RTA-I5).               00035660
030520                                                                  00035670
030530     IF M99-VALID-SP-COM                                          00035680
030540         ADD +1   TO  RTA-SP-COM-PROCESS  (RTA-I6).               00035690
030550                                                                  00035700
030410     IF TDA-PROCESSING-IND-VALID                                  00035370
030420         ADD +1   TO  RTA-PI-PROCESS        (RTA-I8).             00035380

030410     IF TDA-CCC-VALID                                             00035370
030420         ADD +1   TO  RTA-CCC-PROCESS        (RTA-I9).            00035380

           IF TDA-PORTFOLIO-TYPE-VALID
030420         ADD +1   TO  RTA-PT-PROCESS         (RTA-IP).            00035380

030410     IF TDA-CREDITOR-CLASS-VALID                                  00035370
030420         ADD +1   TO  RTA-CRCL-PROCESS        (RTA-IJ).           00035380

030590     IF  OPS-04-BALANCE-REPORTER                                  00035780
030600         IF  TDA-VALID-PAYMENT-AMOUNT                             00035790
030610             ADD +1      TO  RTA-PAYMENT-AMOUNT-OUT               00035800
030620             MOVE TDA-PAYMENT-AMOUNT-FLAG                         00035810
030630                         TO  TDA-PAY-AMT-PRINT-FLAG               00035820
030640         ELSE                                                     00035830
030650             IF TDA-BYPASS-PAYMENT-AMOUNT                         00035840
030660                 IF  TDA-PAY-AMT-OPT-BYPASS                       00035850
030670                 AND TDA-STATUS-PAY-AMT-ALLOWED                   00035860
030680                 AND TDA-VALID-BAL-AMT                            00035870
030690                     ADD +1                                       00035880
030700                         TO  RTA-PAYMENT-AMOUNT-BYPASS            00035890
030710                     MOVE TDA-PAY-AMT-PROCESS-OPT                 00035900
030720                         TO  TDA-PAY-AMT-PRINT-FLAG               00035910
030730                 ELSE                                             00035920
030740                     NEXT SENTENCE                                00035930
030750             ELSE                                                 00035940
030760                 IF  TDA-PAY-AMT-OPT-SCHED                        00035950
030770                     ADD +1                                       00035960
030780                         TO  RTA-PAY-AMT-OPT-S-ERROR              00035970
030790                     MOVE TDA-PAY-AMT-PROCESS-OPT                 00035980
030800                         TO  TDA-PAY-AMT-PRINT-FLAG               00035990
030810                 ELSE                                             00036000
030820                 IF  TDA-PAY-AMT-OPT-TERMS                        00036010
030830                     ADD +1                                       00036020
030840                         TO  RTA-PAY-AMT-OPT-T-ERROR              00036030
030850                     MOVE TDA-PAY-AMT-PROCESS-OPT                 00036040
030860                         TO  TDA-PAY-AMT-PRINT-FLAG               00036050
030870                 ELSE                                             00036060
030910                     ADD +1                                       00036100
030920                         TO  RTA-PAY-AMT-TBL02-ERROR              00036110
030930                     SET TDA-PAY-AMT-PRINT-TBL02-ERR TO TRUE.     00036120
030960                                                                  00036150
030970     IF  OPS-04-BALANCE-REPORTER                                  00036160
030990         IF  TDA-VALID-DATE-LAST-PAY                              00036180
031000             IF  TDA-DATE-LAST-PAY-BYPASS                         00036190
031010                 ADD +1  TO  RTA-DATE-LAST-PAY-BYPASS             00036200
031020             ELSE                                                 00036210
031030                 ADD +1  TO  RTA-DATE-LAST-PAY-OUT                00036220
031040         ELSE                                                     00036230
031050             IF  TDA-ILLOGIC-DATE-LAST-PAY                        00036240
031060                 ADD +1  TO  RTA-DATE-LAST-PAY-ILLOG.             00036250

           IF  LDA-STALE-RECORD
               ADD +1            TO RTA-STALE-OUT.
031150 EJECT                                                            00036340
030130******************************************************************00035280
030140 4S3100-COUNT-UPD-SEGS-TOTALS.                                    00035290
030150******************************************************************00035300
030350                                                                  00035460
030250     IF CDA-VALID-ECOA-CODE                                       00035320
030260         ADD +1   TO  RTA-ECOA-PROCESS       (RTA-I3).            00035330
                                                                        00035360
030410     IF TDA-CONSUMER-INFO-IND-VALID                               00035370
030420         ADD +1   TO  RTA-CII-PROCESS        (RTA-I7).            00035380

030410     IF TDA-CONSUMER-INFO-IND-2 = SPACES                          00035370
              CONTINUE
           ELSE
030420         ADD +1   TO  RTA-CII-PROCESS        (S01-SECOND-CII).    00035380
       EJECT
031160******************************************************************00036350
031170 4S4000-COUNT-RECYCLE-TOTALS.                                     00036360
031180******************************************************************00036370

031210     ADD +1  TO  RTA-RECYCLE-OUT.
031240                                                                  00036510
031390     IF M99-ACCT-TYPE-ERROR AND CCF-ABEND                         00036770
              CONTINUE                                                  00036790
           ELSE                                                         00036800
030470     IF M99-ACCT-TYPE-ERROR                                       00036590
0304          ADD +1   TO  RTA-TYPE-ERROR                               00036600
0304                       RTA-UNEQ-TYPE-RECYCLE  (RTA-IF)              00036600
031270     ELSE                                                         00036540
031250     IF M99-VALID-ACCT-TYPE  AND  CCF-BASE-SEG                    00036520
031260         ADD +1  TO  RTA-TYPE-RECYCLE  (RTA-I2).                  00036530
031300                                                                  00036640
031310     IF CDA-ECOA-CODE-ERROR AND CCF-ABEND                         00036650
              CONTINUE                                                  00036670
           ELSE                                                         00036680
031310     IF CDA-ECOA-CODE-ERROR                                       00036690
031320         ADD +1  TO  RTA-ECOA-ERROR                               00036700
031330                     RTA-UNEQ-ECOA-RECYCLE   (RTA-IB)             00036710
031340     ELSE                                                         00036720
031350     IF CDA-VALID-ECOA-CODE                                       00036730
031360         ADD +1  TO  RTA-ECOA-RECYCLE        (RTA-I3).            00036740
031380                                                                  00036760
031470     IF M99-VALID-STATUS  AND  CCF-BASE-SEG                       00036930
031510         ADD +1  TO  RTA-STATUS-RECYCLE      (RTA-I5)             00036980
031520     ELSE                                                         00036990
031530     IF M99-STATUS-ERROR AND CCF-ABEND                            00037000
              CONTINUE                                                  00037020
           ELSE                                                         00037030
031530     IF M99-STATUS-ERROR                                          00037040
031540         ADD +1  TO  RTA-STATUS-ERROR                             00037050
031550                     RTA-UNEQ-STATUS-RECYCLE (RTA-ID).            00037060
031570                                                                  00037070
031580     IF M99-SP-COM-ERROR AND CCF-ABEND                            00037080
              CONTINUE                                                  00037100
           ELSE                                                         00037110
031580     IF M99-SP-COM-ERROR                                          00037120
031590         ADD +1  TO  RTA-SP-COM-ERROR                             00037130
031600                     RTA-UNEQ-SP-COM-RECYCLE (RTA-IE)             00037140
031610     ELSE                                                         00037150
031620     IF M99-VALID-SP-COM  AND  CCF-BASE-SEG                       00037160
031630         ADD +1  TO  RTA-SP-COM-RECYCLE      (RTA-I6).            00037170
031640                                                                  00037180
030560     IF TDA-CYCLE-ID-ERROR AND OPS-40-CYCLE-TBL07                 00035710
           AND CCF-ABEND                                                00035720
               CONTINUE                                                 00035730
           ELSE                                                         00035740
030560     IF TDA-CYCLE-ID-ERROR AND OPS-40-CYCLE-TBL07                 00035750
030570         ADD +1   TO  RTA-UNEQ-CYCLE-RECYCLE (RTA-IA).            00035760
031670*                                                                 00037250
031680*  METR2  - CII , PI AND L1SIN JC 07/13/98                        00037260
031670*                                                                 00037250
031580     IF M99-CII-INVALID AND CCF-ABEND                             00037090
              CONTINUE                                                  00037100
           ELSE                                                         00037110
031580     IF M99-CII-INVALID                                           00037120
031600         ADD +1  TO  RTA-CII-ERROR                                00037140
031600                     RTA-UNEQ-CII-RECYCLE (RTA-IG)                00037140
031610     ELSE                                                         00037150
031620     IF M99-VALID-CII                                             00037160
031630         ADD +1  TO  RTA-CII-RECYCLE      (RTA-I7).               00037170
031640                                                                  00037180
031580     IF M99-PI-INVALID AND CCF-ABEND                              00037090
              CONTINUE                                                  00037100
           ELSE                                                         00037110
031580     IF M99-PI-INVALID                                            00037120
031600         ADD +1  TO  RTA-PI-ERROR                                 00037140
031600                     RTA-UNEQ-PI-RECYCLE (RTA-IH)                 00037140
031610     ELSE                                                         00037150
031620     IF M99-VALID-PI  AND  CCF-BASE-SEG                           00037160
031630         ADD +1  TO  RTA-PI-RECYCLE      (RTA-I8).                00037170
031640                                                                  00037180
031620     IF TDA-CCC-VALID AND  CCF-BASE-SEG                           00037160
031630         ADD +1  TO  RTA-CCC-RECYCLE      (RTA-I9).               00037170
031640                                                                  00037180
031620     IF TDA-PORTFOLIO-TYPE-VALID AND CCF-BASE-SEG                 00037160
031630         ADD +1  TO  RTA-PT-RECYCLE       (RTA-IP).               00037170
031640                                                                  00037180
031620     IF TDA-CREDITOR-CLASS-VALID AND  CCF-BASE-SEG                00037160
031630         ADD +1  TO  RTA-CRCL-RECYCLE      (RTA-IJ).              00037170

           IF LDA-COURT-CODE-STATUS-XERR-Y
               ADD +1  TO  RTA-COURT-CODE-STATUS-RECYCLE (RTA-IK).
031640                                                                  00037180
           IF LDA-COLLECTOR-ID-ERROR
               ADD +1  TO  RTA-COURT-CODE-COLLID-RECYCLE (RTA-IL).
031640                                                                  00037180
           IF TDA-BASE-SUB-KOB-AT-XERR-Y
               ADD +1  TO  RTA-BASE-KOB-AT-COUNT (RTA-IN)
               ADD +1  TO  RTA-BASE-KOB-AT-XERR.

033880     IF  TDA-L1-SUB-KOB-AT-XERR-Y                                 00040040
               ADD +1  TO  RTA-L1-KOB-AT-COUNT (RTA-IO)
               ADD +1  TO  RTA-L1-KOB-AT-XERR.

031580     IF TDA-L1SIN-INVALID AND CCF-ABEND                           00037090
              CONTINUE                                                  00037100
           ELSE                                                         00037110
031580     IF TDA-L1SIN-INVALID                                         00037120
031600         ADD +1  TO  RTA-UNEQ-L1SIN-RECYCLE (RTA-II).             00037140
031670*                                                                 00037250
031680*  METR2  - OTHER NEW CROSSFIELD ERRORS                           00037260
031670*                                                                 00037250
033880     IF  TDA-ST91-ACCTYPE-XERR-Y                                  00040040
               ADD +1          TO  RTA-ST91-ACCTYPE-XERR.

031910     IF TDA-SPECIAL-COMMENT-H-XERR                                00037510
031930         ADD +1     TO  RTA-SP-COM-H-RECYCLE                      00037530
031900     ELSE                                                         00037540
014620         IF TDA-SPECIAL-COMMENT-ATY-XERR                          00037550
031930                ADD +1     TO  RTA-SP-COM-ATY-RECYCLE.            00037560
                                                                        00037570
           IF  TDA-SCC-STAT-BA-XERR-Y
               ADD +1          TO  RTA-SCC-STAT-BA-XERR
                                   RTA-SCC-STAT-ALL-XERR
               IF  CCF-BASE-SEG
                   SET SCF-SCC-BA-STAT-XERR-Y TO TRUE
               END-IF
           END-IF.

           IF  TDA-SCC-STAT-AX-C-XERR-Y
               ADD +1          TO  RTA-SCC-STAT-AX-C-XERR
                                   RTA-SCC-STAT-ALL-XERR
               IF  CCF-BASE-SEG
                   ADD +1          TO  RTA-PD-SCC-NO-PD-STAT
                   SET SCF-PD-SCC-NO-PD-STAT-Y TO TRUE
               END-IF
           END-IF.

           IF  TDA-SCC-STAT-BP-XERR-Y
               ADD +1          TO  RTA-SCC-STAT-BP-XERR
                                   RTA-SCC-STAT-ALL-XERR
               IF  CCF-BASE-SEG
                   ADD +1      TO  RTA-PD-SCC-NO-PD-STAT
                   SET SCF-PD-SCC-NO-PD-STAT-Y TO TRUE
               END-IF
           END-IF.

           IF TDA-SUBCODE-CUSTMAST-NT-FND
           OR LDA-COURT-CODE-CUSTMAST-NT-FND
              ADD +1        TO  RTA-CUSTMAST-NOT-FOUND
           ELSE
           IF TDA-SUBCODE-CUSTMST-TYPE-ERR-Y
           OR LDA-COURT-CD-CSTMST-TYPE-ERR-Y
              ADD +1        TO  RTA-CUSTMAST-INVALID-TYPE
           ELSE
           IF TDA-SUBCODE-CUSTMAST-ST-INV
           OR LDA-COURT-CODE-CUSTMAST-ST-INV
              ADD +1        TO  RTA-CUSTMAST-INVALID-STATUS
           ELSE
           IF LDA-COURT-CODE-CT-INFO-NT-FND
              ADD +1        TO  RTA-CT-CNTRCT-NOT-FOUND
           ELSE
           IF LDA-COURT-CODE-FREQ-CD-NT-FND
              ADD +1        TO  RTA-CT-FREQ-NOT-FOUND.

           IF  TDA-SUBCODE-ERROR
           OR  TDA-L1SIN-INVALID
           OR  LDA-COURT-CODE-ERROR
               ADD +1          TO  RTA-CONS-SUBCODE-RECY
               IF I07-NO-TRADE-RECY
                  ADD +1       TO  RTA-TRADE-RECYC-TOT
                  SET I07-TRADE-RECY TO TRUE
               END-IF
           END-IF.

           IF  TDA-STATUS-ERROR
           OR  TDA-SP-COMMENTS-ERROR
           OR  TDA-ACCT-TYPE-ERROR
           OR  CDA-ECOA-CODE-ERROR
           OR  (TDA-CYCLE-ID-ERROR AND OPS-40-CYCLE-TBL07)
           OR  TDA-CONSUMER-INFO-IND-INVALID
           OR  TDA-PROCESSING-IND-INVALID
           OR  TDA-ST91-ACCTYPE-XERR-Y
           OR  TDA-SCC-STAT-AX-C-XERR-Y
           OR  TDA-SCC-STAT-BA-XERR-Y
           OR  TDA-SCC-STAT-BP-XERR-Y
           OR  TDA-SPECIAL-COMMENT-H-XERR
           OR  TDA-SPECIAL-COMMENT-ATY-XERR
           OR (LDA-STATUS-ERROR AND NOT LDA-STATUS-DISCARD)
           OR LDA-SP-COMMENTS-ERROR
           OR LDA-COURT-CODE-STATUS-XERR-Y
           OR LDA-COLLECTOR-ID-ERROR
               ADD +1 TO RTA-CONS-NONSUBCODE-RECY
               IF I07-NO-TRADE-RECY
                  ADD +1 TO RTA-TRADE-RECYC-TOT
                  SET I07-TRADE-RECY TO TRUE
               END-IF
               IF I08-NO-TRADE-NONSUB-RECY
                  ADD +1 TO RTA-TRADE-NRECY-TOT
                  SET I08-TRADE-NONSUB-RECY TO TRUE
               END-IF
           END-IF.
031780 EJECT                                                            00037360
032030******************************************************************00038060
032040 4S5000-COUNT-BYPASS-TOTALS.                                      00038070
032050******************************************************************00038080
032060                                                                  00038090
032070     IF  CCF-OUTPUT-TO-BYPASS                                     00038100
032080         ADD +1               TO RTA-TOTAL-BYPASS                 00038110
032090         IF  CCF-BYPASS-REASON-CODE  =                            00038120
032100             ERC-BYPASS-REQUEST-SUBCODE                           00038130
032110             ADD +1           TO RTA-SUBCODE-BYPASS               00038140
032120         ELSE                                                     00038150
032130         IF  CCF-BYPASS-REASON-CODE  =                            00038160
032140             ERC-BYPASS-REQUEST-ACCOUNT-TY                        00038170
032150             ADD +1           TO RTA-TYPE-BYPASS                  00038180
032160         ELSE                                                     00038190
032170         IF  CCF-BYPASS-REASON-CODE  =                            00038200
032180             ERC-BYPASS-REQUEST-ECOA-CODE                         00038210
032190             ADD +1           TO RTA-ECOA-BYPASS                  00038220
032240         ELSE                                                     00038270
032250         IF  CCF-BYPASS-REASON-CODE  =                            00038280
032260             ERC-BYPASS-REQUEST-STATUS-CODE                       00038290
032270             ADD +1           TO RTA-STATUS-BYPASS                00038300
032240         ELSE                                                     00038270
032250         IF  CCF-BYPASS-REASON-CODE  =                            00038280
032260             ERC-BYPASS-REQUEST-CII                               00038290
032270             ADD +1           TO RTA-CII-BYPASS                   00038300
032240         ELSE                                                     00038270
032250         IF  CCF-BYPASS-REASON-CODE  =                            00038280
032260             ERC-BYPASS-REQUEST-PI                                00038290
032270             ADD +1           TO RTA-PI-BYPASS.                   00038300

032280 EJECT                                                            00038310
032290******************************************************************00038320
032300 4S6000-COUNT-DISCARD-TOTALS.                                     00038330
032310******************************************************************00038340
032320                                                                  00038350
           IF  CCF-OUTPUT-TO-DISCARDS                                   00038370
032340         ADD +1       TO  RTA-DISCARD-OUT                         00038400
                                RTA-TOTAL-DISCARD                       00038410
                                IOT-OUT-DISCARD                         00038410
               IF  I06-NO-TRADE-DISCARD
                   ADD +1   TO  RTA-TRADE-DISCARD-TOT
                   SET I06-TRADE-DISCARD TO TRUE
               END-IF
032350         IF  CCF-BYPASS-REASON-CODE  =                            00038420
032360             ERC-BYPASS-CROSS-FIELD-ERROR                         00038430
032370             ADD +1   TO  RTA-CROSS-FIELD-DISCARD                 00038440
032380         ELSE                                                     00038450
032390         IF  CCF-BYPASS-REASON-CODE  =                            00038460
032400             ERC-BYPASS-INVALID-ACCT-UNS                          00038470
032410             ADD +1   TO  RTA-INVALID-UNSCRAM-DISCARD             00038480
032460         ELSE                                                     00038530
032470             ADD +1   TO  RTA-FIELD-ERROR-DISCARD.                00038540
032480 EJECT                                                            00038550
032490******************************************************************00038560
032500 4S7000-COUNT-MISC-BASE-TOTALS.                                   00038570
032510******************************************************************00038580
032520                                                                  00038590
032640     IF  CCF-E1-DATA                                              00038640
032660         IF  TDA-OLD-ACCOUNT-NUMBER = TDA-NEW-ACCOUNT-NUMBER      00038660
                   ADD +1         TO  RTA-MATCH-BASE-E1-L1
                   SET SCF-MATCH-BASE-E1-L1-Y TO TRUE
               ELSE
032670             ADD +1         TO  RTA-NONMATCH-BASE-E1-L1           00038670
               END-IF
           END-IF.
032680                                                                  00038680
032640     IF  CCF-L1-DATA                                              00038640
               IF  OPS-54-09-10-11-12
               OR  OPS-54-CHANGE-SUBCODE
               OR  (OPS-54-PROCESS-USING-CI
                   AND (CRF-CHANGE-SUBCODE OR TDA-ACCTCHG-IND-INVALID))
                   CONTINUE
               ELSE
032660            IF  TDA-OLD-ACCOUNT-NUMBER = TDA-NEW-ACCOUNT-NUMBER   00038660
                      ADD +1         TO  RTA-MATCH-BASE-E1-L1
                      SET SCF-MATCH-BASE-E1-L1-Y TO TRUE
                  ELSE
032670                ADD +1         TO  RTA-NONMATCH-BASE-E1-L1        00038670
                  END-IF
               END-IF
           END-IF.
032680                                                                  00038680
032640     IF  CCF-L1-DATA                                              00038640
               IF  TDA-SUBCODE-ERROR
               OR  TDA-L1SIN-INVALID
               OR  OPS-54-09-10-11-12
               OR  OPS-54-CHANGE-ACCOUNT-NUMBER
               OR  (OPS-54-PROCESS-USING-CI
                   AND (CRF-CHANGE-ACCT-NUM OR TDA-ACCTCHG-IND-INVALID))
                   CONTINUE
               ELSE
032660            IF TDA-SUBCODE NOT = TDA-L1SIN                        00038660
032670               ADD +1         TO  RTA-NONMATCH-BASE-L1-SIN.       00038670
032680                                                                  00038680
033090     IF  TDA-OCCURRENCE-VS-OPENED-ERR                             00039170
033100         ADD +1         TO  RTA-DOO-BEFORE-DO.                    00039180
033110                                                                  00039190
033120     IF  TDA-REPORTED-VS-OPENED-ERR                               00039200
033130         ADD +1         TO  RTA-DR-BEFORE-DO.                     00039210
033140                                                                  00039220
033150     IF  TDA-BALANCE-VS-OPENED-ERR                                00039230
033160         ADD +1         TO  RTA-BD-BEFORE-DO.                     00039240
033170                                                                  00039250
032690     IF  TDA-B2-B3-GRID-BOTH-RECD                                 00038690
032700         ADD +1         TO  RTA-PAYHIST-GRID-ERROR.               00038700
032710                                                                  00038710
032720     IF  TDA-B2-B3-GRID-MULTI-SEGS                                00038720
032730         ADD +1         TO  RTA-PAYHIST-GRID-ERROR.               00038730
032740                                                                  00038740
032750     IF  TDA-GRID-INVALID-CODE                                    00038750
032760         ADD +1         TO  RTA-PAYHIST-GRID-ERROR.               00038760
032770                                                                  00038770
032780     IF  TDA-GRID-NOT-ALLOWED                                     00038780
032790         ADD +1         TO  RTA-PAYHIST-GRID-ERROR.               00038790
032800                                                                  00038800
032780     IF  TDA-B2-B3-GRID-NOT-USED                                  00038810
032790         ADD +1         TO  RTA-B2-B3-NOT-USED-ERROR.             00038830
032800                                                                  00038840
032810     IF  TDA-DEFAULT-AMOUNT                                       00038850
032830         ADD +1         TO  RTA-AMOUNT-INVALID.                   00038870
032840                                                                  00038880
032850     IF  TDA-BLANK-BAL-AMT                                        00038890
032870         ADD +1         TO  RTA-BAL-AMOUNT-BLANK                  00038910
               SET SCF-BAL-AMOUNT-BLANK-Y TO TRUE
           END-IF.
032880                                                                  00038920
032850     IF  TDA-DEFAULT-BAL-AMT                                      00038890
032870         ADD +1         TO  RTA-BAL-AMOUNT-INVALID.               00038910
032880                                                                  00038920
           IF  TDA-SCC-BALAMT-CHNGD
               ADD +1         TO  RTA-SCC-BALAMT-CHNGD
           END-IF.

032890     IF  TDA-DEFAULT-AMT-PAST                                     00038930
032910         ADD +1         TO  RTA-PAST-DUE-AMT-INVALID.             00038950
032920                                                                  00038960
032930     IF  TDA-BALLOON-DUE-DATE-INVALID                             00038970
               OR (TDA-BALLOON-DUE-DATE-OMITTED
                   AND TDA-BALLOON-AMOUNT-OMITTED)
032950         ADD +1         TO  RTA-BALLOON-DATE-INVALID.             00038990
032960                                                                  00039000
032970     IF  TDA-BALLOON-AMOUNT-INVALID                               00039010
032970     OR  (TDA-BALLOON-AMOUNT-OMITTED                              00039010
032970          AND (TDA-BALLOON-DUE-DATE-OMITTED OR                    00039010
                     TDA-BALLOON-DUE-DATE-VALID))
032990         ADD +1         TO  RTA-BALLOON-AMOUNT-INVALID.           00039030
033000                                                                  00039040
033050     IF  TDA-DEFAULT-DATE-OPEN                                    00039130
033070         ADD +1         TO  RTA-OPEN-DATE-INVALID                 00039150
033070         ADD +1         TO  RTA-INVALID-OPEN-DATE                 00039150
               SET SCF-INVALID-OPEN-DATE-Y TO TRUE
           END-IF.
033080                                                                  00039160
033210     IF  CCF-DOA-PARMDATE-TOT                                     00039320
033220         ADD +1         TO  RTA-DOA-PARMDATE-TOT.                 00039340

      *****
033230** METRO2 NEW MISC COUNTERS JC 07/13/98                           00039310
      *****
033210     IF  TDA-PAYMENT-RATING-INVALID                               00039290
           AND NOT TDA-STATUS-11
033210         ADD +1 TO  RTA-PAYMENT-RATING-INVALID.                   00039290

033210     IF  TDA-TERMDUR-ACCTYPE-XERR-Y                               00039290
033210         ADD +1 TO  RTA-TERMDUR-ACCTYPE-XERR.                     00039290
033230                                                                  00039350
032650     IF  TDA-SCC-CCC-XERR-Y                                       00038650
033210         ADD +1 TO  RTA-SCC-CCC-XERR.                             00039290
033230                                                                  00039350
033210     IF  TDA-CREDITOR-CLASS-INVALID                               00039290
               OR TDA-CREDITOR-CLASS-OMITTED
               ADD +1 TO  RTA-CREDITOR-CLASS-INVALID.

033230     IF  TDA-PORTF-IND-INVALID                                    00039350
033230         ADD +1 TO  RTA-PORTF-IND-INVALID.                        00039350

033230     IF  TDA-PORTF-NAME-INVALID                                   00039350
033230         ADD +1 TO  RTA-PORTF-NAME-INVALID.                       00039350

033230     IF  TDA-PORTF-IND-NAME-XERR-Y                                00039350
033230         ADD +1 TO  RTA-PORTF-IND-NAME-XERR.                      00039350

033230     IF  TDA-AGENCY-ID-INVALID                                    00039350
           OR ((TDA-AGENCY-ID-00) AND
               (TDA-MORTGAGE-ACCT-NUM-VALID OR
               TDA-MORTGAGE-ACCT-NUM-INVALID))
033230         ADD +1 TO  RTA-AGENCY-ID-INVALID.                        00039350

033230     IF  TDA-MORTGAGE-ACCT-NUM-INVALID                            00039350
           OR ((TDA-MORTGAGE-ACCT-NUM-OMITTED) AND
               (TDA-AGENCY-ID-01-02 OR OPS-03-OLD-METRO))
033230         ADD +1 TO  RTA-MORT-ACCT-NUM-INVALID.                    00039350

033230     IF  TDA-MORTGAGE-ID-NUM-INVALID                              00039350
           OR (OPS-03-NEW-METRO AND
               TDA-AGENCY-ID-00 AND
               TDA-MORTGAGE-ID-NUM-OMITTED AND
               TDA-MORTGAGE-ACCT-NUM-OMITTED)
033230         ADD +1 TO  RTA-MORT-ID-NUM-INVALID.                      00039350

033230     IF  TDA-SPECIAL-PAYIND-INVALID                               00039350
033230         ADD +1 TO  RTA-SPECIAL-PAY-IND-INVALID.                  00039350

033230     IF  TDA-DEFERRED-DATE-INVALID                                00039350
033230         ADD +1 TO  RTA-DEFERRED-PAY-DATE-INVALID.                00039350

033230     IF  OPS-03-OLD-METRO                                         00039350
033230     AND TDA-INVALID-DATE-OF-OCC                                  00039350
033230         ADD +1 TO  RTA-DOC-INVALID.                              00039350

030560     IF TDA-CYCLE-ID-ERROR AND NOT OPS-40-CYCLE-TBL07             00035750
033230         ADD +1 TO  RTA-CYCLE-ID-INVALID.                         00039350

030560     IF TDA-STAT11-TO-STAT13-Y                                    00035750
033230         ADD +1 TO  RTA-STAT11-TO-STAT13.                         00039350

030560     IF TDA-COLL-ST62-DA-OCC                                      00035750
033230         ADD +1 TO  RTA-COLL-ST62-DA-OCC                          00039350
           ELSE
030560         IF TDA-COLL-ST62-DA-DT                                   00035750
033230            ADD +1 TO  RTA-COLL-ST62-DA-DT                        00039350
               ELSE
                  IF TDA-ST62-DA-MED
                     ADD +1  TO RTA-ST62-DA-MED-CT
                  ELSE
                     IF TDA-STDA-INSUR-PD
                        ADD +1 TO RTA-STDA-INSUR-PD-CT
                     ELSE
                        IF TDA-ST62-DA-PII
                           ADD +1 TO RTA-ST62-DA-PII-CT
                        END-IF
                     END-IF
                  END-IF
               END-IF
           END-IF.

           IF  TDA-VALID-SP-COMMENTS
               AND TDA-VALID-STATUS
033880         IF  TDA-SCC-CROSS-CHECK-GROUP1                           00040040
               AND TDA-STATUS-CROSS-CHECK-GROUP1
                   ADD +1          TO  RTA-SCC-STAT-A-XERR
                   ADD +1          TO  RTA-PD-SCC-NO-PD-STAT
                   SET SCF-PD-SCC-NO-PD-STAT-Y TO TRUE
               ELSE
033880             IF  TDA-SPECIAL-COMMENT-AB-OR-AC                     00040040
                   AND TDA-STATUS-CROSS-CHECK-GROUP2
                       ADD +1      TO  RTA-SCC-STAT-B-XERR
031640             ELSE                                                 00037180
033880                 IF  TDA-SPECIAL-COMMENT-CS                       00040040
                       AND TDA-STATUS-CROSS-CHECK-GROUP3
                           ADD +1 TO  RTA-SCC-STAT-D-XERR.

034780     IF  LDA-PR-HEARING-DATE-INVALID                              00041000
034790         ADD +1          TO  RTA-PR-HEARING-DATE-ERROR.           00041010
034800                                                                  00041020
034780     IF  LDA-COLLECTOR-ID-OMIT                                    00041000
034790         ADD +1          TO  RTA-PR-COLLECTOR-ID-BLANK.           00041010
034800                                                                  00041020
           IF  TDA-TBL05-OVERLAY
           OR  TDA-DATE-OVERLAY
               ADD +1          TO  RTA-FORCED-OVERLAY.

           IF TDA-SCCDE-STDA-Y
               ADD +1 TO  RTA-SCCDE-STDA-CT.

      ******************************************************************00038560
      *      IF INVALID AND NOT REQUIRED, ADD TO COUNTER               *00038560
      ******************************************************************00038560
           IF  TDA-ORIG-CRED-NAME-INVALID-BWL                           00040040
           AND CCF-NOT-REQD-ORIG-CREDIT                                 00039330
               ADD +1      TO  RTA-INVALID-ORIG-CREDITOR.               00040050

           IF  TDA-ORIG-CRED-NAME-INVALID-OCC
           AND CCF-NOT-REQD-ORIG-CREDIT
               ADD +1      TO  RTA-CREDNM-CD-INV-CT.

      * TERMS NOT REPORTED AND AMOUNTS NOT REPORTED COUNTERS WERE
      * REQUESTED BY PAT FINNERAN FOR MARKETING RESEARCH
           IF  TDA-CCSS-ORIG-TERMS = ZEROES                             00040040
               ADD +1      TO  RTA-TERMS-NOT-RPTD.                      00040050

           IF ((TDA-AMOUNT = SPACES OR TDA-AMOUNT = ZEROES)             00040040
           AND (TDA-HI-BALANCE = SPACES OR TDA-HI-BALANCE = ZEROES)
           AND (TDA-CREDIT-LIMIT = SPACES OR TDA-CREDIT-LIMIT = ZEROES))00040040
               ADD +1      TO  RTA-AMOUNTS-NOT-RPTD.                    00040050

      ******************************************************************
      * THE FOLLOWING TOTALS ARE BASE LEVEL MISCELLANEOUS COUNTERS
      * THAT WERE ADDED FOR THE SCORECARD PROJECT.
      ******************************************************************

           IF  TDA-VALID-ACCT-TYPE
           AND (TDA-AMOUNT = SPACES OR TDA-AMOUNT = ZEROES)
               IF  TDA-TYPE-CHK-NO-AMT-INSTLL-MTG                       00040040
                   ADD +1      TO  RTA-AMT-BLNK-INSTLL-MTG              00040050
                   SET SCF-AMT-BLNK-INSTLL-MTG-Y TO TRUE
               END-IF
               IF  TDA-ACCOUNT-TYPE-LOC-OR-REV                          00040040
               AND TDA-BALANCE-AMOUNT-NUMERIC > ZERO
                   ADD +1      TO  RTA-AMT-BLNK-REV-LOC                 00040050
                   SET SCF-AMT-BLNK-REV-LOC-Y TO TRUE
               END-IF
           END-IF.

           IF  TDA-VALID-ACCT-TYPE
           AND TDA-ACCOUNT-TYPE-LOC-OR-REV
           AND NOT TDA-STATUS-DA-97
           AND (TDA-CREDIT-LIMIT-NUMERIC NOT NUMERIC                    00040040
               OR TDA-CREDIT-LIMIT = SPACES                             00040040
               OR TDA-CREDIT-LIMIT = ZEROES)                            00040040
               ADD +1      TO  RTA-CREDIT-LIMIT-INVLD                   00040050
               SET SCF-CREDIT-LIMIT-INVLD-Y TO TRUE
           END-IF.


           IF  TDA-DOC-DOFD-PURGE-GT7-Y
               ADD +1      TO  RTA-DOC-DOFD-PURGE-GT7
               SET SCF-PURGE-GT7-YR-Y TO TRUE
           END-IF.

           IF  TDA-CHARGE-OFF-AMT-ZERO-Y
               ADD +1      TO  RTA-CHARGE-OFF-AMT-ZERO
               SET SCF-CHARGE-OFF-AMT-ZERO-Y TO TRUE
           END-IF.

           IF  TDA-OPEN-WITH-NO-MPA-Y
               ADD +1      TO  RTA-OPEN-WITH-NO-MPA
               SET SCF-OPEN-WITH-NO-MPA-Y TO TRUE
           END-IF.

           IF  TDA-APD-MPA-XERR-Y
               ADD +1      TO  RTA-APD-MPA-XERR
               SET SCF-APD-MPA-XERR-Y  TO TRUE
           END-IF.

           IF  TDA-DO-GT-ACTIVITY-DATE-Y
               ADD +1      TO  RTA-DO-GT-ACTIVITY-DATE
               SET SCF-DO-GT-ACTIVITY-DATE-Y TO TRUE
           END-IF.

           IF  TDA-ST03-AT-XERR-Y
               ADD +1          TO  RTA-ST03-AT-XERR
               SET SCF-CR-CARD-LOST-AT-Y TO TRUE
           END-IF.

           IF  TDA-PAID-WO-SCC-CCC-Y
               ADD +1          TO  RTA-PAID-WO-SCC-CCC
               SET SCF-PAID-WO-SCC-CCC-Y TO TRUE
           END-IF.

           IF  TDA-OVER-RPTD-DOFD-Y
               ADD +1 TO  RTA-OVER-RPTD-DOFD
               SET SCF-OVER-RPTD-DOFD-Y TO TRUE
           END-IF.

           IF  TDA-UNDER-RPTD-DOFD-Y
               ADD +1 TO  RTA-UNDER-RPTD-DOFD
               SET SCF-UNDER-RPTD-DOFD-Y TO TRUE
           END-IF.

           IF  TDA-INVALID-DEFD-DATE-Y
               ADD +1 TO  RTA-INVALID-DEFD-DATE
               SET SCF-DFRD-DATE-INV-Y TO TRUE
           END-IF.

           IF  TDA-AMOUNT-PAST-DUE > TDA-BALANCE-AMOUNT
               ADD +1 TO  RTA-APD-GT-BALANCE
               SET SCF-APD-GT-BALANCE-Y TO TRUE
           END-IF.

           IF  TDA-PAY-RATE-STAT-XERR-Y
               ADD +1 TO  RTA-PAY-RATE-STAT-XERR
               SET SCF-PAY-RATE-STAT-XERR-Y TO TRUE
           END-IF.

           IF  TDA-PAY-RATE-STAT-DFD-XERR-Y
               ADD +1 TO  RTA-PAY-RATE-STAT-DFD-XERR
               SET SCF-PR-STAT-DFD-XERR-Y TO TRUE
           END-IF.

           IF  TDA-DO-LE-DOFD-Y
               ADD +1 TO  RTA-DO-LE-DOFD
               SET SCF-DT-OPEN-LE-DOFD-Y TO TRUE
           END-IF.

           IF  TDA-DOFD-1-TO-30-DT-OPEN-Y
               ADD +1 TO  RTA-DOFD-1-TO-30-DT-OPEN
               SET SCF-DOFD-1TO30-DT-OPEN-Y TO TRUE
           END-IF.

           IF  TDA-SCC-AU-NOT-PAID-Y
               ADD +1 TO  RTA-SCC-AU-NOT-PAID
               SET SCF-SCC-AU-NOT-PAID-Y TO TRUE
           END-IF.

           IF  TDA-PAY-HIST-NOT-RPTD-Y
               ADD +1 TO  RTA-PAY-HIST-NOT-RPTD
               SET SCF-PAY-HIST-NOT-RPTD-Y TO TRUE
           END-IF.

           IF  TDA-PAY-GRID-DOFD-XERR-Y
               ADD +1 TO  RTA-PAY-GRID-DOFD-XERR
               SET SCF-PAY-GRID-DOFD-XERR-Y TO TRUE
           END-IF.

           IF  TDA-ACTUAL-PAY-AMT-DEFAULT
               ADD +1 TO  RTA-APA-GT-MIL-DFLT-CT
           END-IF.

033240 EJECT                                                            00039360
032490******************************************************************00038560
032500 4S7100-COUNT-MISC-SEGS-TOTALS.                                   00038570
032510******************************************************************00038580
033000                                                                  00039040
033010     IF  TDA-INVALID-DATE-OF-BIRTH                                00039050
033030         ADD +1         TO  RTA-DATE-OF-BIRTH-INVALID.            00039070
033040                                                                  00039080
           IF  TDA-OMITTED-DATE-OF-BIRTH
               ADD +1         TO  RTA-DOB-OMITTED-CT.

           IF  CCF-MINOR-CONSUMER-Y
               ADD +1         TO  RTA-MINOR-CONSUMER-CT.

033210     IF  TDA-INVALID-PHONE-NUMBER                                 00039290
033220         ADD +1         TO  RTA-TELEPHONE-INVALID.                00039300

      *****
033230** METRO2 NEW MISC COUNTERS JC 07/13/98                           00039310
      *****
033440     IF  CCF-REPORTER-BLANK                                       00039560
033450         ADD +1         TO  RTA-NM-ADDR-RPTR-INVALID              00039570
033470     ELSE                                                         00039590
033440     IF  CCF-FATAL-MIA                                            00039560
033450         ADD +1         TO  RTA-NM-ADDR-FATAL-INVALID             00039570
033470     ELSE                                                         00039590
033440     IF  CCF-NON-FATAL-MIA                                        00039560
033450         ADD +1         TO  RTA-NM-ADDR-NOFATAL-INVALID.          00039570
 33470                                                                  00039590
           IF  NOT CDA-VALID-COUNTRY-CODE
               ADD +1         TO  RTA-FOREIGN-ADDRESS-CT
           END-IF.

033440     IF  CCF-MESSAGE-IN-NAME-Y                                    00039560
033450         ADD +1         TO  RTA-MESSAGE-IN-NAME                   00039570
               SET SCF-MESSAGE-IN-NAME-Y TO TRUE
           END-IF.
 33470                                                                  00039590
033440     IF  CCF-MESSAGE-IN-ADDR-SC-Y                                 00039560
033450         ADD +1         TO  RTA-MESSAGE-IN-ADDRESS                00039570
               SET SCF-MESSAGE-IN-ADDRESS-Y TO TRUE
           END-IF.
 33470                                                                  00039590
033440     IF  CDA-INVALID-ECOA-Y                                       00039560
033450         ADD +1         TO  RTA-INVALID-ECOA                      00039570
               SET SCF-INVALID-ECOA-Y TO TRUE
           END-IF.
 33470                                                                  00039590
033440     IF  CDA-ECOA-BASE-SEG-XERR-Y                                 00039560
033450         ADD +1         TO  RTA-ECOA-BASE-SEG-XERR                00039570
               SET SCF-ECOA-BASE-SEG-XERR-Y TO TRUE
           END-IF.
 33470                                                                  00039590
           IF  TDA-PAY-RATE-DOFD-INV
               ADD +1 TO  RTA-PAY-RATE-DOFD-INV
               SET SCF-PAY-RATE-DOFD-INV-Y TO TRUE
           END-IF.

033240 EJECT                                                            00039360
033250******************************************************************00039370
033260 4S8000-COUNT-CONSUMER-ERRORS.                                    00039380
033270******************************************************************00039390
033280                                                                  00039400
033320      IF  CDA-VALID-GENERATION-CODE                               00039440
033330          ADD +1         TO  RTA-GEN-CODE.                        00039450
033350                                                                  00039470
033360      IF  CDA-SSN-BASE-DUPLICATE                                  00039480
033370          ADD +1         TO  RTA-DUPLICATE-SSN-BASE.              00039490
033390                                                                  000395
033400      IF  CDA-APPEND-DUPE-SSN                                     00039520
033410          ADD +1         TO  RTA-DUPLICATE-SSN-APPEND.            00039530
033430                                                                  00039550
033440      IF  CDA-VALID-SSN                                           00039560
033450          ADD +1         TO  RTA-SSN-VALID.                       00039570
033460                                                                  00039580
033440      IF  CDA-TBL11-SSN                                           00039560
033450          ADD +1         TO  RTA-SSN-TBL11-INVALID.               00039570
033460                                                                  00039580
033440      IF  CDA-BLANK-SSN                                           00039560
                IF CCF-BASE-SEG
                AND OPS-03-NEW-METRO
033450             ADD +1         TO  RTA-SSN-BLANK-ZERO                00039570
                ELSE
                   IF CCF-J1-SEG
                      ADD +1      TO  RTA-SSN-BLANK-ZERO-J1
                   ELSE
                      IF CCF-J2-SEG
                         ADD +1   TO  RTA-SSN-BLANK-ZERO-J2
                      END-IF
                   END-IF
                END-IF
            END-IF.
033460                                                                  00039580
033480      IF  CDA-DEFAULT-SSN                                         00039600
033490          ADD +1         TO  RTA-SSN-INVALID                      00039710
033500          SET SCF-SSN-INVALID-Y TO TRUE                           00039720
            END-IF.
033510                                                                  00039730
033620 EJECT                                                            00039740
033630******************************************************************00039750
033640 4S8200-COUNT-TRADE-ERRORS.                                       00039760
033650******************************************************************00039770
033660***                                                               00039780
      * RECYCLE ERROR
033660***                                                               00039780
033670     IF  TDA-SUBCODE-ERROR                                        00039790
033060     AND CCF-BASE-SEG                                             00039330
033680         ADD +1          TO  RTA-SUBCODE-ERROR.                   00039800
033710                                                                  00039820
030560     IF TDA-CYCLE-ID-ERROR AND OPS-40-CYCLE-TBL07                 00035750
033060     AND CCF-BASE-SEG                                             00039330
033730         ADD +1          TO  RTA-CYCLE-ID-ERROR.                  00039840
033750                                                                  00039860
033660***                                                               00039780
      * DISCARD ERROR
033660***                                                               00039780
033760     IF  TDA-DATE-REPORT-ERROR                                    00039870
033060     AND CCF-BASE-SEG                                             00039330
033770         ADD +1          TO  RTA-DATE-REPORT-ERROR.               00039880
033790                                                                  00039900
033760     IF  TDA-BAL-DATE-ERROR                                       00039870
033060     AND CCF-BASE-SEG                                             00039330
033770         ADD +1          TO  RTA-INVLD-BILLING-BAL-DATE           00039880
               SET SCF-BALANCE-DATE-INV-Y TO TRUE
           END-IF.

013860     IF  TDA-DATE-OF-OCC-DISC                                     00016610
           AND TDA-STATUS-DEL-DEROG-SCORECARD
033060     AND CCF-BASE-SEG                                             00039330
               ADD +1          TO  RTA-DEROG-DOFD-INV                   00039920
               SET SCF-DEROG-DOFD-INV-Y TO TRUE
           END-IF.

013860     IF  TDA-DATE-OF-OCC-DISC
               IF  TDA-CIIS-DOFD-REQUIRED
033810             ADD +1          TO  RTA-CII-DOFD-INV
                   SET SCF-CII-DOFD-INV-Y TO TRUE
               ELSE
                   IF  CCF-BASE-SEG
                   AND (TDA-STATUS-67 OR TDA-STATUS-69)
033810                 ADD +1      TO  RTA-CII-DOFD-INV
                       SET SCF-CII-DOFD-INV-Y TO TRUE
                   END-IF
               END-IF
           END-IF.
033830
013860     IF  TDA-UNACCPT-DATE-OF-OCC
               IF  TDA-CIIS-DOFD-REQUIRED
                   ADD +1          TO  RTA-DATE-OCC-DFD-ERROR
               ELSE
                  IF  CCF-BASE-SEG
                      ADD +1          TO  RTA-DATE-OCC-DFD-ERROR
                  END-IF
               END-IF
           END-IF.

013860     IF  TDA-FUTURISTIC-DATE-OF-OCC
               IF  TDA-CIIS-DOFD-REQUIRED
                   ADD +1          TO  RTA-RQRD-FUTURISTIC-DOFD
               ELSE
                  IF  CCF-BASE-SEG
                      ADD +1          TO  RTA-RQRD-FUTURISTIC-DOFD
                  END-IF
               END-IF
           END-IF.
033830
013860     IF  TDA-OMITTED-DATE-OF-OCC
               IF  TDA-CIIS-DOFD-REQUIRED
                   ADD +1          TO  RTA-RQRD-BLANK-ZERO-DOFD
               ELSE
                  IF  CCF-BASE-SEG
                      ADD +1          TO  RTA-RQRD-BLANK-ZERO-DOFD
                  END-IF
               END-IF
           END-IF.

033760     IF  TDA-DATE-OPENED-ERROR                                    00039870
033060     AND CCF-BASE-SEG                                             00039330
033770         ADD +1          TO  RTA-DATE-OPEN-ERROR                  00039880
033070         ADD +1          TO  RTA-INVALID-OPEN-DATE                00039150
               SET SCF-INVALID-OPEN-DATE-Y TO TRUE
           END-IF.
033790                                                                  00039900
           IF  TDA-LEGALLY-OBSOLETE-DOC
               ADD +1          TO  RTA-DOC-DOFD-STAT-REJ
               IF CCF-BASE-SEG
                   ADD +1          TO  RTA-LEGALLY-OBSOLETE-DOFD
                END-IF
           END-IF.
033790                                                                  00039900
033840     IF  TDA-ACCT-NUM-ERROR                                       00039950
033060     AND CCF-BASE-SEG                                             00039330
033850         ADD +1          TO  RTA-ACCTNUM-ERROR                    00039960
               SET SCF-TRD-ACCT-NUM-ERR-Y TO TRUE
           END-IF.

033880     IF TDA-CCC-INVALID                                           00040040
033060     AND CCF-BASE-SEG                                             00039330
               ADD +1          TO  RTA-CCC-ERROR
           END-IF.

           IF  CDA-PII-FAILURE

               EVALUATE TRUE

                   WHEN CDA-PII-ALL-INV
                        ADD +1            TO  RTA-PII-NAME-REJ-CT
                                              RTA-PII-ADDRESS-REJ-CT
                                              RTA-PII-SSN-DOB-REJ-CT
                   WHEN CDA-PII-NAME-INV
                        ADD +1            TO  RTA-PII-NAME-REJ-CT
                   WHEN CDA-PII-ADDR-INV
                        ADD +1            TO  RTA-PII-ADDRESS-REJ-CT
                   WHEN CDA-PII-SSN-DOB-INV
                        ADD +1            TO  RTA-PII-SSN-DOB-REJ-CT
                   WHEN CDA-PII-NAME-ADDR-INV
                        ADD +1            TO  RTA-PII-NAME-REJ-CT
                                              RTA-PII-ADDRESS-REJ-CT
                   WHEN CDA-PII-NAME-SSN-DOB-INV
                        ADD +1            TO  RTA-PII-NAME-REJ-CT
                                              RTA-PII-SSN-DOB-REJ-CT
                   WHEN CDA-PII-ADDR-SSN-DOB-INV
                        ADD +1            TO  RTA-PII-ADDRESS-REJ-CT
                                              RTA-PII-SSN-DOB-REJ-CT
               END-EVALUATE
           END-IF.


033860* E1 AND L1 RELATED DISCARDS                                      00039970

003880     IF  TDA-NEW-ACCT-NUM-ERROR                                   00039980
033060     AND CCF-BASE-SEG                                             00039330
033890         ADD +1          TO  RTA-ACCTCHG-NUM-ERROR.               00039990
033870                                                                  00040000
033880     IF  TDA-ACCTCHG-IND-INVALID                                  00040040
033060     AND CCF-BASE-SEG                                             00039330
               ADD +1          TO  RTA-ACCTCHG-IND-ERROR.

033210     IF  TDA-L1SIN-BYPASS                                         00039290
033060     AND CCF-BASE-SEG                                             00039330
033210         ADD +1 TO  RTA-EQUATED-L1-BYPASS-SIN.                    00039290

033860*  F1/K1 ORIGINAL CREDITOR DISCARDS                               00039970

033880     IF  TDA-ORIG-CRED-NAME-INVALID-BWL                           00040040
033060     AND CCF-REQD-ORIG-CREDIT                                     00039330
033060     AND CCF-BASE-SEG                                             00039330
033890         ADD +1          TO  RTA-ORIG-CRED-NAME-ERROR             00040050
           END-IF.
033870                                                                  00040030
           IF  TDA-ORIG-CRED-NAME-INVALID-OCC
           AND CCF-REQD-ORIG-CREDIT
           AND CCF-BASE-SEG
               ADD +1          TO  RTA-CREDNM-CD-DISC-CT
           END-IF.

033880     IF  TDA-ORIG-CRED-SEG-XERR-Y                                 00040040
033060     AND CCF-BASE-SEG                                             00039330
               ADD +1          TO  RTA-ORIG-CRED-SEG-XERR.

033880     IF  TDA-ORIG-CRED-NM-XERR-Y                                  00040040
033060     AND CCF-BASE-SEG                                             00039330
               ADD +1          TO  RTA-ORIG-CRED-NM-XERR.

           IF  TDA-COLL-ST93-OCC-REJ
           AND CCF-BASE-SEG
               ADD +1          TO  RTA-COLL-ST93-OCC-REJ
           END-IF.

           IF  TDA-ST93-MED-REJ
           AND CCF-BASE-SEG
               ADD +1          TO  RTA-ST93-MED-REJ-CT
           END-IF.

033860* COLLECTION DATE DISCARDS                                        00039970

           IF  TDA-OCG-DOFD-GE-DO
           AND CCF-BASE-SEG
               ADD +1          TO  RTA-COLL-DOFD-GE-DO-ERROR.

           IF  TDA-OCG-DO-GT-DOFD-1-30
           AND CCF-BASE-SEG
               ADD +1          TO  RTA-COLL-DO-LT31-DOFD-DISC.

           IF  TDA-OCG-ACTDT-0-30-GT-DO
           AND CCF-BASE-SEG
               ADD +1          TO  RTA-COLL-DO-GT30-DOFD.

           IF  TDA-OCG-ACTDT-LT-DO
           AND CCF-BASE-SEG
               ADD +1          TO  RTA-COLL-ACTDATE-LT-DO.

033860* COLLECTION AMOUNT DISCARD                                       00039970

           IF TDA-COLL-LOAN-AMT-REJ-Y
              AND CCF-BASE-SEG
               ADD +1          TO  RTA-ORIG-LOAN-AMT-REJ.

           IF TDA-COLL-LOAN-AMT-DISC-Y
              AND CCF-BASE-SEG
               ADD +1          TO  RTA-ORIG-LOAN-MIN-DISC.

033900 EJECT                                                            00040060
033910******************************************************************00040070
033920 4S8400-COUNT-GRID-ERRORS.                                        00040080
033930******************************************************************00040090
033940                                                                  00040100
033950     IF  TDA-B2-B3-GRID-BOTH-RECD                                 00040110
033060     AND CCF-BASE-SEG                                             00039330
033960         ADD +1            TO  RTA-B2-B3-BOTH-RECD                00040120
               SET SCF-B2-B3-BOTH-RECVD-Y TO TRUE
           END-IF.
033980                                                                  00040140
033990     IF  TDA-B2-B3-GRID-MULTI-SEGS                                00040150
033060     AND CCF-BASE-SEG                                             00039330
034000         ADD +1            TO  RTA-B2-B3-MULTI-SEGS               00040160
034020         SET SCF-B2-B3-MULTI-SEGS-Y TO TRUE                       00040180
           END-IF.

034030     IF  TDA-GRID-INVALID-CODE                                    00040190
033060     AND CCF-BASE-SEG                                             00039330
034040         ADD +1            TO  RTA-GRID-INVALID-CODE              00040200
               SET SCF-B2-B3-INVALID-CODE-Y TO TRUE
           END-IF.
034060                                                                  00040220
034070     IF  TDA-GRID-NOT-ALLOWED                                     00040230
033060     AND CCF-BASE-SEG                                             00039330
034080         ADD +1            TO  RTA-GRID-NOT-ALLOWED               00040240
               SET SCF-B2-B3-NOT-ALLOWED-Y TO TRUE
           END-IF.
034090                                                                  00040250
034070     IF  TDA-B2-B3-GRID-NOT-USED                                  00040260
021620     AND CCF-BASE-SEG                                             00040270
034080         ADD +1            TO  RTA-B2-B3-NOT-USED.                00040280
034090                                                                  00040290
034100 EJECT                                                            00040300
034110******************************************************************00040310
034120 4S8600-COUNT-LEGAL-ERRORS.                                       00040320
034130******************************************************************00040330
034140***                                                               00040340
034140** RECYCLE ERROR                                                  00040340
034140***                                                               00040340
034150     IF  LDA-COURT-CODE-ERROR                                     00040350
034160         ADD +1          TO  RTA-COURT-CODE-ERROR.                00040360
034180                                                                  00040370
034220     IF  (LDA-STATUS-ERROR AND NOT LDA-STATUS-DISCARD)            00040410
034380      OR LDA-COURT-CODE-STATUS-XERR-Y                             00040420
034230         ADD +1          TO  RTA-LEGAL-STATUS-ERROR.              00040440
034240                                                                  00040450
034590     IF  LDA-COLLECTOR-ID-ERROR                                   00040810
034600         ADD +1          TO  RTA-PR-COLLECTOR-ID-ERROR.           00040820
034620                                                                  00040840
034140***                                                               00040340
034140** DISCARD ERROR                                                  00040340
034140***                                                               00040340
034190     IF  LDA-DOCKET-NUMBER-ERROR                                  00040380
034200         ADD +1          TO  RTA-DOCKET-NUM-ERROR.                00040390
034210                                                                  00040400
034250     IF  LDA-PR-FILE-DATE-ERROR                                   00040460
034260         ADD +1          TO  RTA-PR-FILE-DATE-ERROR.              00040470
034270                                                                  00040480
           IF  LDA-STATUS-ERROR
               AND LDA-STATUS-DISCARD
               ADD +1          TO  RTA-LEGAL-STATUS-DISCARD.

034280     IF  LDA-PR-STATUS-DATE-ERROR                                 00040490
034290         ADD +1          TO  RTA-PR-STATUS-DATE-ERROR.            00040500
034300                                                                  00040510
034310     IF  LDA-PLAINTIFF-NAME-ERROR                                 00040520
034320         ADD +1          TO  RTA-PLAINTIFF-NAME-ERROR.            00040530
034330                                                                  00040540
034430     IF  LDA-BANKRUPTCY                                           00040630
034440     AND LDA-CCSS-DOCKET-ERROR                                    00040640
034450         ADD +1          TO  RTA-BK-DOCKET-ID-ERROR.              00040650
034470                                                                  00040670
034480     IF  LDA-CIVIL-ACTION AND                                     00040680
034490     NOT (LDA-VALID-CCSS-DOCKET OR LDA-VALID-BOOK-PAGE-SEQ)       00040700
034500         ADD +1          TO  RTA-CV-DOCKET-BP-ERROR.              00040710
034520                                                                  00040730
034530     IF  LDA-LIEN AND                                             00040740
034540     NOT (LDA-VALID-CERTIFICATE OR LDA-VALID-BOOK-PAGE-SEQ)       00040760
034550         ADD +1          TO  RTA-LN-CERTIFICATE-ID-ERROR.         00040770
034580                                                                  00040800
034630     IF  LDA-CIVIL-AMOUNT-ERROR                                   00040850
034640     OR  LDA-LIEN-AMOUNT-ERROR                                    00040860
034650         ADD +1          TO  RTA-AMOUNT-ERROR.                    00040870
034670                                                                  00040890
034680     IF  LDA-ADJUST-PERCENT-ERROR                                 00040900
034690     AND NOT LDA-CHAPTER-THIRTEEN                                 00040910
034700         ADD +1          TO  RTA-ADJUST-PERCENT-ERROR.            00040920
034720                                                                  00040940
034730     IF  LDA-REPAY-PERCENT-ERROR                                  00040950
034740     AND NOT LDA-CHAPTER-THIRTEEN                                 00040960
034750         ADD +1          TO  RTA-REPAY-PERCENT-ERROR.             00040970
034770                                                                  00040990
034830     IF  I20-CCSS-NAME-ADDRESS-DISCARD                            00041040
034850         ADD +1          TO                                       00041070
034860                         RTA-INSUFF-NAME-ADDR-DATA.               00041080
019220                                                                  00041090
019200     IF  LDA-VOLUNTARY-IND-ERROR                                  00041100
034260         ADD +1          TO  RTA-VOLUNTARY-IND-ERROR.             00041110
034870 EJECT                                                            00041120
034880******************************************************************00041130
034890 4X0100-CHECK-ERROR-COUNT.                                        00041140
034900******************************************************************00041150
034910                                                                  00041160
034920     MOVE ZERO                   TO  A01-INTERVAL-COUNT.          00041170
034930                                                                  00041180
034940     IF  IOT-IN-TOTAL  >  ZERO                                    00041190
034950         COMPUTE A01-ERROR-PERCENTAGE =                           00041200
034960             (IOT-OUT-DISCARD * C01-ONE-HUNDRED)  /  IOT-IN-TOTAL 00041210
034970     ELSE                                                         00041220
034980         MOVE ZERO               TO  A01-ERROR-PERCENTAGE.        00041230
034990                                                                  00041240
035020     IF  A01-ERROR-PERCENTAGE    >   OPS-05-PERCENT-LIMIT         00041270
035030         PERFORM 4X0200-ERROR-COUNT-EXCEEDED.                     00041280
035040 EJECT                                                            00041290
035050******************************************************************00041300
035060 4X0200-ERROR-COUNT-EXCEEDED.                                     00041310
035070******************************************************************00041320
035080                                                                  00041330
035090      MOVE ERC-YES              TO  CCF-ABEND-FLAG.               00041340
035100      MOVE ERC-ABEND-EXCESSIVE-ERRORS                             00041350
035110                                TO CCF-USER-ABEND-CODE.           00041360
035120      MOVE C02-SUBROUTINE-NAME  TO CCF-SUBROUTINE-WHICH-SET-ABEND.00041370
035130      MOVE C02-PARAGRAPH-4X0200 TO CCF-PARAGRAPH-WHICH-SET-ABEND. 00041380
035140                                                                  00041390
035150      DISPLAY C02-EXCESSIVE-ERRORS UPON SYSOUT.                   00041400
035160      DISPLAY 'INPUT RECORD COUNT     =   '  IOT-IN-TOTAL.        00041410
035170      DISPLAY 'DISCARD RECORD COUNT   =   '  IOT-OUT-DISCARD.     00041420
035180      DISPLAY 'ERROR PERCENTAGE       =   '  A01-ERROR-PERCENTAGE.00041430
035190 EJECT                                                            00041440
035200******************************************************************00041450
035210 8N0100-CHECK-NAME-ADDR-ERRORS.                                   00041460
035220******************************************************************00041470
035230                                                                  00041480
           SET I20-CCSS-NAME-ADDRESS-VALID       TO TRUE.               00041790
           IF CCF-MESSAGE-IN-ADDRESS                                    00041800
035440        SET I20-CCSS-NAME-ADDRESS-DISCARD  TO TRUE                00041810
035450     ELSE                                                         00041820
035450        MOVE CDA-CONSUMER-NAME             TO M07-CONSUMER-NAME   00041830
035460        INSPECT M07-CONSUMER-NAME REPLACING ALL SPACES BY ZEROS   00041840
035470        IF (CDA-CONSUMER-NAME = SPACES)                           00041850
035480        OR (M07-CONSUMER-NAME IS NUMERIC)                         00041860
035490        OR (CDA-FIRST-ADDRESS-LINE       =  ZEROES OR SPACES)     00041870
035500        OR ((CDA-SECOND-ADDRESS-LINE     =  ZEROES OR SPACES)     00041880
035510           AND (NOT CDA-VALID-ZIP-CODE))                          00041890
                 SET I20-CCSS-NAME-ADDRESS-DISCARD      TO TRUE.
035520 EJECT                                                            00041900
035530******************************************************************00041910
035540 8W0050-SUBCODE-DATA-MANAGER.                                     00041920
035550******************************************************************00041930
035560*----------------------------------------------------------------*00041940
035570*                                                                 00041950
035580* IF THE USER ABEND IS IN EFFECT, WE DON'T CARE ABOUT SUBCODE     00041960
035590* TOTALS ANY MORE - THE TOTALS FOR THE LAST SUBCODE COULD BE      00041970
035600* INCOMPLETE OR CORRUPTED IN WHICH CASE THEY SHOULD NOT BE        00041980
035610* STORED.  BESIDES, THE CCSS REPORTS WILL NOT BE OUTPUT IN THIS   00041990
035620* CASE.                                                           00042000
035630*                                                                 00042010
035640* IF ITS END OF FILE ON INPUT, WE TELL THE MANAGER TO SKIP THE    00042020
035650* RETRIEVAL FOR A NEW SUBCODE BECAUSE WE ONLY WANT TO STORE THE   00042030
035660* DATA FOR THE LAST SUBCODE - MUCH LIKE EOF PROCESSING FOR A      00042040
035670* FILE.                                                           00042050
035680*                                                                 00042060
035690* IF ITS NOT END OF FILE, WE WANT THE MANAGER TO STORE THE DATA   00042070
035700* FOR THE PREVIOUS SUBCODE, AND RETRIEVE/SETUP FOR THE NEW        00042080
035710* SUBCODE.                                                        00042090
035720*----------------------------------------------------------------*00042100
035730                                                                  00042110
035740     IF CCF-ABEND                                                 00042120
035750         CONTINUE                                                 00042130
035760     ELSE                                                         00042140
035770         MOVE M99-SUBCODE-AND-FLAG TO SBX-NEW-SUBCODE-AND-FLAG    00042150
035780         PERFORM 8W0075-CALL-SUBC-DATA-MGR                        00042160
035790     END-IF.                                                      00042170
035800                                                                  00042180
035810 EJECT                                                            00042190
035820******************************************************************00042200
035830 8W0075-CALL-SUBC-DATA-MGR.                                       00042210
035840******************************************************************00042220
035850                                                                  00042230
035860     CALL 'CCLC200'           USING CCF-COMMON-CONTROL-FLAGS,     00042240
035870                                    RTA-LA351-SUBCODE-REC,        00042250
035880                                    SBX-SUBCODE-INDEX-TABLE-REC.  00042260
035890 EJECT                                                            00042270
036170******************************************************************00042550
036180 8W0600-CALL-OUTPUT-DISCARD.                                      00042560
036190******************************************************************00042570
036200                                                                  00042580
036210     CALL 'CCLC660'                                               00042590
036220                          USING  CCF-COMMON-CONTROL-FLAGS         00042600
036230                                 CDA-CONSUMER-DATA-AREA           00042610
036240                                 CRF-COMMON-RECORD-FORMAT         00042620
036250                                 OPS-CONTROL-OPTIONS              00042630
                                       TDA-TRADE-DATA-AREA.
036290 EJECT                                                            00042670
036300******************************************************************00042680
036310 8W0700-CALL-OUTPUT-RECYCLE.                                      00042690
036320******************************************************************00042700
036330                                                                  00042710
036340     CALL 'CCLC670'       USING  CCF-COMMON-CONTROL-FLAGS         00042720
                                       CDA-CONSUMER-DATA-AREA
036350                                 CRF-COMMON-RECORD-FORMAT         00042730
036350                                 LDA-LEGAL-DATA-AREA              00042730
036360                                 OPS-CONTROL-OPTIONS              00042740
036490                                 TDA-TRADE-DATA-AREA.             00042750
036410 EJECT                                                            00042800
036300******************************************************************00042680
036310 8W0800-CALL-OUTPUT-SCORECARD.                                    00042690
036320******************************************************************00042700
036330                                                                  00042710
036340     CALL 'CCLC680'       USING  CCF-COMMON-CONTROL-FLAGS         00042720
                                       CDA-CONSUMER-DATA-AREA
                                       IOT-INPUT-OUTPUT-TOTALS
                                       OPS-CONTROL-OPTIONS
                                       SCF-SCORECARD-FLAGS
036490                                 TDA-TRADE-DATA-AREA              00042750
                                       CCSS-REPORTER-CONSUMER
                                       CCSS-REPORTER-KEY-CHANGE
                                       CCSS-REPORTER-TRADE-BASE-INDS
                                       CCSS-REPORTER-TRADE-BASE
038330                                 CCSS-REPORTER-TRADE-KEY-INDS     00044730
038340                                 CCSS-REPORTER-TRADE-KEY.         00044740
036410 EJECT                                                            00042800
036590******************************************************************00042980
036600 8W0825-OUTPUT-CCSS.                                              00042990
036610******************************************************************00043000
036620*----------------------------------------------------------------*00043010
036630* 12/17/94 PR41002C THE EXTERNAL DUAL OPS SW PROCESS BYPASS       00043020
036640* DESCRIBED BELOW IS NOW BEING REMOVED; SUPPRESSING CCSS DATA     00043030
036650* AND REPORTS OUTPUT WILL BE GOVERNED BY SYMBOLICALLY DUMMYING    00043040
036660* OUT THE APPROPRIATE FILES IN THE JCL IF THE DUAL OPS SWITCH     00043050
036670* IS SET TO SUPPRESS CCSS OUTPUTS.  THREE REASONS FOR THIS:       00043060
036680*                                                                 00043070
036690* 1. EFFICIENCY GAINS ARE PARTIALLY LOST ANYWAY; WE NOW NEED      00043080
036700*    TO CALL CCSS DATA OUTPUT MODULES CCLC640 & C645 TO           00043090
036710*    POPULATE FIELDS FOR THE NEW SAMPLE REPORTS EVEN IF THE       00043100
036720*    TRANSACTION IS NOT GOING TO UPDATE.                          00043110
036730*                                                                 00043120
036740* 2.  DMS IS EXPECTED TO PRODUCE ALL CCSS OUTPUTS VERY SOON,      00043130
036750*     AND LEAVE THE OPTION ON FOR A LONG TIME.                    00043140
036760*                                                                 00043150
036770* 3. EXISTING INTERNAL FLAGS MUST BE INTERROGATED TO SUPPRESS     00043160
036780*    THE WRITE, AND RELATED PROCESS IN CCLC640 AND CCLC645        00043170
036790*    WHEN THE TRANSACTION IS NOT SUPPOSED TO GO TO UPDATE.        00043180
036800*    THIS PROCESS IS CLEANER WITHOUT HAVING THE EXTERNAL          00043190
036810*    DUAL OPS SWITCH DRIVE THE PROCESS - COMPLICATES THE          00043200
036820*    LOGIC.                                                       00043210
036830*                                                                 00043220
036840* IF THE USER WANTS TO SUPPRESS DUAL OPERATIONS FILE OUTPUT,      00043230
036850* DON'T CALL THE CCSS OUTPUT MODULES; BUT ENSURE THAT THE FLAG    00043240
036860* IS SET TO INCREMENT THE UPDATE COUNT FOR THE CCSS REPORTS AND   00043250
036870* NEW AHA RECORD.  TRADE OUTPUT MAY OR MAY NOT WRITE A RECORD     00043260
036880* WHEN CALLED SO THIS PROGRAM HAS TO BE CALLED TO SET THE FLAG    00043270
036890* IF A RECORD WOULD GET WRITTEN ON THAT CALL - UNLESS ITS END     00043280
036900* OF FILE, IN WHICH CASE IT WOULD DEFINITELY WRITE THE LAST       00043290
036910* RECORD.  IF DUAL OPS IS OFF AND TRADE OUTPUT IS CALLED,         00043300
036920* IT WILL BYPASS ALL PROCESSING EXCEPT WHAT IS NEEDED TO          00043310
036930* DETERMINE WHETHER A RECORD WOULD BE WRITTEN OR NOT.             00043320
036940*                                                                 00043330
036950* IF EOF AND DUAL OPS IS OFF, BOTH OUTPUT MODULES WOULD HAVE      00043340
036960* THEIR FIRST TIME FLAGS STILL ON BECAUSE THEY WERE NEVER         00043350
036970* RESET.  THIS WILL FORCE THE LEGAL AND TRADE MODULES TO OPEN     00043360
036980* AND CLOSE THEIR OUTPUT FILES, AND DISABLE THEIR OTHER           00043370
036990* PROCESSING.  THIS IS NECESSARY TO PREVENT SUBSEQUENT IDCAMS     00043380
037000* STEPS THAT CHECK IF THEY HAVE DATA FROM ABENDING WITH           00043390
037010* CODE S002.                                                      00043400
037020*                                                                 00043410
037030* ON THE OTHER HAND, IF EOF AND DUAL OPS IS ON, ONE OF THE        00043420
037040* OUTPUT MODULES WILL OPEN AND CLOSE ITS FILE; THE OTHER          00043430
037050* WILL DO LAST TIME PROCESSING, AND THEN CLOSE ITS FILE -         00043440
037060* DEPENDING ON WHETHER WE ARE PROCESSING LEGAL OR TRADE DATA.     00043450
037070*----------------------------------------------------------------*00043460
037080                                                                  00043470
037090     IF CCF-EOF-REPORTER-DATA                                     00043480
037100     OR CCF-ABEND                                                 00043490
037110         PERFORM 8W0VAL-CALL-OUTPUT-TRADE                         00043500
037110         PERFORM 8W0850-CALL-OUTPUT-TRADE                         00043500
037120         PERFORM 8W0875-CALL-OUTPUT-LEGAL                         00043510
037130     ELSE                                                         00043520
037140         IF OPS-04-BALANCE-REPORTER                               00043530
037160             PERFORM 8W0VAL-CALL-OUTPUT-TRADE                     00043550
037160             PERFORM 8W0850-CALL-OUTPUT-TRADE                     00043550
037170         ELSE                                                     00043560
037180             PERFORM 8W0875-CALL-OUTPUT-LEGAL                     00043570
037190         END-IF                                                   00043580
037200     END-IF.                                                      00043590
037600 EJECT                                                            00043990
037610******************************************************************00044000
037620 8W0VAL-CALL-OUTPUT-TRADE.                                        00044010
037630******************************************************************00044020
037640                                                                  00044030
037650     CALL 'CCLCVTRK'     USING  CCF-COMMON-CONTROL-FLAGS          00044040
037660                                CRF-COMMON-RECORD-FORMAT          00044050
037670                                CDA-CONSUMER-DATA-AREA            00044060
037690                                OPS-CONTROL-OPTIONS               00044080
037700                                TDA-TRADE-DATA-AREA.              00044090
037610******************************************************************00044000
037620 8W0850-CALL-OUTPUT-TRADE.                                        00044010
037630******************************************************************00044020
037640                                                                  00044030
037650     CALL 'CCLC640'      USING  CCF-COMMON-CONTROL-FLAGS          00044040
037660                                CRF-COMMON-RECORD-FORMAT          00044050
037670                                CDA-CONSUMER-DATA-AREA            00044060
037690                                OPS-CONTROL-OPTIONS               00044080
037700                                TDA-TRADE-DATA-AREA               00044090
037710                                TB10-ZIP-CODE-RANGES              00044100
037730                                COA-SEG-TOTALS-EXCEPTION-AREA     00044130
037740                                CCSS-REPORTER-BATCH-HEADER        00044140
037750                                CCSS-REPORTER-CONSUMER            00044150
                                      CCSS-REPORTER-EMPLOYMENT-DATA
037760                                CCSS-REPORTER-KEY-CHANGE          00044160
037770                                CCSS-REPORTER-TRADE-BASE-INDS     00044170
037780                                CCSS-REPORTER-TRADE-BASE          00044180
037790                                CCSS-REPORTER-TRADE-KEY-INDS      00044190
037800                                CCSS-REPORTER-TRADE-KEY.          00044200
037810 EJECT                                                            00044210
037820******************************************************************00044220
037830 8W0875-CALL-OUTPUT-LEGAL.                                        00044230
037840******************************************************************00044240
037850                                                                  00044250
037860     CALL 'CCLC645'      USING  CCF-COMMON-CONTROL-FLAGS          00044260
037870                                CRF-COMMON-RECORD-FORMAT          00044270
037880                                CDA-CONSUMER-DATA-AREA            00044280
037900                                LDA-LEGAL-DATA-AREA               00044300
037910                                OPS-CONTROL-OPTIONS               00044310
037920                                CCSS-PUBLIC-BANKRUPTCY-AREA       00044320
037930                                CCSS-PUBLIC-CIVIL-ACTION-AREA     00044330
037950                                CCSS-PUBLIC-LIEN-AREA             00044350
037960                                CCSS-PUB-PLAINTIFF                00044360
037970                                CCSS-PUB-TRANS-HDR                00044370
037980                                CCSS-REPORTER-CONSUMER.           00044380
037990 EJECT                                                            00044390
038130******************************************************************00044530
038140 8W0925-CALL-CCSS-SAMPLE-RPTS.                                    00044540
038150******************************************************************00044550
038160                                                                  00044560
038170     CALL 'CCLC695'       USING  CCF-COMMON-CONTROL-FLAGS         00044570
038180                                 CDA-CONSUMER-DATA-AREA           00044580
038190                                 CRF-COMMON-RECORD-FORMAT         00044590
038200                                 IOT-INPUT-OUTPUT-TOTALS          00044600
038210                                 LDA-LEGAL-DATA-AREA              00044610
038220                                 OPS-CONTROL-OPTIONS              00044620
038240                                 SBX-SUBCODE-INDEX-TABLE-REC      00044640
038270                                 TDA-TRADE-DATA-AREA              00044670
038280                                 CCSS-REPORTER-BATCH-HEADER       00044680
038290                                 CCSS-REPORTER-CONSUMER           00044690
                                       CCSS-REPORTER-EMPLOYMENT-DATA
038300                                 CCSS-REPORTER-KEY-CHANGE         00044700
038310                                 CCSS-REPORTER-TRADE-BASE-INDS    00044710
038320                                 CCSS-REPORTER-TRADE-BASE         00044720
038330                                 CCSS-REPORTER-TRADE-KEY-INDS     00044730
038340                                 CCSS-REPORTER-TRADE-KEY          00044740
038350                                 CCSS-PUBLIC-BANKRUPTCY-AREA      00044750
038360                                 CCSS-PUBLIC-CIVIL-ACTION-AREA    00044760
038380                                 CCSS-PUBLIC-LIEN-AREA            00044780
038390                                 CCSS-PUB-PLAINTIFF               00044790
038400                                 CCSS-PUB-TRANS-HDR.              00044800
038410 EJECT                                                            00044810
038420******************************************************************00044820
038430 8W0950-CALL-OVERFLOW-REPORT.                                     00044830
038440******************************************************************00044840
038450*----------------------------------------------------------------*00044850
038460* IF THE USER WANTS TO SUPPRESS DUAL OPERATIONS OUTPUT; DON'T     00044860
038470* CALL THE CCSS CONSUMER OVERFLOW REPORTING MODULE.  THIS         00044870
038480* REPORT IS GENERATED ONLY IF DETAIL INFO WAS PRODUCED            00044880
038490* BY THE CCSS TRADE OUTPUT MODULE.  IN THIS CASE, THERE WAS       00044890
038500* NONE BECAUSE THAT MODULE WAS ALSO NEVER CALLED.                 00044900
038510*----------------------------------------------------------------*00044910
038520     CALL 'CCLC700' USING CCF-COMMON-CONTROL-FLAGS,               00044920
038530                          COA-SEG-TOTALS-EXCEPTION-AREA.          00044930
038540 EJECT                                                            00044940
038550******************************************************************00044950
038560 8X0100-SAVE-SEARCH-VARIABLES.                                    00044960
038570******************************************************************00044970
038580                                                                  00044980
038590***  THIS IS DONE AS THE LAST THING BEFORE EXITING THE PROGRAM.   00044990
038600***  THIS WILL 'SAVE' THE INDEX SETTINGS AT THEIR PREVIOUS VALUES 00045000
038610***  SO THAT WHEN THE PROGRAM IS INVOKED AGAIN, WE CAN START OUR  00045010
038620***  SEARCH FOR TABLED ITEMS AT THE SAME PLACE WE LEFT OFF AT.    00045020
038630***  THIS SHOULD REDUCE THE NUMBER OF SEARCHES SIGNIFICANTLY.     00045030
038640                                                                  00045040
038650     SET S01-PREV-RTA2               TO  RTA-I2.                  00045050
038670     SET S01-PREV-RTA3               TO  RTA-I3.                  00045070
038710     SET S01-PREV-RTA5               TO  RTA-I5.                  00045110
038730     SET S01-PREV-RTA6               TO  RTA-I6.                  00045130
038750     SET S01-PREV-RTA7               TO  RTA-I7.                  00045150
038770     SET S01-PREV-RTA8               TO  RTA-I8.                  00045170
038770     SET S01-PREV-RTA9               TO  RTA-I9.                  00045170
038810     SET S01-PREV-RTAA               TO  RTA-IA.                  00045210
038830     SET S01-PREV-RTAB               TO  RTA-IB.                  00045230
038850     SET S01-PREV-RTAD               TO  RTA-ID.                  00045250
038850     SET S01-PREV-RTAE               TO  RTA-IE.                  00045250
038850     SET S01-PREV-RTAF               TO  RTA-IF.                  00045250
038850     SET S01-PREV-RTAG               TO  RTA-IG.                  00045250
038850     SET S01-PREV-RTAH               TO  RTA-IH.                  00045250
038850     SET S01-PREV-RTAI               TO  RTA-II.                  00045250
038850     SET S01-PREV-RTAJ               TO  RTA-IJ.                  00045250
038850     SET S01-PREV-RTAK               TO  RTA-IK.                  00045250
038850     SET S01-PREV-RTAL               TO  RTA-IL.                  00045250
038850     SET S01-PREV-RTAM               TO  RTA-IM.                  00045250
038850     SET S01-PREV-RTAN               TO  RTA-IN.                  00045250
038850     SET S01-PREV-RTAO               TO  RTA-IO.                  00045250
038850     SET S01-PREV-RTAP               TO  RTA-IP.                  00045250
038860 EJECT                                                            00045260
038870******************************************************************00045270
038880***      E N D     OF    P R O G R A M    C C L B 6 0 0           00045280
038890******************************************************************00045290
