000010 PROCESS RENT                                                     00010001
000020 IDENTIFICATION DIVISION.                                         00020001
000030 PROGRAM-ID.    CCLC640.                                          00030001
000040 AUTHOR.        JACQUES STERN.                                    00040001
000050 DATE-WRITTEN.  08-12-93.                                         00050001
000060 DATE-COMPILED.                                                   00060001
000070*================================================================*00070001
000080*=                      FUNCTION BOX                            =*00080001
000090*=--------------------------------------------------------------=*00090001
000100*= DESCBOX CLOGBOX IOBOX LINKBOX COPYBOX CODEBOX TECHBOX        =*00100001
000110*=--------------------------------------------------------------=*00110001
000120*= DESCBOX |         DESCRIPTION BOX                  | DESCBOX =*00120001
000130*================================================================*00130001
000140*= PGM ID   : CCLC640   TYPE : COBOL/370     SYS ID : MVS/XA    =*00140001
000150*= VERSION  : 01.00     DIAG : ________        DATE : 09/28/93  =*00150001
000160*= SYSTEM   : CCLA  DATA ACQUISITION.                           =*00160001
000170*= FUNCTION : BUILD AND OUTPUT CCSS UPDATE REPORTER DATA        =*00170001
000180*=------------------------ NARRATIVE ---------------------------=*00180001
000190*=                                                              =*00190001
000200*=            ===============================                   =*00200001
000210*=            =  SUMMARY FUNCTION STATEMENT =                   =*00210001
000220*=            ===============================                   =*00220001
000230*=                                                              =*00230001
000240*= THE PRIMARY FUNCTION OF THIS PROGRAM IS TO FORMAT AND WRITE  =*00240001
000250*= UPDATE DATA TO A NEW FILE THAT WILL BE USED AS INPUT BY      =*00250001
000260*= THE CCSS UPDATE SYSTEM.  EACH RECORD THAT GOES TO FILE       =*00260002
000300*= REPRESENTS A TRADE TRANSACTION THAT CAN INLUDE MULTIPLE      =*00300001
000310*= CONSUMERS (PRESENTLY 1 TO 100 INCLUDING THE BASE).           =*00310001
000320*=                                                              =*00320001
000330*= AS A SECONDARY FUNCTION, THIS PROGRAM MAINTAINS COUNTS FOR:  =*00330001
000340*=                                                              =*00340001
000350*=    A) THE HIGHEST COUNT OF CONSUMERS PER TRANSACTION FOR     =*00350001
000360*=       THE ENTIRE RUN.                                        =*00360001
000370*=    B) A CONSUMER COUNT FOR EACH TRANSACTION WHERE THAT       =*00370001
000380*=       COUNT EXCEEDED THE PRESET LIMIT OF 100.                =*00380001
000390*=    C) A COUNT OF TRANSACTIONS WHERE THE AFORE-MENTIONED      =*00390001
000400*=       CONSUMER COUNT OVERFLOW WAS DETECTED.                  =*00400001
000410*=                                                              =*00410001
000420*= WHEN THE OVERFLOW OCCURS, SUBCODE, ACCOUNT NUMBER AND BASE   =*00420001
000430*= CONSUMER NAME, ALONG WITH THE TOTAL COUNT IN B) ABOVE,       =*00430001
000440*= ARE PASSED TO THE CALLING PROGRAM FOR POSSIBLE EXCEPTION     =*00440001
000450*= REPORTING.  AFTER END OF INPUT FILE PROCESSING, THE TOTAL    =*00450001
000460*= COUNTS DESCRIBED IN A) AND C) ABOVE ARE PASSED TO THE        =*00460001
000470*= CALLING PROGRAM FOR POSSIBLE EXCEPTION REPORTING.            =*00470002
000480*=                                                              =*00480001
000490*=             ===============================                  =*00490001
000500*=             =  FILE OUTPUT CONSIDERATIONS =                  =*00500001
000510*=             ===============================                  =*00510001
000520*=                                                              =*00520001
000530*= THIS PROGRAM EXPECTS TO RECEIVE THE INPUT DATA IN THE        =*00530001
000540*= CCLACRF, CCLACCF, CCLACDA, CCLATDA, CCLATB10, CCLAOPS        =*00540001
000550*= GROUPED BY TRADE KEY WHERE APPLICABLE.  THE FIRST            =*00550001
000560*= CALL FOR A TRADE KEY GROUP WILL INCLUDE TRADE BASE           =*00560001
000570*= INFORMATION, AS WELL AS INFORMATION FOR THE FIRST CONSUMER   =*00570001
000580*= WITHIN THE GROUP.  EACH CALL MAY INCLUDE OPTIONAL TRADE      =*00580001
000590*= CHANGE INFORMATION (AND POSSIBLY H1 - EMPLOYMENT - LATER).   =*00590001
000600*= DATA FOR ONE CONSUMER SEGMENT WILL BE RECEIVED AND           =*00600001
000610*= PROCESSED PER CALL PRIOR TO END OF INPUT FILE.  A MAXIMUM OF =*00610001
000620*= 100 CONSUMER SEGMENTS WILL BE HANDLED FOR EACH TRADE KEY     =*00620001
000630*= GROUP.  SINCE IT WILL TAKE A VARIABLE NUMBER OF CALLS TO     =*00630001
000640*= BUILD ONE CCSS TRADE KEY RECORD, THIS PROGRAM WILL WRITE     =*00640001
000650*= THE RECORD TO THE CCSS FILE WHEN A CHANGE IN TRADE KEY IS    =*00650001
000660*= SENSED, THEN RE-INITIALIZE AND POPULATE DATA FOR THE NEXT    =*00660001
000670*= RECORD.                                                      =*00670001
000680*=                                                              =*00680001
000690*=     ================================================         =*00690001
000700*=     = VARIABLE LENGTH OUTPUT RECORD CONSIDERATIONS =         =*00700001
000710*=     ================================================         =*00710001
000720*=                                                              =*00720001
000730*= THE RDW VALUE MUST REFLECT THE AGGREGATE LENGTH OF ALL       =*00730001
000740*= FIXED LENGTH SEGMENTS ACTUALLY LOADED INTO THE OUTPUT AREA,  =*00740001
000750*= PLUS FOUR BYTES FOR ITSELF.   THE SEGMENTS MUST BE LOADED    =*00750001
000760*= BACK TO BACK WITH NO INTERMITTENT GAPS INTO THE OUTPUT       =*00760001
000770*= RECORD AREA.                                                 =*00770001
000780*=                                                              =*00780001
000790*= EACH SEGMENT BEGINS WITH A FIXED LENGTH ID AREA CONTAINING   =*00790001
000800*= LENGTH OF THE SEGMENT, A 4 BYTE SEGMENT IDENTIFIER, AND A    =*00800001
000810*= VERSION NUMBER.                                              =*00810001
000820*=                                                              =*00820001
000830*= AN END SEGMENT TERMINATES EACH RECORD.  IT CONTAINS A        =*00830001
000840*= COUNT OF THE TOTAL NUMBER OF SEGMENTS ON THE RECORD,         =*00840001
000850*= INCLUDING ITSELF.                                            =*00850001
000860*=                                                              =*00860001
000870*= THE SEGMENT ID LENGTH INDICATOR VALUES, THE TOTAL RECORD     =*00870001
000880*= LENGTH FOR THE RDW, AND THE BASE RELATIVE LOAD OF THE        =*00880001
000890*= SEGMENTS INTO THE OUTPUT AREA SHOULD ADJUST AUTOMATICALLY    =*00890001
000900*= BASED ON THE ACTUAL LENGTH OF KEY GROUP ITEMS IN THE CCSS    =*00900001
000910*= SEGMENT DEFINITION COPYMEMBERS.  THIS IS ACCOMPLISHED        =*00910001
000920*= PRIMARILY BY USING THE "LENGTH OF" SPECIAL REGISTER.         =*00920001
000930*= IN OTHER WORDS, RECOMPILING THE PROGRAM ONLY BECAUSE         =*00930001
000940*= THESE COPYMEMBERS WERE MODIFIED SHOULD NECESSITATE NO        =*00940001
000950*= CODING CHANGES FOR THE SAKE OF THE PROCESSES THAT LOAD THE   =*00950001
000960*= SEGMENTS INTO THE OUTPUT AREA AS LONG AS THE KEY             =*00960001
000970*= GROUP ITEMS WERE NOT CHANGED.  ALSO, UPDATING THE INITIAL    =*00970001
000980*= VALUE CLAUSE SETTINGS FOR THE SEGMENT LENGTH INDICATORS      =*00980001
000990*= IS, FOR ALL PRACTICAL PURPOSES, A DOCUMENTATION CHANGE       =*00990001
001000*= ONLY.                                                        =*01000001
001010*=                                                              =*01010001
001020*================================================================*01020001
001030*= CLOGBOX |                CHANGE LOG                | CLOGBOX =*01030001
001040*================================================================*01040001
      *= LA351              DATE : 04/17/20   PGM'R : NAOKO GORSUCH   =*
      *= PR   : DAT-2789                      RQST'R: PAT FINNERAN    =*
      *= DESC: MODIFY LOGIC TO FLAG ZERO SCHEDULED PAYMENT AMOUNT AS  =*
      *=       VALID WHEN REPORTED WITH THE ZERO BALANCE AMOUNT FOR   =*
      *=       STATUS ALLOWED TO HAVE SCHEDULED PAYMENT AMOUNT.       =*
      *================================================================*
      *= LA351              DATE : 03/30/18   PGM'R : NAOKO GORSUCH   =*
      *= PR   : 60539                         RQST'R: MELINDA HOWLAND =*
      *= DESC: ADD NEW COUNTER FOR ACTUAL PAYMENT AMOUNTS THAT WERE   =*
      *=       CHANGED TO DEFAULT IF OVER 1 MILLION AND IF IT IS 10%  =*
      *=       OR GREATER THAN ORIGINAL LOAN AMOUNT OR CREDIT LIMIT   =*
      *================================================================*
      *= LA351                DATE: 09/15/17   PGM'R : BARBARA YUSKO  =*
      *= PR: 58355                             RQST'R: PAT FINNERAN   =*
      *= DESC    : REMOVE REFERECE TO OPS07 D1 PROCESSING.  SET DOB   =*
      *=           FLAG TO M FOR A MINOR, G FOR OPS20_5 SET TO 3 OR 4 =*
      *================================================================*
      *= LA351                DATE: 04/14/17   PGM'R : BARBARA YUSKO  =*
      *= ICP: 58359                            RQST'R: DATA MANAGEMENT=*
      *= DESC    : CHANGE TO LOADING OF TBL10 DATA DUE TO ELIMINATION =*
      *=           OF FIELDS IN COPYBOOK CCLATB10                     =*
      *================================================================*
      *= LA351                DATE: 04/17/17   PGM'R: BARBARA YUSKO   =*
      *= ICP: 57453                            RQST'R: DENNIS TOBIN   =*
      *= DESC    : ADJUST CODE FOR ORIGINAL LOAN AMOUNT FLAG SETTINGS =*
      *================================================================*
      *= LA351                DATE: 02/03/17   PGM'R : BARBARA YUSKO  =*
      *= ICP: 56501                            RQST'R: DATA MANAGEMENT=*
      *= DESC    : CHANGE HOW ORIGINAL CREDITOR INDICATOR IS SET BASED=*
      *=           ON NEW VALUES DEFINED IN CCLATDA COPYBOOK          =*
      *================================================================*
      *= LA351                DATE: 11/04/16   PGM'R: BARBARA YUSKO   =*
      *= ICP: 57585                            RQST'R: PAT FINNERAN   =*
      *= DESC    : REMOVE CODE RELATED TO TRAN TYPE PROCESSING        =*
      *================================================================*
      *= LA351                DATE: 09/09/16   PGM'R: BARBARA YUSKO   =*
      *= ICP: 52684                            RQST'R: PAT FINNERAN   =*
      *= DESC    : REMOVE CODE RELATED TO OPS51                       =*
      *================================================================*
      *= LA351                DATE: 02/05/16   PGM'R: BARBARA YUSKO   =*
      *= ICP: 56136                            RQST'R: PAT FINNERAN   =*
      *= DESC    : REMOVE CODE RELATED TO PROCESSING OF ORIGINAL      =*
      *=           CREDIT GRANTOR REPORTED IN A C1 SEGMENT            =*
      *================================================================*
      *= LA351                DATE: 11/06/15   PGM'R:  BARBARA YUSKO  =*
      *= ICP: 55303                            RQST'R: PAT FINNERAN   =*
      *= DESC    : IF BALANCE AMOUNT FLAG IS SET TO ZERO IN THE EDIT. =*
      *=           ALLOW ZERO BALANCE AMOUNT IF THE RECORD HAS SCC AH =*
      *=           EVEN IF STATUS IS NOT ZERO BAL AMT SUPPORTABLE.    =*
      *================================================================*
      *= LA351                DATE: 09/13/13   PGM'R: BARBARA YUSKO   =*
      *= ICP: 49762                            RQST'R: CATHY STRASBURG=*
      *= DESC    : CHANGES TO SSN CODE DUE TO NEW FLAG SETTINGS OF    =*
      *=           CDA-OPS13-SSN AND CDA-APPEND-DUPE-SSN AND DELETION =*
      *=           OF OBSOLETE SETTING CDA-SSN-ERROR                  =*
      *================================================================*
      *= LA351                DATE: 06/29/12   PGM'R: BARBARA YUSKO   =*
      *= ICP: 44856                            RQST'R: CATHY STRASBURG=*
      *= DESC    : FIX PROBLEM WHERE OPTIONAL SEGMENT MKCS IS NOT     =*
      *=           BEING WRITTEN TO THE TRU FILE FOR NON-BASE         =*
      *=           CONSUMERS IF THE BASE CONSUMER WAS BYPASSED        =*
      *================================================================*
001570*= VERSION :            DATE: 11/18/11   PGM'R: BARBARA YUSKO   =*01042002
001580*= ICP: 41885                            RQST'R: CATHY STRASBURG=*01043002
001600*= DESC    : SET THE CCF FLAG TO INDICATE IF SUBCODE CHANGE,    =*01045002
001610*=           ACCOUNT NUMBER CHANGE, OR BOTH WERE PRESENT ON THE =*01046002
001620*=           MCKS SEGMENT WHEN THIS RECORD WAS WRITTEN TO TRU.  =*01047002
001630*=           THE CCF FLAG IS USED FOR COUNTING IN CCLB600.      =*01048002
001750*================================================================*01050102
001570*= VERSION :            DATE: 01/15/04   PGM'R: BARBARA YUSKO   =*01042002
001580*=                      PR #: ICP# 4102  RQST'R: PAT FINNERAN   =*01043002
001600*= DESC    : ADDED NEW OPTIONAL SEGMENT MEMP, WHICH WILL CONTAIN=*01045002
001610*=           EMPLOYMENT DATA FROM EITHER THE H1 SEGMENT FOR     =*01046002
001620*=           METRO REPORTERS OR FROM THE N1 SEGMENT FOR METRO2  =*01047002
001630*=           REPORTERS.  THIS SEGMENT, IF PRESENT, WILL APPEAR  =*01048002
001630*=           RIGHT BEFORE THE END SEGMENT.                      =*01049002
001750*================================================================*01050102
001050*= VERSION : Q3-2003    DATE:  5/12/03   PGM'R: L NAKAHARA      =*01051001
001060*=                     ICP #: 12811      RQST'R: P FINNERAN     =*01060001
001070*= DOC REF : ICP12811 Q3 RELEASE                                =*01070001
001080*= DESC    : UPDATE TRADE DATA AND DROP IDENT WHEN MESSAGE IN   =*01080001
001080*=           ADDRESS (MIA) FLAG IS SET                          =*01090001
001120*================================================================*01100001
001050*= VERSION : Q3         DATE:  7/06/01   PGM'R: L NAKAHARA      =*01130001
001060*=                     ICP #: 11176      RQST'R: J SLANE        =*01140001
001070*= DOC REF : ICP11176 COORDINATED Q3 RELEASE                    =*01150001
001080*= DESC    : PAYMENT RATING ENHANCEMENT - ADD G AND L           =*01160001
001080*=           CHANGED ADDED TO SECTION 12400-LOAD-TRADE-BASE     =*01170001
001120*================================================================*01180001
001050*= VERSION : Q4         DATE: 11/16/00   PGM'R: L NAKAHARA      =*01210001
001060*=                     ICP #: 11048      RQST'R: P FINNERAN     =*01220001
001070*= DOC REF : ICP11048 Q4                                        =*01230001
001080*= DESC    : 31000-LOAD-CONSUMER                                =*01240001
001080*=           ADDTL CHECK FOR STATUS CODE 11, 12 OR 13 BEFORE    =*01250001
001080*=           SETTING THE BANKRUPTCY REMOVAL CODE.               =*01260001
001120*================================================================*01270001
001050*= VERSION : 03.06      DATE: 08/11/97   PGM'R: L MCCARTHY      =*01510001
001060*=                     ICP #:            RQST'R:                =*01520001
001070*= DOC REF :  ICP                                               =*01530001
001080*= DESC    : PUT CODE FOR PARM DATE BACK INTO THE HEADER RECORD =*01540001
001090*=      USING A NEW CCSS-MBHS-PARM-DATE FIELD INSTEAD OF THE    =*01550001
001100*=      CCSS-MBHS-PARM-ACTIVITY-DATE WHICH NOW GETS POPULATED   =*01560001
001110*=      FROM THE SORTINFO FILE.                                 =*01570001
001120*================================================================*01580001
001230*= VERSION : 03.04      DATE: 03/26/97   PGM'R: J CHOY          =*01690001
001240*=                     ICP #: S603       RQST'R: SMART          =*01700001
001250*= DOC REF :  ICP S603                   PHONE: 5457            =*01710001
001260*= DESC    : SORTINFO COUNT SHOULD BE HANDLED BY CCLC645 PGM    =*01720001
001270*=           INSTEAD OF INITIALIZE TO ZEROS IN THIS PROGRAM.    =*01730001
001280*================================================================*01740001
001290*= VERSION : 03.03      DATE: 10/31/96   PGM'R: BARB YUSKO      =*01750001
001300*=                     ICP #: 5977       RQST'R: PAT FINNERAN   =*01760001
001310*= DOC REF :                             PHONE:                 =*01770001
001320*= DESC    : PASS BLANKS IN THE SOCIAL FIELD AND OMITTED IN THE =*01780001
001330*=           FLAG IF THIS IS A BASE OR APPEND DUPLICATE AS      =*01790001
001340*=           OPPOSED TO AN INVALID SOCIAL.                      =*01800001
001350*================================================================*01810001
001570*= VERSION : 03.00      DATE: 07/08/96   PGM'R: LINDA PISCH     =*02030001
001580*=                      PR #: ICP# 4102  RQST'R: SHELLEY FOSTER =*02040001
001590*= DOC REF : ICP# 4102                   PHONE: EX 5138         =*02050001
001600*= DESC    : ADDED NEW OPTIONAL SEGMENT. THE MFLG SEGMENT WILL  =*02060001
001610*=           BE BUILT ONLY IF THE NEW CCF-MESSAGE-SEG-FLAG HAS  =*02070001
001620*=           AN INCOMING VAULE OF '3', '2' OR '1'. THESE RE-    =*02080001
001630*=           PRESENT NON-FATAL MIA, REPORTER SENT IN ALL BLANKS =*02090001
001640*=           IN EITHER NAME OR ADDRESS LINES, OR FATAL MIA.     =*02100001
001650*=           ALSO, AN OPS12 CONDITION WOULD ALSO BE REFLECTED   =*02110001
001660*=           AS A '3', NON-FATAL. ONLY ONE MFLG SEGMENT WILL BE =*02120001
001670*=           CREATED, SO IF MULTIPLE SEGMENTS EXIST FOR A KEY   =*02130002
001680*=           RECORD, THE MFLG SEGMENT INDICATOR WILL CONTAIN    =*02140001
001690*=           THE HIGHEST PRIORITY THAT CAME IN FOR THAT RECORD. =*02150001
001700*=           I.E IF BASE HAD A '3' CCF FLAG AND AN A1 HAD A '1' =*02160001
001710*=           THE '1' WOULD TAKE PRIORITY AND BE PLACED IN THE   =*02170001
001720*=           MFLG INDICATOR FIELD. THE PRIORITY IS RANKED AS    =*02180001
001730*=           FATAL=1 BEING HIGHEST, REPORTER=2 NEXT, AND NON-   =*02190001
001740*=           FATAL=3 BEING LOWEST PRIORITY.                     =*02200001
001750*================================================================*02210001
001760*= VERSION : 02.09      DATE: 07/05/96   PGM'R: LINDA PISCH     =*02220001
001770*=                      PR #: ICP# 5093  RQST'R: SHELLEY FOSTER =*02230001
001780*= DOC REF : ICP# 5093                   PHONE: EX 5138         =*02240001
001790*= DESC    : ADDED CHECK FOR THE WS-OPTL-TRADE-CHANGE-SW TO BE  =*02250001
001800*=           'O' OR 'L' WHEN PROCESSING E1 SEGS WHEN OPS52 IS   =*02260001
001810*=           SET TO OPS-52-DO-NOT-UPGD-E1. OTHERWISE THE MTBS   =*02270001
001820*=           AND MTBI OUTPUT SEGMENTS WERE POPULATED INCORRECTLY=*02280001
001830*================================================================*02290001
002120*= VERSION : 02.05      DATE: 02/24/96   PGM'R: LINDA PISCH     =*02580001
002130*=                      ICP#: 3930       RQST'R:                =*02590001
002140*= DOC REF : ICP 3930                                           =*02600001
002150*=                                                              =*02610001
002160*= DESCRIPTION: REMOVE CODE THAT MOVES PARM DATE TO HEADER DATE =*02620001
002170*=              FIELD, PARAGRAPH 1C000-LOAD-MAIN-HEADER,        =*02630001
002180*=              AND ADDED CODE TO PUT PARM DATE IN THE          =*02640001
002190*=              SORT-INFO-DATE IF THE CCF-NEW-AHA-DATE-OF-OCCUR =*02650001
002200*=              IS SPACES. IF IT'S NOT, MOVE IT TO THE          =*02660001
002210*=              SORT-INFO-DATE.PARAGRAPH 9C000-WRITE-SORT-INFO  =*02670001
002220*================================================================*02680001
002380*= ICP2426 : INIT SUBCODE IN TRADE KEY FROM SPACES TO ZEROS.    =*02840001
002390*= 6/21/95   JCHOY                                              =*02850001
002400*=                                                              =*02860001
002410*= VERSION : 02.02      DATE: 06/21/95   PGM'R: J CHOY,BYUSKO   =*02870001
002420*=                      PR #: ICP        RQST'R: DMS/CCSS       =*02880001
002430*= DOC REF : CCSS DATAPREP LA351/SORT DEDUP SEP                 =*02890001
002440*=                                                              =*02900001
002450*= DESCRIPTION:                                                 =*02910001
002460*= ICP2426 : INIT SUBCODE IN TRADE KEY FROM SPACES TO ZEROS.    =*02920001
002470*= 6/21/95   JCHOY                                              =*02930001
002480*=                                                              =*02940001
002490*= ICP2550 : IF REVOLVING EQUATED ACCOUNT TYPE, CONVERT TERMS   =*02950001
002500*=           TO ZEROS AND SET FLAG TO 'V'.                      =*02960001
002510*= 8/18/95   JCHOY                                              =*02970001
002520*=                                                              =*02980001
002530*= ICP2729 : SET RELIABLE AND UNRELIABLE SOURCE ID BASED ON     =*02990001
002540*=           OPS11, IF OPS11=Y, IT IS RELIABLE SOURCE=AF, ELSE  =*03000001
002550*=           UNRELIABLE SOURCE=AG.                              =*03010001
002560*= 8/23/95   JCHOY                                              =*03020001
002570*=                                                              =*03030001
002580*= ICP2857 : WRITE A NEW FILE CONTAINING NUMBER OF TRADE RECORDS=*03040001
002590*=           WRITTEN, MAXIMUM RECORD SIZE, AND AVERAGE RECORD   =*03050001
002600*=           SIZE, TO BE USED IN THE SORT STEP TO BUILD JCL.    =*03060001
002610*= 9/26/95   BYUSKO                                             =*03070001
002620*=                                                              =*03080001
002630*= ICP 2981: FOR B3 GRID, MOVE IN THE EDITED GRID INTO CCSS GRID=*03090001
002640*= 10/03/95  JCHOY                                              =*03100001
002650*=                                                              =*03110001
002660*= ICP 2975: IF CDA-EXPANDED ZIP IS ZEROS, PASS SPACES          =*03120001
002670*=           INSTEAD. PROBLEM WITH NON-STANDARDIZED             =*03130001
002680*=           ADDRESS IS BEING REJECTED IN CCSS.                 =*03140001
002690*= 10/10/95  JCHOY                                              =*03150001
002700*=                                                              =*03160001
002740*=--------------------------------------------------------------=*03170001
002960*= VERSION : 02.00      DATE: 12/17/94   PGM'R: R. PARASCANDOLO =*03390001
002970*=                      PR #: 41002C     RQST'R: DMS/CCSS       =*03400001
002980*= DOC REF : SEP LA351 FOLLOW-ON                                =*03410001
002990*= DESC    : 1.IN ORDER TO POPULATE THE DATE OF OCCURRENCE      =*03420001
003000*=             FIELD IN THE NEW AHA RECORD THE FIRST VALID      =*03430001
003010*=             DATE OF OCCURENCE OF THE FIRST VALID A-C-T-I-V-E =*03440001
003020*=             RECORD WILL BE MOVED TO CCF-NEW-AHA-DATE-OF-OCCUR=*03450001
003030*=             ACTIVE = STATUS 11 WITH                          =*03460001
003040*=                        DATE OF OCCURRENCE GREATER THAN ZERO  =*03470001
003050*=                    AND BALANCE AMOUNT     GREATER THAN ZERO  =*03480001
003060*=- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - =*03490001
003070*=                      DATE: 12/17/94   PGM'R: JACQUES STERN   =*03500001
003080*=                      PR #: 41002C     RQST'R: DMS/CCSS       =*03510001
003090*=                                                              =*03520001
003100*= DESC    : MAKE THE FOLLOWING CHANGES:                        =*03530001
003110*=                                                              =*03540001
003120*=              1) SEP 1.2.1.4 (CCSS SAMPLE REPORTS): ADD A     =*03550001
003130*=                 CHECK TO SEE IF THE CCSS OUTPUT FLAG IS OFF, =*03560001
003140*=                 AND BYPASS THE WRITE TO THE CCSS OUTPUT      =*03570001
003150*=                 FILE WHEN THAT IS THE CASE.  THIS IS TO ALLOW=*03580001
003160*=                 THE CCSS FIELDS TO BE POPULATED FOR THE      =*03590001
003170*=                 NEW SAMPLE REPORTING WHETHER THE CURRENT     =*03600001
003180*=                 BASE OR APPENDAGE TRANSACTION IS VALID OR    =*03610001
003190*=                 NOT.  MAKE MODIFICATIONS NECESSARY TO        =*03620001
003200*=                 ENSURE FUNCTIONAL EQUIVALENCY SINCE WE       =*03630001
003210*=                 CAN NO LONGER ASSUME THAT IF THIS MODULE IS  =*03640001
003220*=                 CALLED, THE DATA ASSOCIATED WITH THE         =*03650001
003230*=                 CURRENT TRADE KEY IS ALWAYS GOING TO BE      =*03660001
003240*=                 OUTPUT TO THE CCSS TRADE FILE.               =*03670001
003250*=                                                              =*03680001
003260*=                 REMOVE THE DUAL OPS SWITCH CHECK THAT        =*03690001
003270*=                 CONDITIONALLY BYPASSED ALL OUTPUT PROCESS    =*03700001
003280*=                 WHEN CCF-PARM-CCSS-OUTPUT IS SET TO 'N'.     =*03710001
003290*=                 THIS WILL BE HANDLED ONLY BY SYMBOLIC        =*03720001
003300*=                 APPLICATION OF DUMMY TO THE CCSS FILE IN     =*03730001
003310*=                 THE JCL.                                     =*03740001
003320*=                                                              =*03750001
003330*=                 TRANSFER THE COPY STATEMENT FOR CCLAMBHS     =*03760001
003340*=                 FROM W/S TO THE LINKAGE SECTION, AND         =*03770001
003350*=                 REFERENCE ITS GROUP ITEM; GIVES VISIBILITY   =*03780001
003360*=                 TO THE CCSS SAMPLES REPORTS MODULE - TO THIS =*03790001
003370*=                 DATA.                                        =*03800001
003380*=                                                              =*03810001
003390*=              2) SEP 1.2.2.1 (A THRU C) - PASS 3 NEW          =*03820001
003400*=                 INDICATORS TO CCSS UPDATE ON THE CCSS        =*03830001
003410*=                 TRADE BATCH HEADER:                          =*03840001
003420*=                                                              =*03850001
003430*=                 A. ACCOUNT TYPE INDICATOR FROM OPS 70        =*03860001
003440*=                 B. OPEN DATE INDICATOR    FROM OPS 23        =*03870001
003450*=                 C. ACCOUNT NUMBER                            =*03880001
003460*=                    SCRAMBLING INDICATOR   FROM OPS 55        =*03890001
003470*=                                                              =*03900001
003480*=              3) SEP 1.2.2.2 - PASS THE TRANSACTION TYPE      =*03910001
003490*=                 AND INDICATOR VALUE IN                       =*03920001
003500*=                 CCSS-MTBS-TRAN-TYPE AND                      =*03930001
003510*=                 CCSS-MTBI-TRAN-TYPE-I RESPECTIVELY.          =*03940001
003520*=                 THESE FIELDS ARE CURRENTLY POPULATED         =*03950001
003530*=                 WITH THE PORTFOLIO TYPE AND INDICATOR BUT    =*03960001
003540*=                 CCSS IS NOT CURRENTLY USING IT - THIS IS     =*03970001
003550*=                 A TEMPORARY REQUIREMENT THAT AVOIDS CHANGES  =*03980001
003560*=                 TO THE CCSS RECORD LAYOUT.                   =*03990001
003570*=                                                              =*04000001
003580*=              4) SEP 1.2.2.5 - PASS ALL NEW TABLE 14          =*04010001
003590*=                 ENTRIES OF PORTFOLIO ACQUISITION SUBCODE     =*04020001
003600*=                 EQUATIONS TO CCSS UPDATE ON THE CCSS         =*04030001
003610*=                 BATCH HEADER:                                =*04040001
003620*=                                                              =*04050001
003720*=  FIX ---> ADDED TDA-CCSS-ORIG-TERMS; REMOVED                 =*04150001
003730*=           TDA-TERMS-WITH-PRECISION AND                       =*04160001
003740*=           TDA-TERMS-DECIMAL-VALUE.  THIS IS NEEDED TO        =*04170001
003750*=           SAVE THE EDITED TERMS IN MONTHS BEFORE THE CURRENT =*04180001
003760*=           SYSTEM CONVERTS IT INTO YEARS; THE OLD METHOD OF   =*04190001
003770*=           SAVING THE FIRST 2 DECIMAL VALUES FROM THE         =*04200001
003780*=           CONVERSION SO THAT CCSS OUTPUT MODULE CAN CONVERT  =*04210001
003790*=           BACK ACCURATELY WAS NOT WORKING WHEN THE           =*04220001
003800*=           CONVERSION TO YEARS YIELDS RESULTS LIKE            =*04230001
003810*=           700 -> 58.33 BECAUSE 58.33 -> 696.                 =*04240001
003820*=                                                              =*04250001
003830*=  FIX ---> REMOVED RETURN CODE CHECK LOGIC FOR I/O            =*04260001
003840*=           OPERATIONS AGAINST CCSSTRAD - THE APPLICATION      =*04270001
003850*=           SHOULD ABEND WITH STANDARD I/O ABEND CODES         =*04280001
003860*=           IF THERE IS A FAILURE AGAINST A QSAM FILE          =*04290001
003870*=           RATHER THAN ISSUING WARNING DISPLAYS.              =*04300001
003880*=                                                              =*04310001
003890*=--------------------------------------------------------------=*04320001
003900*= VERSION : 01.00A     DATE: 09/23/94   PGM'R: JACQUES STERN   =*04330001
003910*=                      PR #: 32801      RQST'R: DMS            =*04340001
003920*= DOC REF : DATAPREP / CCSS INTERFACE TRS/DS                   =*04350001
003930*= DESC    : CORRECTION TO THE PROCESS THAT OUTPUTS THE         =*04360001
003940*=           CONSUMER ADDRESS INFORMATION STARTING IN           =*04370001
003950*=           ADDRESS LINE 1 SUCH THAT IF THE LINE 1 FIELD       =*04380001
003960*=           IS BLANK, DATA FROM THE NEXT ADDRESS FIELD         =*04390001
003970*=           CONTAINING DATA IS MOVED INTO IT AND SO ON.        =*04400001
003980*=           THE ERROR WAS THAT THIS PROCESS WAS BEGINNING      =*04410001
003990*=           WITH THE CONSUMER NAME FIELD INSTEAD OF WITH THE   =*04420001
004000*=           FIRST ADDRESS LINE FIELD; THIS WAS INCORRECT.      =*04430001
004010*=--------------------------------------------------------------=*04440001
004020*= VERSION : 01.00A     DATE: 09/28/93   PGM'R: JACQUES STERN   =*04450001
004030*=                      PR #: 32801      RQST'R: COPERNICUS     =*04460001
004040*= DOC REF : DATAPREP / CCSS INTERFACE TRS/DS                   =*04470001
004050*= DESC    : INITIAL IMPLEMENTATION.                            =*04480001
004060*================================================================*04490001
004070*= IOBOX   |            INPUTS/OUTPUTS                | IOBOX   =*04500001
004080*================================================================*04510001
004090*=PARMS                                                         =*04520001
004100*=  FIELD NAME:                    I/O   DESCRIPTION            =*04530001
004110*= : ____________________________ : _ : _______________________ =*04540001
004120*=                                                              =*04550001
004130*= FILES                                                        =*04560001
004140*= DD:      I/O/U/W:   ACCESS:      ORGANIZATION:  MEDIA:(OPTNL)=*04570001
004150*= CCSSTRAD   O/W      QSAM         SEQUENTIAL     ____________ =*04580001
004160*================================================================*04590001
004170*= LINKBOX |           PROGRAM CALLS                  | LINKBOX =*04600001
004180*=--------------------------------------------------------------=*04610001
004190*=   MODULE      NO MODULES CALLED                              =*04620001
004200*================================================================*04630001
004210*= COPYBOX |                COPY BOOKS                | COPYBOX =*04640001
004220*=--------------------------------------------------------------=*04650001
004230*=  MODULE           DESCRIPTION                                =*04660001
004240*=                                                              =*04670001
004440*= : CCLAMFLG      : TRADE MESSAGE IN ADDRESS SEG - CCSS TRADE_ =*04870001
004450*= : CCLAMTHE      : TRADE TRANSACTION END MARKER - CCSS TRADE_ =*04880001
004370*= : CCLAMTHS      : TRANSACTION HEADER - CCSS TRADE___________ =*04800001
004290*= : CCLAERC       : EVENT REASON CODES LITERALS_______________ =*04720001
004250*= : CCLACCF       : COMMON CONTROL FLAGS______________________ =*04680001
004260*= : CCLACRF       : METRO INPUT AREA__________________________ =*04690001
004270*= : CCLACDA       : CONSUMER DATA AREA________________________ =*04700001
004300*= : CCLAOPS       : OP CODES FROM THE CONTROL DECK____________ =*04730001
004310*= : CCLATDA       : TRADE DATA AREA___________________________ =*04740001
004320*= : CCLATB10      : TABLE 10 - VALID ZIP CODE RANGES__________ =*04750001
004320*= : CCLATLC       : TABLE LIMIT CONSTANTS_____________________ =*04750001
004350*= : CCLACOA       : RETURN CONSUMER OVERFLOW STATS____________ =*04780001
004360*= : CCLAMBHS      : BATCH HEADER RECORD - CCSS TRADE__________ =*04790001
004420*= : CCLAMCOS      : CONSUMER - CCSS TRADE_____________________ =*04850001
004420*= : CCLAMEMP      : REPORTER - EMPLOYMENT INFORMATION_________ =*04851002
004430*= : CCLAMKCS      : TRADE KEY CHANGE - CCSS TRADE_____________ =*04860001
004400*= : CCLAMTBS      : TRADE BASE - CCSS TRADE___________________ =*04830001
004410*= : CCLAMTBI      : TRADE BASE INDICATORS - CCSS TRADE________ =*04840001
004390*= : CCLAMTKI      : TRADE KEY INDICATORS - CCSS TRADE_________ =*04820001
004380*= : CCLAMTKS      : TRADE KEY - CCSS TRADE____________________ =*04810001
004470*=                                                              =*04900001
004480*================================================================*04910001
004490*= CODEBOX |   ABEND/ERROR CODES AND MESSAGES         | CODEBOX =*04920001
004500*=--------------------------------------------------------------=*04930001
004510*= FILE I-O    * I-O TYPE (O/W/C); STANDARD I/O TASK            =*04940001
004520*=               TERMINATION WILL OCCUR IN THE EVENT OF AN      =*04950001
004530*=               I/O FAILURE AGAINST CCSSTRAD.                  =*04960001
004540*=                                                              =*04970001
004550*= * RETURN CD   DESCRIPTION                 PRGRM LABEL        =*04980001
004560*=                                                              =*04990001
004570*= : ________  : _______________________     ___________________=*05000001
004580*=                                                              =*05010001
004590*================================================================*05020001
004600*= TECHBOX |           SPECIAL TECHNIQUES             | TECHBOX =*05030001
004610*=--------------------------------------------------------------=*05040001
004620*= THIS PROGRAM USES REFERENCE MODIFICATION                     =*05050001
004630*= (COLUMN : LENGTH) IN CONJUNCTION WITH THE "LENGTH OF"        =*05060001
004640*= SPECIAL REGISTER TO LOAD A VARIABLE NUMBER OF SEGMENTS INTO  =*05070001
004650*= THE OUTPUT AREA CONTIGUOUSLY, TO POPULATE SEGMENT LENGTH     =*05080001
004660*= INDICATOR FIELDS AND THE RDW.  THE SEGMENTS THEMSELVES ARE   =*05090001
004670*= TREATED AS FIXED LENGTH ENTITIES.                            =*05100001
004680*=                                                              =*05110001
004690*================================================================*05120001
004700*= DESCBOX CLOGBOX IOBOX LINKBOX COPYBOX CODEBOX TECHBOX        =*05130001
004710*=--------------------------------------------------------------=*05140001
004720*= ENDBOX      ENDBOX       ENDBOX       ENDBOX          ENDBOX =*05150001
004730*================================================================*05160001
004740/                                                                 05170001
004750 ENVIRONMENT DIVISION.                                            05180001
004760 CONFIGURATION SECTION.                                           05190001
004770 SOURCE-COMPUTER. IBM-370.                                        05200001
004780 OBJECT-COMPUTER. IBM-370.                                        05210001
004790 INPUT-OUTPUT SECTION.                                            05220001
004800 FILE-CONTROL.                                                    05230001
004810     SELECT CCSS-TRADE ASSIGN CCSSTRAD.                           05240001
004820     SELECT SORT-INFO  ASSIGN SORTINFO.                           05250001
004830 I-O-CONTROL.                                                     05260001
004840     APPLY WRITE-ONLY CCSS-TRADE.                                 05270001
004850 DATA DIVISION.                                                   05280001
004860 FILE SECTION.                                                    05290001
004870 FD  CCSS-TRADE                                                   05300001
004880     LABEL RECORDS ARE STANDARD                                   05310001
004890     RECORDING MODE V                                             05320001
004900     BLOCK CONTAINS 0 RECORDS                                     05330001
004910     RECORD IS VARYING IN SIZE                                    05340001
004920     FROM 125 TO 27990 CHARACTERS                                 05350001
004930     DEPENDING ON FMT-LEN                                         05360001
004940     DATA RECORD IS CCSS-TRADE-RECORD.                            05370001
004950 01  CCSS-TRADE-RECORD.                                           05380001
004960     05 CCSS-TRADE-REC OCCURS 125  TO 27990 TIMES                 05390001
004970             DEPENDING ON FMT-LEN        PIC  X(01).              05400001
004980 FD  SORT-INFO                                                    05410001
004990     LABEL RECORDS ARE STANDARD                                   05420001
005000     RECORDING MODE F                                             05430001
005010     BLOCK CONTAINS 0 RECORDS                                     05440001
005020     RECORD CONTAINS 80 CHARACTERS                                05450001
005030     DATA RECORD IS SORT-INFO-RECORD.                             05460001
005040 01  SORT-INFO-RECORD.                                            05470001
005050     05  SORT-INFO-TRADE-RECORD-COUNT    PIC 9(09).               05480001
005060     05  FILLER                          PIC X(01).               05490001
005070     05  SORT-INFO-MAX-RECORD-SIZE       PIC 9(09).               05500001
005080     05  FILLER                          PIC X(01).               05510001
005090     05  SORT-INFO-AVG-RECORD-SIZE       PIC 9(09).               05520001
005100     05  FILLER                          PIC X(01).               05530001
005110     05  SORT-INFO-DATE                  PIC X(10).               05540001
005120     05  FILLER                          PIC X(40).               05550001
005130/                                                                 05560001
005140 WORKING-STORAGE SECTION.                                         05570001
005160*------------> NEW WORKING STORAGE BEGINS HERE <----------------* 05580001
005200*                                                                 05620001
005210*%   S = SWITCHES                                                 05630001
005220*                                                                 05640001
005230 01  WS-SWITCHES-AREA.                                            05650001
005240     05 WS-FIRST-TIME-SW              PIC X(01) VALUE 'Y'.        05660001
005250         88 FIRST-TIME-CALL                     VALUE 'Y'.        05670001
005260     05 WS-REPORTER-EOF-SW            PIC X(01) VALUE 'N'.        05680001
005270         88 PRIOR-REPORTER-EOF-NOT              VALUE 'N'.        05690001
005280         88 PRIOR-REPORTER-EOF-YES              VALUE 'Y'.        05700001
005290     05 WS-OPTL-TRADE-CHANGE-SW       PIC X(01) VALUE 'N'.        05710001
005300         88 OPTL-TRCHG-NO-LOAD                  VALUE 'N'.        05720001
005310         88 OPTL-TRCHG-LOAD-PENDING             VALUE 'L'.        05730001
005320         88 OPTL-TRCHG-OUTPUT-PENDING           VALUE 'O'.        05740001
005330*                                                                 05750001
005340** ICP 4102 ** LPISCH                                             05760001
005350*                                                                 05770001
005360     05 WS-OPTL-MESSAGE-SEG-SW        PIC X(01) VALUE 'N'.        05780001
005370         88 OPTL-MSG-NO-LOAD                    VALUE 'N'.        05790001
005380         88 OPTL-MSG-LOAD-PENDING               VALUE 'L'.        05800001
005390         88 OPTL-MSG-OUTPUT-PENDING             VALUE 'O'.        05810001
005400                                                                  05820001
005330*                                                                 05821004
005340** ICP 14610 * BYUSKO                                             05822004
005350*                                                                 05823004
005360     05 WS-OPTL-EMPLOYMENT-SEG-SW     PIC X(01) VALUE 'N'.        05824004
005370         88 OPTL-EMP-NO-LOAD                    VALUE 'N'.        05825004
005380         88 OPTL-EMP-LOAD-PENDING               VALUE 'L'.        05826006
005390         88 OPTL-EMP-OUTPUT-PENDING             VALUE 'O'.        05827004
005400                                                                  05828004
005410     05 WS-DATE-FMT-SYMBOL            PIC X(01) VALUE '/'.        05830001
005420        88  SLASH-SEPARATOR                     VALUE '/'.        05840001
005530     05 WS-TRANS-OUTPUT-STATUS-FLAG   PIC X(01) VALUE 'N'.        05920001
005540        88  TRANS-OUTPUT-UNDETERMINED           VALUE 'N'.        05930001
005550        88  TRANS-OUTPUT-PENDING                VALUE 'Y'.        05940001
005560     05 WS-OUTPUT-TO-CCSS-FLAG        PIC X(01) VALUE 'N'.        05950001
005570        88  WS-OUTPUT-TO-CCSS                   VALUE 'Y'.        05960001
005580     05 WS-MAIN-HEADER-OUTPUT-FLAG    PIC X(01) VALUE 'N'.        05970001
005590        88  MAIN-HEADER-WRITTEN-N               VALUE 'N'.        05980001
005600        88  MAIN-HEADER-WRITTEN-Y               VALUE 'Y'.        05990001
005620     05 WS-MESSAGE-OUT-FLAG           PIC X(01) VALUE ' '.        06010001
005630*                                                                 06020001
005640*%   T = TRADE KEYS                                               06030001
005650*                                                                 06040001
005660 01  TRADE-KEY-AREA.                                              06050001
005670     05 TRADE-KEY-SAVE-AREA              PIC  X(53) VALUE SPACES. 06060001
005680*                                                                 06070001
005690     05 TRADE-KEY-CURRENT                   VALUE SPACES.         06080001
005700         10 TRADE-KEY-CURR-VENDOR-ID     PIC  X(04).              06090001
005710         10 TRADE-KEY-CURR-CYCLE-ID      PIC  X(02).              06100001
005720         10 TRADE-KEY-CURR-SIN-NUM       PIC  9(07).              06110001
005730         10 TRADE-KEY-CURR-ACCT-ID       PIC  X(30).              06120001
005740         10 TRADE-KEY-CURR-OPEN-DATE     PIC  X(08).              06130001
005750         10 TRADE-KEY-CURR-ACCT-TYPE     PIC  X(02).              06140001
005760*                                                                 06150001
005770*%   L = LENGTH INDICATORS                                        06160001
005780*                                                                 06170001
005790*                                                                 06180001
005800 01  WS-LENGTH-INDICATORS.                                        06190001
005810     05  WS-VARIABLE-RECORD-LENGTH    PIC  9(09) COMP VALUE 0.    06200001
005820     05  WS-RECORD-LENGTH-SAVE        PIC S9(09) COMP-3 VALUE 0.  06210001
005830     05  WS-RECORD-LENGTH-TOTAL       PIC S9(17) COMP-3 VALUE 0.  06220001
005840 01  WS-TRADE-RECORD-COUNT            PIC S9(09) COMP-3 VALUE 0.  06230001
005850                                                                  06240001
005900*                                                                 06250001
005910*%   S = SUBSCRIPTS                                               06260001
005920*                                                                 06270001
005930*                                                                 06280001
005940 01  WS-SUBSCRIPTS.                                               06290001
005970     05  ADDR-SUB-1                   PIC S9(04) COMP VALUE ZERO. 06320001
005980     05  ADDR-SUB-2                   PIC S9(04) COMP VALUE ZERO. 06330001
006020*                                                                 06370001
006030*%   C = CONSTANTS                                                06380001
006040*                                                                 06390001
006050*                                                                 06400001
006060 01  WS-CONSTANTS.                                                06410001
006070*---------------------------------------------------------------* 06420001
006080* SOME NUMERIC "CONSTANTS" DERIVE THEIR VALUES FROM THE         * 06430001
006090* PROCESSING BUT THEY ARE CONSTANTS IN THE SENSE THAT THE       * 06440001
006100* VALUE, ONCE DERIVED, REMAINS IN THE FIELD FOR THE DURATION    * 06450001
006110* OF THE LA351 STEP TASK.                                       * 06460001
006120*---------------------------------------------------------------* 06470001
006130     05  CNST-MAX-CONSUMERS          PIC  S9(04) COMP VALUE +100. 06480001
006150     05  CNST-MAX-LINES           PIC  9(04) COMP VALUE 3.        06500001
006160     05  CNST-CNSMR-STARTING-COL  PIC  9(04) COMP VALUE ZEROES.   06510001
006170     05  CNST-VALUE-1             PIC  9(04) COMP VALUE 1.        06520001
006170     05  CNST-VALUE-2             PIC  X(01) VALUE '2'.           06530001
006310     05  CNST-DEFAULT-ZIP-RANGE   PIC  X(10) VALUE '0000099999'.  06590001
006400     05  CNST-VALUE-FNA-REPORTER  PIC  X(02) VALUE 'AF'.          06600001
006410     05  CNST-VALUE-NFNA-REPORTER PIC  X(02) VALUE 'AG'.          06610001
006420     05  CNST-VALUE-01-X.                                         06620001
006430         10  FILLER               PIC  X(01) VALUE '0'.           06630001
006440         10 CNST-VALUE-1-X        PIC  X(01) VALUE '1'.           06640001
006450     05  CNST-ESTIMATED           PIC  X(01) VALUE 'E'.           06650001
006500**** X'80000000' =  -2147483648                                   06680001
006510     05  CNST-BAL-AMT-UNKNOWN-X   PIC  X(04)                      06690001
006520                                  VALUE X'80000000'.              06700001
006530     05  CNST-BAL-AMT-UNKNOWN REDEFINES                           06710001
006540         CNST-BAL-AMT-UNKNOWN-X   PIC  S9(08) COMP.               06720001
006550                                                                  06730001
006560**** X'80000001' =  -2147483647                                   06740001
006570     05  CNST-BAL-AMT-DEFAULT-X   PIC  X(04)                      06750001
006580                                       VALUE X'80000001'.         06760001
006590     05  CNST-BAL-AMT-DEFAULT REDEFINES                           06770001
006600         CNST-BAL-AMT-DEFAULT-X   PIC  S9(08) COMP.               06780001
006610                                                                  06790001
006620*----------------------------------------------------------------*06800001
006630* CCLAERC ERC-DATA-IS-INVALID EQUATES TO 'E', WHEREAS 'I' IS     *06810001
006640* REQUIRED BY CCSS TO SIGNIFY INVALID - HENCE THE USE OF         *06820001
006650* THE CNST- LITERAL FOR THE CCSS INDICATORS, BUT THE ERC-        *06830001
006660* VERSION IS USED WHEN INTERROGATING THE FLAGS IN THE TDA, CDA.. *06840001
006670*----------------------------------------------------------------*06850001
006690     05  CNST-SCHEDULED           PIC  X(01) VALUE 'S'.           06870001
006740     05  CNST-CURR-CCSS-VERSION   PIC  9(04) VALUE 100 COMP.      06920001
006750     05  CNST-CUR2-CCSS-VERSION   PIC  9(04) VALUE 200 COMP.      06930001
006760     05  CNST-MBHS                PIC  X(04) VALUE 'MBHS'.        06940001
006770     05  CNST-MTHS                PIC  X(04) VALUE 'MTHS'.        06950001
006780     05  CNST-MTKS                PIC  X(04) VALUE 'MTKS'.        06960001
006790     05  CNST-MTKI                PIC  X(04) VALUE 'MTKI'.        06970001
006800     05  CNST-MTBS                PIC  X(04) VALUE 'MTBS'.        06980001
006810     05  CNST-MTBI                PIC  X(04) VALUE 'MTBI'.        06990001
006820     05  CNST-MCOS                PIC  X(04) VALUE 'MCOS'.        07000001
006830     05  CNST-MKCS                PIC  X(04) VALUE 'MKCS'.        07010001
006840     05  CNST-MFLG                PIC  X(04) VALUE 'MFLG'.        07020001
           05  CNST-MEMP                PIC  X(04) VALUE 'MEMP'.        07021002
006850     05  CNST-MTHE                PIC  X(04) VALUE 'MTHE'.        07030001
006960     05  CNST-EOF-WARN-MSG        PIC  X(54) VALUE                07040001
006970     'TOO MANY CALLS TO CCLC640 - REPORTER EOF WAS COMPLETED'.    07050001
006980     05  CNST-FIRST-NAME-MISSING  PIC  X(32) VALUE                07060001
006990     '* * *  NAME LINE MISSING  * * * '.                          07070001
007110*                                                                 07080001
007120*%   F = FORMAT/WORK AREAS                                        07090001
007130*                                                                 07100001
007140*                                                                 07110001
007150 01  WS-FORMAT-WORK-AREAS.                                        07120001
007160     05  WS-LAST-MCOS-OFFSET          PIC 9(09) COMP VALUE ZEROES.07130001
007170     05  WS-SYS-DATE-AREA.                                        07140001
007180         10  WS-SYS-DATE-YYYY.                                    07150001
007190             15  WS-SYS-DATE-CENT     PIC 9(02) VALUE ZEROES.     07160001
007200             15  WS-SYS-DATE-YEAR     PIC 9(02) VALUE ZEROES.     07170001
007210         10 WS-SYS-DATE-MO            PIC 9(02) VALUE ZEROES.     07180001
007220         10 WS-SYS-DATE-DY            PIC 9(02) VALUE ZEROES.     07190001
007250**Y2K - NOT ALL USED, CAN REMOVE SOME REDEFINES IF WANT TO        07230001
007260     05  WS-DATE-IN.                                              07240001
007310         10  WS-DATE-IN-MO-N          PIC 9(02).                  07290001
007320         10  WS-DATE-IN-DY-N          PIC 9(02).                  07300001
007330         10  WS-DATE-IN-YR-N          PIC 9(02).                  07310001
007260     05  WS-DATE-IN-MMDDCCYY.                                     07320001
007310         10  WS-DATE-IN-MM-N          PIC 9(02).                  07380001
007320         10  WS-DATE-IN-DD-N          PIC 9(02).                  07390001
007330         10  WS-DATE-IN-CC-N          PIC 9(02).                  07400001
007330         10  WS-DATE-IN-YY-N          PIC 9(02).                  07410001
007340     05  WS-DATE-OUT.                                             07420001
007350         10  WS-DATE-OUT-MO           PIC X(02) VALUE SPACES.     07430001
                   88 WS-DATE-OUT-MONTH30   VALUE '04' '06' '09' '11'.  07440001
                   88 WS-DATE-OUT-MONTH31   VALUE '01' '03' '05' '07'   07450001
                                                  '08' '10' '12'.       07460001
                   88 WS-DATE-OUT-MONTH-FEB VALUE '02'.                 07470001
007360         10  WS-DATE-OUT-SEP-1        PIC X(01) VALUE '/'.        07480001
007370         10  WS-DATE-OUT-DY           PIC X(02) VALUE SPACES.     07490001
                   88  WS-DATE-OUT-DAY28        VALUE '01' THRU '28'.   07500001
                   88  WS-DATE-OUT-DAY29        VALUE '29'.             07510001
                   88  WS-DATE-OUT-DAY30        VALUE '01' THRU '30'.   07520001
                   88  WS-DATE-OUT-DAY31        VALUE '01' THRU '31'.   07530001
007390         10  WS-DATE-OUT-SEP-2        PIC X(01) VALUE '/'.        07540001
007400         10  WS-DATE-OUT-YYYY.                                    07550001
007410             15  WS-DATE-OUT-CENT     PIC X(02) VALUE SPACES.     07560001
007420             15  WS-DATE-OUT-YEAR     PIC X(02) VALUE SPACES.     07570001
                       88 WS-DATE-OUT-LEAP-YEAR VALUE '00' '04' '08'    07580001
                                                 '12' '16' '20' '24'    07590001
                                                 '28' '32' '36' '40'    07600001
                                                 '44' '48' '52' '56'    07610001
                                                 '60' '64' '68' '72'    07620001
                                                 '76' '80' '84' '88'    07630001
                                                 '92' '96'.             07640001
007510     05  WS-SAVE-FIRST-CONSUMER       PIC X(32) VALUE SPACES.     07730001
007520     05  WS-SAVE-PREV-SIN-NUM         PIC 9(07) VALUE ZEROES.     07740001
007530     05  WS-SAVE-PREV-ACCT-ID         PIC X(30) VALUE ZEROES.     07750001
007530     05  WS-SAVE-STATUS               PIC X(02) VALUE SPACES.     07750001
007530     05  WS-SAVE-STATUS-I             PIC X(01) VALUE SPACES.     07750001
007540     05  WS-HOLD-FIN-IDX              PIC S9(02) COMP-3 VALUE 0.  07760001
007550     05  WS-ACCT-ZEROS-CNTR           PIC S9(02) COMP-3 VALUE 0.  07770001
007560     05  WS-ACCT-ZEROS-CNTR2          PIC S9(02) COMP-3 VALUE 0.  07780001
007570     05  WS-ACCT-ZEROS-LEN            PIC S9(04) COMP VALUE 30.   07790001
007580     05  WS-ACCT-IN-LEN               PIC S9(04) COMP VALUE 30.   07800001
007580     05  WS-NEW-ACCT-IN-LEN           PIC S9(04) COMP VALUE 30.   07810001
007590     05  WS-ACCT-NUM-IN               PIC X(30) VALUE SPACES.     07820001
007600     05  FILLER REDEFINES WS-ACCT-NUM-IN.                         07830001
007610         10  ACCT-IN-CHAR             PIC  X(01) OCCURS 30        07840001
007620                   INDEXED BY ACT-IDX.                            07850001
007630     05  FUNC-FIELDS.                                             07860001
007640         10  FUNC-IN-LEN              PIC S9(04) COMP VALUE 30.   07870001
007650         10  FUNC-IN                  PIC  X(30) VALUE SPACES.    07880001
007660         10  FILLER REDEFINES FUNC-IN.                            07890001
007670             15  FUNC-IN-CHAR         PIC  X(01) OCCURS 30        07900001
007680                   INDEXED BY FIN-IDX.                            07910001
007690         10  FUNC-OUT                 PIC  X(30) VALUE SPACES.    07920001
007700         10  FILLER REDEFINES FUNC-OUT.                           07930001
007710             15  FUNC-OUT-CHAR        PIC  X(01) OCCURS 30        07940001
007720                   INDEXED BY FOUT-IDX.                           07950001
007730     05  WS-ADDR-LINES-WORK.                                      07960001
007740         10  WS-ADDR OCCURS 3 TIMES   PIC  X(32).                 07970001
007750*                                                                 07980001
007760*%   A = ACCUMULATORS                                             07990001
007770*                                                                 08000001
007780*                                                                 08010001
007790 01  WS-ACCUMULATORS-AREA.                                        08020001
007800     05  WS-TRANSACTION-SEG-TOTALS.                               08030001
007810         10  WS-TRAN-CNSMR-TOTL      PIC   9(09) COMP SYNC        08040001
007820                                                  VALUE ZEROES.   08050001
007830         10  WS-CNSMR-LOADED-TOTL    PIC   9(04) COMP SYNC        08060001
007840                                                  VALUE ZEROES.   08070001
007850     05  WS-EXCEPTIONS-STATS-TOTALS.                              08080001
007860         10  WS-TRAN-CSMR-QTY-OVERLIM      PIC 9(09) COMP SYNC    08090001
007870                                                  VALUE ZEROES.   08100001
007880         10  WS-HI-CSMR-PER-TRANS          PIC 9(09) COMP SYNC    08110001
007890                                                  VALUE ZEROES.   08120001
007900*                                                                 08130001
007910*%   D = VARIABLE DISPLAY AREA                                    08140001
007920*                                                                 08150001
007930*                                                                 08160001
008070**** ICP 4102 ADD NEW MESSAGE IN ADDRESS SEGMENT ****  LPISCH     08170001
008080*                                                                 08180001
008090 COPY CCLAMFLG.                                                   08190001
008100/                                                                 08200001
008110 COPY CCLAMTHE.                                                   08210001
008120/                                                                 08220001
008130 COPY CCLAMTHS.                                                   08230001
008140/                                                                 08240001
008150 COPY CCLAERC.                                                    08250001
008140/                                                                 08240001
008150 COPY CCLATLC.                                                    08250001
008180*                                                                 08280001
008190*%   O = OUTPUT AREA.                                             08290001
008200*                                                                 08300001
008210*----------------------------------------------------------------*08310001
008220*  OUTPUT AREA: THIS IS THE VARIABLE LENGTH RECORD WORK AREA     *08320001
008230*  WHERE THE DATA GETS LOADED - EACH SEGMENT STACKED ONE         *08330001
008240*  AFTER THE OTHER.  ONCE ALL OF THE DATA FOR A TRANSACTION IS   *08340001
008250*  LOADED INTO HERE, IT THEN GOES TO FILE.                       *08350001
008260*                                                                *08360001
008270*             * * *   W A R N I N G   * * *                      *08370001
008280*                                                                *08380001
008290*  FMT-OUTPUT ACCOMODATES THE MAXIMUM POSSIBLE CCSS TRANSACTION  *08390001
008300*  RECORD SIZE SET AT 18,612 BYTES AS OF 3/9/94.  IF THE FIXED   *08400001
008310*  CONSUMER SEGMENT LENGTH (MCOS) IS LENGTHENED BY EVEN A        *08410001
008320*  SMALL AMOUNT, IT IS LIKELY TO AFFECT THE RECORD SIZE          *08420001
008330*  MAXIMUMS HERE, IN THE FD AND IN THE JCL - BECAUSE MCOS CAN    *08430001
008340*  OCCUR UP TO 100 TIMES ON A TRANSACTION RECORD.                *08440001
008350*----------------------------------------------------------------*08450001
008360*  FMT-OUTPUT ACCOMODATES THE MAXIMUM POSSIBLE CCSS TRANSACTION  *08460001
008370*  RECORD SIZE SET AT 27,994 BYTES AS OF 7/15/96  ICP 4102 LPISCH*08470001
008380*----------------------------------------------------------------*08480001
008390 01  FMT-OUTPUT-CONTROL.                                          08490001
008400     05  FMT-OUTPUT               PIC  X(29000).                  08500001
008410     05  FMT-LEN                  PIC  9(09) COMP VALUE ZEROES.   08510001
008420     05  TTY-SEG-OFFSET           PIC  9(09) COMP VALUE ZEROES.   08520001
008430     05  SAVE1-TTY-SEG-OFFSET     PIC  9(09) COMP VALUE ZEROES.   08530001
008440     05  SAVE2-TTY-SEG-OFFSET     PIC  9(09) COMP VALUE ZEROES.   08540001
008450/                                                                 08550001
008460 EJECT.                                                           08560001
008470 LINKAGE SECTION.                                                 08570001
008480 COPY CCLACCF.                                                    08580001
008490 COPY CCLACRF.                                                    08590001
008500 COPY CCLACDA.                                                    08600001
008520 COPY CCLAOPS.                                                    08620001
008530 COPY CCLATDA.                                                    08630001
008540 COPY CCLATB10.                                                   08640001
008570 COPY CCLACOA.                                                    08670001
008580*----------------------------------------------------------------*08680001
008590* THE FOLLOWING COPYBOOKS EACH REPRESENT A SEGMENT FOR CCSS.     *08690001
008600* CCLAMBHS WILL BECOME A PHYSICAL HEADER RECORD BY ITSELF;       *08700001
008610* THE REMAINDER BELOW WILL TOGETHER OCCUPY A SEPERATE PHYSICAL   *08710001
008620* TRANSACTION CCSS RECORD - ALL EXCEPT CCLAMKCS AND MFLG ARE     *08720001
008620* MANDATORY.  AT THIS TIME, ONLY CCLAMCOS CAN OCCUR VARIABLY     *08721001
008630* FROM 1 TO 100 TIMES.  CCLB600 NEEDS VISIBILITY TO THESE FOR    *08730001
008640* GENERATION OF NEW REPORTS, THE OTHERS ARE IN WORKING STORAGE.  *08740001
008660*----------------------------------------------------------------*08760001
008670 COPY CCLAMBHS.                                                   08770001
008680 COPY CCLAMCOS.                                                   08780001
       COPY CCLAMEMP.                                                   08781001
008690 COPY CCLAMKCS.                                                   08790001
008700 COPY CCLAMTBI.                                                   08800001
008710 COPY CCLAMTBS.                                                   08810001
008720 COPY CCLAMTKI.                                                   08820001
008730 COPY CCLAMTKS.                                                   08830001
008740 EJECT.                                                           08840001
008750 PROCEDURE DIVISION USING                                         08850001
008760             CCF-COMMON-CONTROL-FLAGS,                            08860001
008770             CRF-COMMON-RECORD-FORMAT,                            08870001
008780             CDA-CONSUMER-DATA-AREA,                              08880001
008800             OPS-CONTROL-OPTIONS,                                 08900001
008810             TDA-TRADE-DATA-AREA,                                 08910001
008820             TB10-ZIP-CODE-RANGES,                                08920001
008850             COA-SEG-TOTALS-EXCEPTION-AREA,                       08950001
008860             CCSS-REPORTER-BATCH-HEADER,                          08960001
008870             CCSS-REPORTER-CONSUMER,                              08970001
                   CCSS-REPORTER-EMPLOYMENT-DATA,                       08971001
008880             CCSS-REPORTER-KEY-CHANGE,                            08980001
008890             CCSS-REPORTER-TRADE-BASE-INDS,                       08990001
008900             CCSS-REPORTER-TRADE-BASE,                            09000001
008910             CCSS-REPORTER-TRADE-KEY-INDS,                        09010001
008920             CCSS-REPORTER-TRADE-KEY.                             09020001
008930 EJECT.                                                           09030001
008940******************************************************************09040001
008950 00000-MAINLINE.                                                  09050001
008960******************************************************************09060001
008980     IF PRIOR-REPORTER-EOF-YES                                    09080001
008990         DISPLAY CNST-EOF-WARN-MSG                                09090001
009000         GOBACK.                                                  09100001
009010                                                                  09110001
009020*----------------------------------------------------------------*09120001
009030* OPEN & CLOSE OF BOTH THE TRADE FILE AND THE LEGAL FILE HAS     *09130001
009040* BECOME NECESSARY REGARDLESS OF WHETHER THE CURRENT RUN IS FOR  *09140001
009050* TRADE OR LEGAL DATA.  THIS ALLOWS A NEW SUBSEQUENT IDCAMS      *09150001
009060* JOBSTEP TO SUCCESSFULY DETERMINE WHICH OF THE TWO FILES IS     *09160001
009070* IN FACT EMPTY.  LEGAL MODULE CCLC645 HAS THIS SAFEGUARD AND    *09170001
009080* THE MODULE THAT CALLS THIS ONE WILL CALL BOTH C640 AND C645    *09180001
009090* AT LEAST ONCE REGARDLESS.                                      *09190001
009100*                                                                *09200001
009110* FIX 04/22/94: THE CCSS TRADE FILE MUST ALSO BE OPENED AND      *09210001
009120* CLOSED WITHOUT PROCESSING IF THIS IS A TRADE RUN, AND          *09220001
009130* EVERYTHING IS RECYCLED OR DISCARDED; IN THIS EVENT, C640       *09230001
009140* IS CALLED ONCE AT THE END-OF-FILE CONDITION FOR THE INPUT.     *09240001
009150* THE ANALOGOUS SITUATION ON THE LEGAL SIDE IS ALREADY           *09250001
009160* WORKING IN CCLC645 - NO CHANGE NEEDED THERE.                   *09260001
009170*----------------------------------------------------------------*09270001
009180     IF OPS-04-LEGAL OR                                           09280001
009190        (FIRST-TIME-CALL AND CCF-EOF-REPORTER-DATA)               09290001
009200         SET PRIOR-REPORTER-EOF-YES TO TRUE                       09300001
009210         PERFORM 9A000-OPEN-OUTPUT-CCSS                           09310001
009220         PERFORM 9B000-CLOSE-CCSS                                 09320001
009230         IF  NOT OPS-04-LEGAL                                     09330001
009240             PERFORM 9C000-WRITE-SORT-INFO                        09340001
009250         END-IF                                                   09350001
009260         GOBACK                                                   09360001
009270     END-IF.                                                      09370001
009280                                                                  09380001
009290     PERFORM 0A000-GET-TRADE-KEY.                                 09390001
009300     IF NOT CCF-EOF-REPORTER-DATA                                 09400001
009310         PERFORM 0B000-CHECK-TRADE-KEY                            09410001
009320     ELSE                                                         09420001
009330         SET PRIOR-REPORTER-EOF-YES TO TRUE                       09430001
009340         IF TRANS-OUTPUT-PENDING                                  09440001
009350             PERFORM 11000-CCSS-OUTPUT                            09450001
009360             SET TRANS-OUTPUT-UNDETERMINED TO TRUE                09460001
009370         END-IF                                                   09470001
009380         PERFORM 9B000-CLOSE-CCSS                                 09480001
009390         PERFORM 9C000-WRITE-SORT-INFO.                           09490001
009400                                                                  09500001
009410     GOBACK.                                                      09510001
009420                                                                  09520001
009430 EJECT.                                                           09530001
009440******************************************************************09540001
009450 0A000-GET-TRADE-KEY.                                             09550001
009460******************************************************************09560001
009470*----------------------------------------------------------------*09570001
009480*   0A000-GET-TRADE-KEY.                                         *09580001
009490*   PERFORMED FROM: 00000-MAINLINE                               *09590001
009500*   PASSED PARAMETER REQUIREMENTS: NONE                          *09600001
009510*   FUNCTION: LOAD TRADE KEY PASSED BY THE CALLER INTO           *09610001
009520*             WORKING STORAGE.                                   *09620001
009530*----------------------------------------------------------------*09630001
009540     MOVE CCF-OUTPUT-TO-CCSS-FLAG TO WS-OUTPUT-TO-CCSS-FLAG.      09640001
009550     MOVE CCF-REPORTER-D-NUMBER  TO TRADE-KEY-CURR-VENDOR-ID.     09650001
009560                                                                  09660001
009570     MOVE TDA-CYCLE-IDENTIFIER TO TRADE-KEY-CURR-CYCLE-ID.        09670001
009580                                                                  09680001
009590     MOVE TRADE-KEY-CURR-SIN-NUM TO WS-SAVE-PREV-SIN-NUM.         09690001
009600     MOVE TDA-SUBCODE-7-BYTES    TO TRADE-KEY-CURR-SIN-NUM.       09700001
009610*     NEW SOURCE IN TDA COMING FOR THIS PER GREG L (B YUSKO)  -*  09710001
009620*     NEW SOURCE IN PLACE 11/8 PER STEVE K.                   -*  09720001
009630                                                                  09730001
009640     MOVE TRADE-KEY-CURR-ACCT-ID TO WS-SAVE-PREV-ACCT-ID.         09740001
009650     MOVE TDA-ACCOUNT-NUMBER     TO TRADE-KEY-CURR-ACCT-ID.       09750001
009660*--------------------------------------------------------------*  09760001
009670* JUST USE MMDDYY FOR THE CONTROL BREAK AREA - GET THE         *  09770001
009680* CENTURY AND DO THE 10 CHAR WITH '/'S LATER WHEN              *  09780001
009690* POPULATING THE CCSS TRADE KEY SEGMENT.                       *  09790001
009700*--------------------------------------------------------------*  09800001
009710     IF TDA-VALID-DATE-OPENED                                     09810001
009720         MOVE TDA-DATE-OPENED  TO TRADE-KEY-CURR-OPEN-DATE        09820001
009730     ELSE                                                         09830001
009740         IF CRF-DATE-OPENED = ZEROES OR SPACES                    09840001
                  OR (OPS-03-OLD-METRO AND CRF-DO-SIX-BYTES = ZEROES)   09850001
009750             MOVE SPACES         TO TRADE-KEY-CURR-OPEN-DATE      09860001
009760         ELSE                                                     09870001
009770             MOVE CRF-DATE-OPENED TO TRADE-KEY-CURR-OPEN-DATE     09880001
009780         END-IF                                                   09890001
009790     END-IF.                                                      09900001
009800                                                                  09910001
009810     MOVE TDA-ACCOUNT-TYPE   TO TRADE-KEY-CURR-ACCT-TYPE.         09920001
009820                                                                  09930001
009830*----------------------------------------------------------------*09940001
009840* ENSURE CONTROL BREAK FOR THE FIRST CALL - TRADE-KEY-SAVE-AREA  *09950001
009850* INITIALIZATION IS SPACES.                                      *09960001
009860*----------------------------------------------------------------*09970001
009870     IF (FIRST-TIME-CALL) AND                                     09980001
009880        (TRADE-KEY-CURRENT EQUAL SPACES)                          09990001
009890         MOVE ZEROES  TO TRADE-KEY-SAVE-AREA.                     10000001
009900                                                                  10010001
009910*----------------------------------------------------------------*10020001
009920* PR41002C SEP 1.2.1.4 DATAPREP 2 (DATAPREP 1 TRS 4.1.2.7.7):    *10030001
009930* FOR THE CCSS SAMPLE REPORTS                                    *10040001
009940*                                                                *10050001
009950* ENSURE THAT THE MAIN HEADER IS WRITTEN ONLY IF THERE IS AT     *10060001
009960* LEAST ONE VALID TRANSACTION THAT IS ALSO GOING TO FILE.        *10070001
009970*----------------------------------------------------------------*10080001
009980     IF (MAIN-HEADER-WRITTEN-N) AND                               10090001
009990        (NOT FIRST-TIME-CALL)   AND                               10100001
010000        (WS-OUTPUT-TO-CCSS)                                       10110001
010010         PERFORM 45000-CCSS-WRITE                                 10120001
010020         SET MAIN-HEADER-WRITTEN-Y TO TRUE.                       10130001
010030 EJECT.                                                           10140001
010040******************************************************************10150001
010050 0B000-CHECK-TRADE-KEY.                                           10160001
010060******************************************************************10170001
010070*----------------------------------------------------------------*10180001
010080*   0B000-CHECK-TRADE-KEY.                                       *10190001
010090*   PERFORMED FROM: 00000-MAINLINE                               *10200001
010100*   PASSED PARAMETER REQUIREMENTS: NONE                          *10210001
010110*   FUNCTION: DRIVER CHECKS TO SEE IF THIS IS THE TRADE KEY HAS  *10220001
010120*             CHANGED AND BRANCHES ACCORDINGLY.  THE CHANGE      *10230001
010130*             IN TRADE KEY TEST IS ALSO SATISFIED WHEN THIS      *10240001
010140*             IS THE FIRST CALL TO THIS PROGRAM.                 *10250001
010150*----------------------------------------------------------------*10260001
010160     IF TRADE-KEY-SAVE-AREA NOT EQUAL TRADE-KEY-CURRENT           10270001
010170         MOVE TRADE-KEY-CURRENT       TO TRADE-KEY-SAVE-AREA      10280001
010180         PERFORM 10000-CHANGE-TRADE-KEY                           10290001
010190     ELSE                                                         10300001
010200         IF CCF-BASE-SEG                                          10310001
010210            PERFORM 10000-CHANGE-TRADE-KEY.                       10320001
010220                                                                  10330001
010230     PERFORM 12000-LOAD-TRADE-SEGMENT.                            10340001
010240     PERFORM 30000-PROCESS-CONSUMER-SEG.                          10350001
010250     PERFORM 40000-LOAD-OPTIONALS.                                10360001
010260*----------------------------------------------------------------*10370001
010270* 11/08 PR41002C: AS SOON AS WE HAVE VALID BASE DATA FOR THIS    *10380001
010280* TRADE KEY - THE TRANSACTION MUST BE FLAGGED FOR OUTPUT AT      *10390001
010290* TRADE KEY CONTROL BREAK TIME; ALSO, THE DATA FROM THE FIRST    *10400001
010300* VALID TRADE BASE FOUND MUST BE SAVED.  CCSS SAMPLE REPORTS     *10410001
010310* HAS INTRODUCED THE POSSIBILITY THAT THIS PGM MAY BE CALLED     *10420001
010320* FOR DISCARD AND/OR BYPASS TRANSACTIONS.                        *10430001
010330*----------------------------------------------------------------*10440001
010340     IF (WS-OUTPUT-TO-CCSS) AND                                   10450001
010350        (TRANS-OUTPUT-UNDETERMINED)                               10460001
010360         SET TRANS-OUTPUT-PENDING TO TRUE                         10470001
010370         PERFORM 11100-GATHER-SEGS-TO-REC.                        10480001
010380                                                                  10490001
010390 EJECT.                                                           10500001
010400******************************************************************10510001
010410 10000-CHANGE-TRADE-KEY.                                          10520001
010420******************************************************************10530001
010430*----------------------------------------------------------------*10540001
010440*   10000-CHANGE-TRADE-KEY.                                      *10550001
010450*   PERFORMED FROM: 0B000-CHECK-TRADE-KEY                        *10560001
010460*   PASSED PARAMETER REQUIREMENTS: NONE                          *10570001
010470*   FUNCTION: DRIVER - PERF BATCH HEADER PROCESS ON FIRST TIME;  *10580001
010480*             PERFORM PROCESS TO SEND THE OLD TRANSACTION TO FILE*10590001
010490*             IF NEEDED.                                         *10600001
010500*----------------------------------------------------------------*10610001
010510     IF FIRST-TIME-CALL                                           10620001
010520         PERFORM 90000-FIRST-TIME-INIT                            10630001
010530*----------------------------------------------------------------*10640001
010540* DO PER TRANSACTION RE-INITIALIZATIONS.                         *10650001
010550*----------------------------------------------------------------*10660001
010560         PERFORM 55000-RE-INITIALIZE                              10670001
010570         PERFORM 9A000-OPEN-OUTPUT-CCSS                           10680001
010580         PERFORM 1C000-LOAD-MAIN-HEADER                           10690001
010590*----------------------------------------------------------------*10700001
010600* PR41002C SEP 1.2.1.4 DATAPREP 2 (DATAPREP 1 TRS 4.1.2.7.7):    *10710001
010610* FOR THE CCSS SAMPLE REPORTS                                    *10720001
010620*                                                                *10730001
010630* ENSURE THAT THE MAIN HEADER IS WRITTEN ONLY IF THERE IS AT     *10740001
010640* LEAST ONE VALID TRANSACTION THAT IS ALSO GOING TO FILE.        *10750001
010650*----------------------------------------------------------------*10760001
010660         IF WS-OUTPUT-TO-CCSS                                     10770001
010670             PERFORM 45000-CCSS-WRITE                             10780001
010680             SET MAIN-HEADER-WRITTEN-Y TO TRUE                    10790001
010690         END-IF                                                   10800001
010700         MOVE ERC-NO TO WS-FIRST-TIME-SW                          10810001
010710     ELSE                                                         10820001
010720         IF TRANS-OUTPUT-PENDING                                  10830001
010740             PERFORM 11000-CCSS-OUTPUT                            10840001
010750             SET TRANS-OUTPUT-UNDETERMINED TO TRUE.               10850001
010770*----------------------------------------------------------------*10860001
010780* OPTL- CONTROL FLAG NEEDED TO ENSURE THAT IF A TRADE CHANGE     *10870001
010790* NEEDS TO BE PROCESSED, IT IS POPULATED ON ONLY ONE OF THE      *10880001
010800* MANY POSSIBLE CALLS FOR THE CCSS TRANSACTION, AND TO KNOW TO   *10890001
010810* LOAD IT INTO THE OUTPUT AREA BEFORE THE TRANSACTION GOES TO    *10900001
010820* FILE.                                                          *10910001
010830*                                                                *10920001
010840* 03/11/94 IF THE E1 AND BASE ACCOUNT NUMBERS MATCH, WE WILL     *10930001
010850* NOT CREATE THE KEY CHANGE MKCS SEGMENT; WE USE THE SAME        *10940001
010860* ACCOUNT NUMBER FIELDS FOR THE COMPARE AS IN CCLB600.           *10950001
010870*----------------------------------------------------------------*10960001
010880                                                                  10970001
           IF MAIN-HEADER-WRITTEN-Y                                     10980001
010560        PERFORM 55000-RE-INITIALIZE.                              10990001
010940     MOVE SPACES  TO   WS-MESSAGE-OUT-FLAG.                       11050001
010950                                                                  11060001
010960     IF CCF-E1-DATA                                               11070001
01097         IF TDA-NEW-ACCT-NUM-ERROR                                 11080001
01097         OR TDA-NEW-ACCOUNT-NUMBER = TDA-OLD-ACCOUNT-NUMBER        11090001
                 CONTINUE                                               11100001
              ELSE                                                      11110001
010980           SET OPTL-TRCHG-LOAD-PENDING         TO TRUE            11120001
              END-IF                                                    11130001
           ELSE                                                         11140001
               IF CCF-L1-DATA                                           11150001
                  IF OPS-54-09-10-11-12                                 11160001
                  OR TDA-ACCTCHG-IND-INVALID                            11170001
                  OR TDA-NEW-ACCT-NUM-ERROR                             11180001
                  OR TDA-L1SIN-BYPASS                                   11190001
                  OR (TDA-CHANGE-ACCT-NUMBER AND                        11200001
                      TDA-NEW-ACCOUNT-NUMBER = TDA-OLD-ACCOUNT-NUMBER)  11210001
                  OR (TDA-CHANGE-SUBCODE AND (TDA-SUBCODE = TDA-L1SIN)) 11220001
                  OR (TDA-CHANGE-BOTH AND                               11230001
                      (TDA-NEW-ACCOUNT-NUMBER = TDA-OLD-ACCOUNT-NUMBER) 11240001
                      AND (TDA-SUBCODE = TDA-L1SIN))                    11250001
                     CONTINUE                                           11260001
                  ELSE                                                  11270001
010980               SET OPTL-TRCHG-LOAD-PENDING     TO TRUE.           11280001
010990                                                                  11290001
011000 EJECT.                                                           11300001
011010******************************************************************11310001
011020 1C000-LOAD-MAIN-HEADER.                                          11320001
011030******************************************************************11330001
011040*----------------------------------------------------------------*11340001
011050*    1C000-LOAD-MAIN-HEADER.                                     *11350001
011060*    PERFORMED FROM: 10000-CHANGE-TRADE-KEY.                     *11360001
011070*    PASSED PARAMETER REQUIREMENTS: INFORMATION FROM             *11370001
011080*       LINKAGE COPYBOOKS REQUIRED FOR THE TABLE 10              *11380001
011090*       PRIMARY HEADER RECORD.                                   *11390001
011100*    FUNCTION: POPULATE THE VENDOR ID TABLE 10 ZIP RANGE HEADER  *11400001
011110*              RECORD IN THE FORMAT FOR CCSS OUTPUT.             *11410001
011120*    02/26/96  REMOVED CODE THAT PLACED PARM DATE IN HEADER. LP  *11420001
011130*----------------------------------------------------------------*11430001
011140*---------------------------------------------------------------* 11440001
011150* LOAD TRADE KEY FOR SORTING; 'D' + VENDOR ID + LOW VALUES      * 11450001
011160* IN THE REST OF THE TRADE KEY AREA.                            * 11460001
011170*---------------------------------------------------------------* 11470001
011180     MOVE SPACES                 TO CCSS-REPORTER-BATCH-HEADER.   11480001
011190*---INITIALIZE TO RECORD LENGTH MINUS ZIP CODES TABLE ITEM   ---* 11490001
011200     ADD LENGTH OF CCSS-MBHS-BATCH-HEADER-PKG,                    11500001
011210         LENGTH OF CCSS-MBHS-BATCH-HEADER-DATA                    11510001
011220          GIVING CCSS-MBHS-LENGTH.                                11520001
011230     MOVE CNST-MBHS              TO CCSS-MBHS-PKG-ID.             11530001
011240     MOVE CNST-CURR-CCSS-VERSION TO CCSS-MBHS-VERSION.            11540001
011250     MOVE CCF-PARM-DB-NUMBER     TO CCSS-MBHS-SUBMIT-ID.          11550001
011260********                                                          11560001
011270* JC0823 - RELIABLE SOURCE=AF, NON RELIABLE SOURCE=AG FORM OPS11  11570001
011280********                                                          11580001
011290     IF OPS-11-FULL-NAME-ADDRESS                                  11590001
011300        MOVE CNST-VALUE-FNA-REPORTER  TO CCSS-MBHS-UPDATE-SRC-ID  11600001
011310     ELSE                                                         11610001
011320        MOVE CNST-VALUE-NFNA-REPORTER TO CCSS-MBHS-UPDATE-SRC-ID  11620001
011330     END-IF                                                       11630001
011340                                                                  11640001
011350     MOVE TRADE-KEY-CURRENT      TO CCSS-MBHS-TRADE-KEY-DATA.     11650001
011360** JC 06/21/95 - INIT SUBCODE TO ZEROS INSTEAD OF SPACE           11660001
011370     MOVE ZEROS                  TO CCSS-MBHS-SUBCODE.            11670001
011380     MOVE SPACES                 TO CCSS-MBHS-ACCOUNT-NUMBER,     11680001
011390                                    CCSS-MBHS-DATE-OPENED,        11690001
011400                                    CCSS-MBHS-ACCOUNT-TYPE.       11700001
011410     MOVE TRADE-KEY-CURR-CYCLE-ID TO CCSS-MBHS-CYCLE-ID.          11710001
011420     MOVE CCF-PARM-TYPE          TO CCSS-MBHS-PARM-TYPE.          11720001
011430     MOVE CCF-PARM-ID            TO CCSS-MBHS-PARM-ID.            11730001
011440                                                                  11740001
011450******************                                                11750001
011460* JC0502   ADD PARM ACTIVITY DATE TO CCSS BATCH HEADER            11760001
011470******************                                                11770001
011480* ICP      ADD PARM ACTIVITY DATE TO CCSS BATCH HEADER NEW DATE FI11780001
011490* 8/11/97  LMCCARTHY.                                             11790001
011500******************                                                11800001
011510     MOVE CCF-PARM-ACTIVITY-DATE TO WS-DATE-IN                    11810001
011520     SET SLASH-SEPARATOR            TO TRUE                       11820001
007310     MOVE WS-DATE-IN-MO-N        TO  WS-DATE-IN-MM-N              11830001
007320     MOVE WS-DATE-IN-DY-N        TO  WS-DATE-IN-DD-N              11840001
007330     MOVE WS-DATE-IN-YR-N        TO  WS-DATE-IN-YY-N              11850001
007330     MOVE CCF-PARM-ACTIVITY-CENTURY TO WS-DATE-IN-CC-N            11860001
011530     PERFORM 5A000-FORMAT-DATE                                    11870001
011560     MOVE WS-DATE-OUT               TO CCSS-MBHS-PARM-DATE        11880001
011630                                                                  11890001
011810     IF OPS-03-NEW-METRO                                          11900001
011820         SET MBHS-METRO2                         TO TRUE          11910001
011830     ELSE                                                         11920001
011840         SET MBHS-METRO1                         TO TRUE          11930001
011850     END-IF.                                                      11940001
                                                                        11950001
011640     EVALUATE TRUE                                                11960001
011670        WHEN OPS-04-BAL-HIST-PAYMENT-GRID                         11970001
011680            SET MBHS-BAL-HIST-PAY-GRID-RP        TO TRUE          11980001
011690        WHEN OPS-04-BAL-REG-PAYMENT-GRID                          11990001
011700            SET MBHS-BAL-REG-PAY-GRID-RP         TO TRUE          12000001
011710        WHEN OPS-04-BAL-HIST-GRID                                 12010001
011720            SET MBHS-BAL-HIST-GRID-RP            TO TRUE          12020001
011730        WHEN OPS-04-BAL-REG-GRID                                  12030001
011740            SET MBHS-BAL-REG-GRID-RP             TO TRUE          12040001
011770        WHEN OPS-04-BALANCE-NO-GRID                               12070001
011780            SET MBHS-BALANCE-NO-GRID             TO TRUE          12080001
011790     END-EVALUATE.                                                12090001
011800                                                                  12100001
011810     IF OPS-04-GRID-MAINT                                         12110001
011820         SET MBHS-AUTO-GRID-MNT                  TO TRUE          12120001
011830     ELSE                                                         12130001
011840         SET MBHS-NO-AUTO-GRID-MNT               TO TRUE          12140001
011850     END-IF.                                                      12150001
011950                                                                  12160001
012020     IF OPS-10-LAST-FIRST-MID                                     12170001
012030         SET MBHS-NAMES-IN-LFM-ORDER        TO TRUE               12180001
012040     ELSE                                                         12190001
               IF OPS-10-FIRST-MID-LAST                                 12200001
012050            SET MBHS-NAMES-IN-FML-ORDER     TO TRUE               12210001
               ELSE                                                     12220001
                  IF OPS-10-LFM-PARSED                                  12230001
                  OR OPS-10-LFM-PARSED-W-COMMA
012050               SET MBHS-NAMES-IN-LFP-ORDER  TO TRUE               12240001
                  ELSE                                                  12250001
                     IF OPS-10-FML-PARSED                               12260001
012050                  SET MBHS-NAMES-IN-FMP-ORDER TO TRUE             12270001
012060     END-IF.                                                      12280001
012070                                                                  12290001
012080     IF OPS-11-FULL-NAME-ADDRESS                                  12300001
012090         SET MBHS-RELIABLE-NAMES-ADDRS      TO TRUE               12310001
012100     ELSE                                                         12320001
012110         SET MBHS-NO-RELIABLE-NAMES-ADDRS   TO TRUE               12330001
012120     END-IF.                                                      12340001
012130                                                                  12350001
           MOVE 'N'                               TO FILLER1.

012330     IF OPS-55-VERIFY-ACCT-NUM-YES                                12490001
012340         SET MBHS-ACCTNO-SCRAMBLED-YES      TO TRUE               12500001
012350     ELSE                                                         12510001
012360         SET MBHS-ACCTNO-SCRAMBLED-NO       TO TRUE               12520001
012370     END-IF.                                                      12530001

012380     MOVE OPS-70-ACCT-HIST-DRVD-IND      TO                       12540001
012390          CCSS-MBHS-RPTR-AC-HIST-DRVD-I.                          12550001
012400     MOVE OPS-70-TRADE-ASSOC-IND         TO                       12560001
012410          CCSS-MBHS-RPTR-TRADE-ASSOC-I.                           12570001
012420     MOVE OPS-70-LOAN-ASSUMPTION-IND     TO                       12580001
012430          CCSS-MBHS-RPTR-LOAN-ASSUMP-I.                           12590001
           MOVE OPS-70-HIGH-CREDIT-IND         TO
               CCSS-MBHS-HIGH-CREDIT-AMOUNT-I.
           MOVE OPS-70-ADVANCED-BILL-DATE-IND  TO
                CCSS-MBHS-ADVANCED-BILL-DATE-I.
012460     MOVE OPS-70-HIGH-BALANCE-BYPASS-IND TO                       12600001
012470          CCSS-MBHS-HI-BALANCE-BYPASS-I.                          12610001
012480     MOVE OPS-70-SEP-INSTALL-REC-IND     TO                       12620001
012490          CCSS-MBHS-RP-SEP-INSTL-REC-I.                           12630001
012500     MOVE OPS-70-SEP-NON-INSTALL-REC-IND TO                       12640001
012510          CCSS-MBHS-RP-SEP-NOINSTL-REC-I.                         12650001
012540     MOVE OPS-70-VIN-PORTF-ACQD-IND TO                            12660001
012550          CCSS-MBHS-VIN-PORTF-ACQD-I.                             12670001
012540     MOVE OPS-70-LIMITED-SSN-IND TO                               12660001
012550          CCSS-MBHS-LIMITED-SSN-I.                                12670001
012560*** ICP7864                                                       12680001
012570     MOVE OPS-71-DATE-OF-ACTION-IND TO                            12690001
012580          CCSS-MBHS-DATE-OF-ACTION-IND.                           12700001
012590     MOVE OPS-72-DATE-OPENED-IND TO                               12710001
012600          CCSS-MBHS-RELIABLE-DO-IND.                              12720001
012610*---------------------------------------------------------------* 12730001
012620* LOAD THE ZIP CODE RANGE TABLE FROM CCLATB10 BEFORE LOADING    * 12740001
012630* THE SEGMENT ID AREA - THE ZIP AREA LENGTH AND NUMBER OF       * 12750001
012640* OCCURENCES TO GO INTO THE ID AREA WILL ONLY BE KNOWN AFTER    * 12760001
012650* THE ZIP CODE LOAD IS COMPLETE..                               * 12770001
012660* STARTING DESTINATION OFFSET IS 1 AFTER END OF FIXED AREA.     * 12780001
012670*---------------------------------------------------------------* 12790001
012680     MOVE SPACES                 TO CCSS-MBHS-ZIP-AREA.           12800001
012690     MOVE ZEROES                 TO CCSS-MBHS-NUMBER-OF-ZIPS,     12810001
012700                                    FMT-LEN.                      12820001
012710     ADD CNST-VALUE-1 CCSS-MBHS-LENGTH                            12830001
012720        GIVING TTY-SEG-OFFSET.                                    12840001
012740     PERFORM 1C100-LOAD-TABLE-10                                  12860001
012750        VARYING TB10-INDEX1 FROM CNST-VALUE-1 BY CNST-VALUE-1     12870001
012760        UNTIL TB10-ITEM (TB10-INDEX1) = HIGH-VALUES               12880001
                 OR TB10-INDEX1 > TLC-TB10-MAX-ENTRIES.
012770                                                                  12890001
012780*---------------------------------------------------------------* 12900001
012790* IF NOTHING WAS LOADED, MOVE IN DEFAULT ZIP RANGE INTO         * 12910001
012800* THE FIRST OUTPUT ZIP TABLE OCCURRENCE.                        * 12920001
012810*---------------------------------------------------------------* 12930001
012820     IF CCSS-MBHS-NUMBER-OF-ZIPS EQUAL ZEROES                     12940001
012830         MOVE CNST-VALUE-1 TO CCSS-MBHS-NUMBER-OF-ZIPS            12950001
012840         MOVE CNST-DEFAULT-ZIP-RANGE  TO CCSS-MBHS-ZIP-AREA       12960001
012850         MOVE CCSS-MBHS-ZIP-AREA TO FMT-OUTPUT                    12970001
012860            (TTY-SEG-OFFSET : LENGTH OF CCSS-MBHS-ZIP-AREA)       12980001
012870         ADD LENGTH OF CCSS-MBHS-ZIP-AREA TO TTY-SEG-OFFSET.      12990001
012880                                                                  13000001
      *---------------------------------------------------------------* 13010001
      * THIS ROUTINE USED TO LOAD THE TABLE 14 SUBCODES FOR PORTFOLIO   13020001
      * ACQUIS TO THE HEADER RECORD.  WE NO LONGER USE TABLE 14         13021001
      * BUT WE STILL NEED TO SET THE NUMBER OF SUBS TO ZEROES           13022001
      * AND ADJUST THE OFFSET OF THE RECORD SO THAT THE FILE LAYOUT     13023001
      * FOR TRADE WILL REMAIN THE SAME                                  13024001
      *---------------------------------------------------------------* 13030001
           MOVE ZEROES           TO CCSS-MBHS-NUMBER-OF-SUBS.           13040001
           MOVE TTY-SEG-OFFSET   TO SAVE1-TTY-SEG-OFFSET.               13050001
           ADD LENGTH OF CCSS-MBHS-NUMBER-OF-SUBS TO                    13070001
               TTY-SEG-OFFSET.                                          13080001
      *---------------------------------------------------------------* 13090001
      * THIS ROUTINE USED TO LOAD THE TABLE 15 VINS FOR PORTFOLIO       13101001
      * ACQD TO THE HEADER RECORD.  WE NO LONGER USE TABLE 15           13102001
      * BUT WE STILL NEED TO SET THE NUMBER OF SUBS TO ZEROES           13103001
      * AND ADJUST THE OFFSET OF THE RECORD SO THAT THE FILE LAYOUT     13104001
      * FOR TRADE WILL REMAIN THE SAME                                  13105001
      *---------------------------------------------------------------* 13110001
           MOVE ZEROES           TO CCSS-MBHS-NUMBER-OF-VIN.            13120001
           MOVE TTY-SEG-OFFSET   TO SAVE2-TTY-SEG-OFFSET.               13130001
           ADD LENGTH OF CCSS-MBHS-NUMBER-OF-VIN TO                     13150001
               TTY-SEG-OFFSET.                                          13160001
013150*---------------------------------------------------------------* 13270001
013160* LOAD TOTAL RECORD LENGTH INTO INTO THE INDICATOR FIELD;       * 13280001
013170* SET THE RDW.                                                  * 13290001
013180*---------------------------------------------------------------* 13300001
013190     COMPUTE CCSS-MBHS-LENGTH = CCSS-MBHS-LENGTH +                13310001
013200         (LENGTH OF CCSS-MBHS-ZIP-AREA *                          13320001
013210          CCSS-MBHS-NUMBER-OF-ZIPS) +                             13330001
013220          LENGTH OF CCSS-MBHS-NUMBER-OF-SUBS +                    13340001
013230         (LENGTH OF CCSS-MBHS-SUBCODE-AREA *                      13350001
013240          CCSS-MBHS-NUMBER-OF-SUBS) +                             13360001
013250          LENGTH OF CCSS-MBHS-NUMBER-OF-VIN +                     13370001
013260         (LENGTH OF CCSS-MBHS-VIN-AREA *                          13380001
013270          CCSS-MBHS-NUMBER-OF-VIN)                                13390001
013280      END-COMPUTE.                                                13400001
013290                                                                  13410001
013300      MOVE CCSS-MBHS-LENGTH TO FMT-LEN.                           13420001
013310      IF  CCSS-MBHS-LENGTH > WS-RECORD-LENGTH-SAVE                13430001
013320          MOVE CCSS-MBHS-LENGTH                                   13440001
013330                                  TO  WS-RECORD-LENGTH-SAVE.      13450001
013340*---------------------------------------------------------------* 13460001
013350* MOVE POPULATED FIXED WORK AREA INTO THE OUTPUT AREA - WE      * 13470001
013360* ARE NOW READY TO WRITE THE HEADER.                            * 13480001
013370*---------------------------------------------------------------* 13490001
013380      MOVE CNST-VALUE-1                    TO TTY-SEG-OFFSET.     13500001
013390      MOVE CCSS-MBHS-BATCH-HEADER-PKG      TO FMT-OUTPUT          13510001
013400        (TTY-SEG-OFFSET : LENGTH OF CCSS-MBHS-BATCH-HEADER-PKG).  13520001
013410      ADD LENGTH OF CCSS-MBHS-BATCH-HEADER-PKG TO TTY-SEG-OFFSET. 13530001
013420      MOVE CCSS-MBHS-BATCH-HEADER-DATA     TO FMT-OUTPUT          13540001
013430        (TTY-SEG-OFFSET : LENGTH OF  CCSS-MBHS-BATCH-HEADER-DATA).13550001
013440     MOVE SAVE1-TTY-SEG-OFFSET      TO TTY-SEG-OFFSET.            13560001
013450     MOVE CCSS-MBHS-NUMBER-OF-SUBS TO FMT-OUTPUT                  13570001
013460     (TTY-SEG-OFFSET : LENGTH OF CCSS-MBHS-NUMBER-OF-SUBS).       13580001
013470     MOVE SAVE2-TTY-SEG-OFFSET     TO TTY-SEG-OFFSET.             13590001
013480     MOVE CCSS-MBHS-NUMBER-OF-VIN  TO FMT-OUTPUT                  13600001
013490     (TTY-SEG-OFFSET : LENGTH OF CCSS-MBHS-NUMBER-OF-VIN).        13610001
013500                                                                  13620001
013510 EJECT.                                                           13630001
013520******************************************************************13640001
013530 1C100-LOAD-TABLE-10.                                             13650001
013540******************************************************************13660001
013550*----------------------------------------------------------------*13670001
013560*    1C100-LOAD-TABLE-10.                                        *13680001
013570*    PERFORMED FROM: 1C000-LOAD-MAIN-HEADER.                     *13690001
013580*    PASSED PARAMETER REQUIREMENTS: INFORMATION FROM             *13700001
013590*       LINKAGE COPYBOOKS REQUIRED FOR TABLE 10 (CCLATB10).      *13710001
013600*       CCLATB10 TABLE SUBSCRIPT SET TO CORRECT OCCURENCE.       *13720001
013610*       CORRECT OUTPUT AREA OFFSET VALUE IN POINTER FIELD.       *13730001
013620*    FUNCTION: POPULATE THE VENDOR ID TABLE 10 IN THE CCSS       *13740001
013630*              HEADER RECORD WITH ZIP CODE RANGES.               *13750001
013640*----------------------------------------------------------------*13760001
013650                                                                  13770001
013660     IF TB10-ITEM (TB10-INDEX1) IS NUMERIC                        13780001
013670        ADD CNST-VALUE-1 TO CCSS-MBHS-NUMBER-OF-ZIPS              13790001
013680        MOVE TB10-ITEM (TB10-INDEX1) TO CCSS-MBHS-ZIP-AREA        13800001
013690        MOVE CCSS-MBHS-ZIP-AREA TO FMT-OUTPUT                     13810001
013700        (TTY-SEG-OFFSET : LENGTH OF CCSS-MBHS-ZIP-AREA)           13820001
013710        ADD LENGTH OF CCSS-MBHS-ZIP-AREA TO                       13830001
013720            TTY-SEG-OFFSET.                                       13840001
013730                                                                  13850001
013770 EJECT.                                                           13890001
014290******************************************************************14410001
014300 11000-CCSS-OUTPUT.                                               14420001
014310******************************************************************14430001
014320*----------------------------------------------------------------*14440001
014330*    11000-CCSS-OUTPUT.                                          *14450001
014340*    PERFORMED FROM: 00000-MAINLINE.                             *14460001
014350*                    10000-CHANGE-TRADE-KEY.                     *14470001
014360*    PASSED PARAMETER REQUIREMENTS: NONE                         *14480001
014370*    FUNCTION: DRIVER FOR THE OUTPUT OF ONE NON HEADER RECORD    *14490001
014380*           TO THE CCSS FILE.                                    *14500001
014390*----------------------------------------------------------------*14510001
014400     PERFORM 11150-GATHER-MKCS-MTHE-TO-REC.                       14520001
014410     PERFORM 11200-LOAD-RDW.                                      14530001
014420     PERFORM 45000-CCSS-WRITE.                                    14540001
014430                                                                  14550001
014440     PERFORM 11300-RETURN-SUBCODE-TOTALS.                         14560001
014470 EJECT.                                                           14570001
014480******************************************************************14580001
014490 11100-GATHER-SEGS-TO-REC.                                        14590001
014500******************************************************************14600001
014510*----------------------------------------------------------------*14610001
014520*    11100-GATHER-SEGS-TO-REC.                                   *14620001
014530*    PERFORMED FROM: 0B000-CHECK-TRADE-KEY                       *14630001
014540*    PASSED PARAMETER REQUIREMENTS: CORRECT SEGMENT LENGTH VALUES*14640001
014550*       IN THE CORRESPONDING PACKAGE ID LENGTH FIELDS; CORRECT   *14650001
014560*       TOTAL COUNT OF CONSUMER SEGMENTS IN THIS TRANSACTION;    *14660001
014570*    FUNCTION: PLACE ALL MANDATORY ONE OCCURRENCE SEGMENTS       *14670001
014580*              ONTO THE OUTPUT RECORD TO PREPARE TO SEND THE     *14680001
014590*              DATA TO FILE.  INCLUDES ALL SEGMENTS EXCEPT       *14690001
014600*              MCOS (CONSUMER), MKCS (OPTIONAL TRADE KEY         *14700001
014610*              CHANGE) AND MTHE (TRANSACTION END SEG).           *14710001
014620*----------------------------------------------------------------*14720001
014630                                                                  14730001
014640     MOVE CNST-VALUE-1                 TO TTY-SEG-OFFSET.         14740001
014650     MOVE CCSS-REPORTER-TRANS-HDR      TO FMT-OUTPUT              14750001
014660         (TTY-SEG-OFFSET : CCSS-MTHS-LENGTH).                     14760001
014670     ADD CNST-VALUE-1                  TO CCSS-MTHE-TRAN-SEG-QTY. 14770001
014680                                                                  14780001
014690     ADD CCSS-MTHS-LENGTH                  TO TTY-SEG-OFFSET.     14790001
014700     MOVE CCSS-REPORTER-TRADE-KEY          TO FMT-OUTPUT          14800001
014710         (TTY-SEG-OFFSET : CCSS-MTKS-LENGTH).                     14810001
014720     ADD CNST-VALUE-1                  TO CCSS-MTHE-TRAN-SEG-QTY. 14820001
014730                                                                  14830001
014740     ADD CCSS-MTKS-LENGTH                  TO TTY-SEG-OFFSET.     14840001
014750     MOVE CCSS-REPORTER-TRADE-KEY-INDS     TO FMT-OUTPUT          14850001
014760         (TTY-SEG-OFFSET : CCSS-MTKI-LENGTH).                     14860001
014770     ADD CNST-VALUE-1                  TO CCSS-MTHE-TRAN-SEG-QTY. 14870001
014780                                                                  14880001
           MOVE CCSS-MTBS-STATUS-CODE            TO WS-SAVE-STATUS.
           MOVE CCSS-MTBI-STATUS-CODE-I          TO WS-SAVE-STATUS-I.
014790     ADD CCSS-MTKI-LENGTH                  TO TTY-SEG-OFFSET.     14890001
014800     MOVE CCSS-REPORTER-TRADE-BASE         TO FMT-OUTPUT          14900001
014810         (TTY-SEG-OFFSET : CCSS-MTBS-LENGTH).                     14910001
014870     ADD CNST-VALUE-1                   TO CCSS-MTHE-TRAN-SEG-QTY.14970001
014880                                                                  14980001
014890     ADD CCSS-MTBS-LENGTH               TO TTY-SEG-OFFSET.        14990001
014900     MOVE CCSS-REPORTER-TRADE-BASE-INDS TO FMT-OUTPUT             15000001
014910         (TTY-SEG-OFFSET : CCSS-MTBI-LENGTH).                     15010001
014930     ADD CCSS-MTBI-LENGTH               TO TTY-SEG-OFFSET.        15030001
014940     ADD CNST-VALUE-1                   TO CCSS-MTHE-TRAN-SEG-QTY.15040001
014950                                                                  15050001
014960******************************************************************15060001
014970 11150-GATHER-MKCS-MTHE-TO-REC.                                   15070001
014980******************************************************************15080001
014990*----------------------------------------------------------------*15090001
015000*    11150-GATHER-MKCS-MTHE-TO-REC                               *15100001
015010*    PERFORMED FROM: 11000-CCSS-OUTPUT.                          *15110001
015020*    PASSED PARAMETER REQUIREMENTS: COUNT OF CONSUMER SEGS       *15120001
015030*       LOADED; SEGMENT LENGTHS; COUNT OF ALL SEGMENTS LOADED;   *15130001
015040*       FLAG TO LOAD/NOT LOAD OPTIONAL MKCS SEGMENT.             *15140001
015050*    FUNCTION: PLACE LAST 2 SEGMENTS IN THE OUTPUT RECORD        *15150001
015060*    BEGINNING AT THE CORRECT VARIABLE OFFSET DETERMINED         *15160001
015070*    BY THE NUMBER OF CONSUMER SEGS ALREADY LOADED.  MKCS        *15170001
015080*    SEGMENT IS OPTIONAL. UPDATES COUNT IN MTHE SEGMENT          *15180001
015090*    BEFORE LOADING IT.                                          *15190001
015100*----------------------------------------------------------------*15200001
015110     COMPUTE TTY-SEG-OFFSET = CNST-VALUE-1     +                  15210001
015120         CCSS-MTHS-LENGTH  +  CCSS-MTKS-LENGTH +                  15220001
015130         CCSS-MTKI-LENGTH  +  CCSS-MTBS-LENGTH +                  15230001
015140         CCSS-MTBI-LENGTH  +                                      15240001
015150        (WS-CNSMR-LOADED-TOTL * CCSS-MCOS-LENGTH).                15250001
015160*---------------------------------------------------------------* 15260001
015170*  HERE, WE MOVE IN THE NEXT SINGLE SEGMENT AFTER THE END       * 15270001
015180*  OF THE MULTIPLE CONSUMER SEGMENT WHICH MUST HAVE ALREADY     * 15280001
015190*  BEEN INSERTED INTO THE CORRECT LOCATION OF THE OUTPUT AREA.  * 15290001
015200*---------------------------------------------------------------* 15300001
015210*  07/15/96 MFLG SEGMENT IS OPTIONAL. UPDATES THE COUNT IN      * 15310001
015220*    MTHE SEGMENT BEFORE LOADING IT.   ICP 4102  LPISCH         * 15320001
015230*---------------------------------------------------------------* 15330001
015240     IF OPTL-TRCHG-OUTPUT-PENDING                                 15340001
015260         MOVE CCSS-REPORTER-KEY-CHANGE     TO FMT-OUTPUT          15360001
015270         (TTY-SEG-OFFSET : CCSS-MKCS-LENGTH)                      15370001
015280         ADD CCSS-MKCS-LENGTH          TO TTY-SEG-OFFSET          15380001
015290         ADD CNST-VALUE-1              TO CCSS-MTHE-TRAN-SEG-QTY. 15390001
015300                                                                  15400001
015310                                                                  15410001
015320     IF OPTL-MSG-OUTPUT-PENDING                                   15420001
015330         SET OPTL-MSG-NO-LOAD            TO TRUE                  15430001
015340         MOVE CCSS-REPORTER-MESSAGE-FLAG                          15440001
015350                                           TO FMT-OUTPUT          15450001
015360         (TTY-SEG-OFFSET : CCSS-MFLG-LENGTH)                      15460001
015370         ADD CCSS-MFLG-LENGTH          TO TTY-SEG-OFFSET          15470001
015380         ADD CNST-VALUE-1              TO CCSS-MTHE-TRAN-SEG-QTY. 15480001
015390                                                                  15490001
015320     IF OPTL-EMP-OUTPUT-PENDING                                   15491004
015330         SET OPTL-EMP-NO-LOAD            TO TRUE                  15492004
015340         MOVE CCSS-REPORTER-EMPLOYMENT-DATA                       15493009
015350                                           TO FMT-OUTPUT          15494004
015360         (TTY-SEG-OFFSET : CCSS-MEMP-LENGTH)                      15495004
015370         ADD CCSS-MEMP-LENGTH          TO TTY-SEG-OFFSET          15496004
015380         ADD CNST-VALUE-1              TO CCSS-MTHE-TRAN-SEG-QTY. 15497004
015390                                                                  15498004
015400     ADD CNST-VALUE-1 TO CCSS-MTHE-TRAN-SEG-QTY.                  15500001
015410     MOVE CCSS-REPORTER-TRANS-HDR-END      TO FMT-OUTPUT          15510001
015420         (TTY-SEG-OFFSET : CCSS-MTHE-LENGTH).                     15520001
015430         ADD CCSS-MTHE-LENGTH              TO TTY-SEG-OFFSET.     15530001
015440 EJECT.                                                           15540001
015450******************************************************************15550001
015460 11200-LOAD-RDW.                                                  15560001
015470******************************************************************15570001
015480*----------------------------------------------------------------*15580001
015490*    11200-LOAD-RDW.                                             *15590001
015500*    PERFORMED FROM: 11000-CCSS-OUTPUT.                          *15600001
015510*    PASSED PARAMETER REQUIREMENTS: DATA LOAD INTO OUTPUT        *15610001
015520*       AREA MUST BE COMPLETE (11150-) GIVING AN ENDING OFFSET   *15620001
015530*       VALUE THAT CAN BE CONVERTED INTO A VARIABLE RECORD       *15630001
015540*       LENGTH. OFFSET EXPECTED IS 1 BYTE BEYOND THE LAST BYTE   *15640001
015550*       OF DATA LOADED.                                          *15650001
015560*    FUNCTION: PUT THE ACCUMULATED VARIABLE RECORD LENGTH        *15660001
015570*              PLUS 4 BYTES INTO THE RDW PRIOR TO OUTPUT.        *15670001
015580*----------------------------------------------------------------*15680001
015590*---------------------------------------------------------------* 15690001
015600* -CNST-VALUE-1 MEANS: MINUS 1 TO REMOVE INITIAL COLUMN 1       * 15700001
015610* SETTING GIVES THE TRUE VARIABLE REC LENGTH.                   * 15710001
015620*---------------------------------------------------------------* 15720001
015630     COMPUTE WS-VARIABLE-RECORD-LENGTH =                          15730001
015640        TTY-SEG-OFFSET - CNST-VALUE-1.                            15740001
015650     MOVE WS-VARIABLE-RECORD-LENGTH TO FMT-LEN.                   15750001
015660     IF  WS-VARIABLE-RECORD-LENGTH > WS-RECORD-LENGTH-SAVE        15760001
015670         MOVE WS-VARIABLE-RECORD-LENGTH                           15770001
015680                                 TO  WS-RECORD-LENGTH-SAVE.       15780001
015690     ADD WS-VARIABLE-RECORD-LENGTH                                15790001
015700                                 TO  WS-RECORD-LENGTH-TOTAL.      15800001
015710                                                                  15810001
015720 EJECT.                                                           15820001
015730******************************************************************15830001
015740 11300-RETURN-SUBCODE-TOTALS.                                     15840001
015750******************************************************************15850001
015760*----------------------------------------------------------------*15860001
015770*    11300-RETURN-SUBCODE-TOTALS.                                *15870001
015780*    PERFORMED FROM: 11000-CCSS-OUTPUT.                          *15880001
015790*    PASSED PARAMETER REQUIREMENTS: SEGMENT COUNTS FOR           *15890001
015800*                                   CURRENT SUBCODE              *15900001
015810*    FUNCTION: PASS STATISTICAL TOTALS AT END-OF-FILE            *15910001
015820*              BACK TO THE CALLING PROGRAM; MAINTAIN             *15920001
015830*              EXCEPTION TOTAL COUNTS THAT ARE                   *15930001
015840*              UPDATEABLE AT TRANSACTION OUTPUT TIME.            *15940001
015850*----------------------------------------------------------------*15950001
015860*----------------------------------------------------------------*15960001
015870* KEEP TRACK OF:                                                 *15970001
015880*                                                                *15980001
015890*    1. COUNT OF TRANSACTIONS THAT HAD A CONSUMER SEGMENT        *15990001
015900*       COUNT OVERFLOW (THE EXCESS OVER 100 ARE NOT GOING TO     *16000001
015910*       FILE).                                                   *16010001
015920*                                                                *16020001
015930*    2. THE HIGHEST PER-TRANSACTION-COUNT OF CONSUMER SEGMENTS   *16030001
015940*       FOR ALL OF THE TRANSACTIONS.                             *16040001
015950*                                                                *16050001
015960*----------------------------------------------------------------*16060001
015970     IF WS-TRAN-CNSMR-TOTL > CNST-MAX-CONSUMERS                   16070001
015980         ADD CNST-VALUE-1     TO WS-TRAN-CSMR-QTY-OVERLIM.        16080001
015990     IF WS-TRAN-CNSMR-TOTL > WS-HI-CSMR-PER-TRANS                 16090001
016000         MOVE WS-TRAN-CNSMR-TOTL TO WS-HI-CSMR-PER-TRANS.         16100001
016010                                                                  16110001
016020*----------------------------------------------------------------*16120001
016030*  PASS OVERFLOW INFO FOR EACH TRANSACTION WHERE A CONSUMER      *16130001
016040*  SEGMENT COUNT OVERFLOW OCCURED: FIRST CONSUMER NAME:          *16140001
016050*  TRANS ACCT & SUBCODE INFORMATION; AND THE TOTAL CONSUMER      *16150001
016060*  SEGMENT COUNT (THIS VALUE MUST BE OVER THE LIMIT -            *16160001
016070*  CURRENTLY SET TO 100).                                        *16170001
016080*----------------------------------------------------------------*16180001
016090     IF WS-TRAN-CNSMR-TOTL > CNST-MAX-CONSUMERS                   16190001
016100         MOVE WS-SAVE-FIRST-CONSUMER    TO COA-CONSUMER-NAME      16200001
016110         MOVE WS-SAVE-PREV-SIN-NUM      TO COA-SUB-CODE           16210001
016120         MOVE WS-SAVE-PREV-ACCT-ID      TO COA-ACCOUNT-ID         16220001
016130         MOVE WS-TRAN-CNSMR-TOTL        TO COA-CONSUMER-COUNT     16230001
016140         IF COA-CONSUMER-NAME = SPACES                            16240001
016150             MOVE CNST-FIRST-NAME-MISSING TO COA-CONSUMER-NAME    16250001
016160         END-IF                                                   16260001
016170     END-IF.                                                      16270001
016180                                                                  16280001
016190*----------------------------------------------------------------*16290001
016200* PASS END OF FILE CONSUMER SEGMENT OVERFLOW TOTALS TO THE       *16300001
016210* CALLING PROGRAM.                                               *16310001
016220*----------------------------------------------------------------*16320001
016230     IF CCF-EOF-REPORTER-DATA                                     16330001
016240         MOVE WS-TRAN-CSMR-QTY-OVERLIM TO                         16340001
016250              COA-TRAN-CSMR-QTY-OVERLIM                           16350001
016260         MOVE WS-HI-CSMR-PER-TRANS TO                             16360001
016270              COA-HI-CSMR-PER-TRANS.                              16370001
016280                                                                  16380001
016290 EJECT.                                                           16390001
016300******************************************************************16400001
016310 12000-LOAD-TRADE-SEGMENT.                                        16410001
016320******************************************************************16420001
016330*----------------------------------------------------------------*16430001
016340*    12000-LOAD-TRADE-SEGMENT.                                   *16440001
016350*    PERFORMED FROM: 0B000-CHECK-TRADE-KEY.                      *16450001
016360*                    10000-CHANGE-TRADE-KEY.                     *16460001
016370*    PASSED PARAMETER REQUIREMENTS: NONE                         *16470001
016380*    FUNCTION: DRIVER TO LOAD ALL OF THE TRADE SEGMENT PACKAGES  *16480001
016390*              INTO THE CCSS PACKAGE LAYOUTS.                    *16490001
016400*----------------------------------------------------------------*16500001
016410     PERFORM 12100-LOAD-MTHS-PACKAGE.                             16510001
016420     PERFORM 12200-LOAD-MTKS-PACKAGE.                             16520001
016430     PERFORM 12300-LOAD-MTKI-PACKAGE.                             16530001
016440*----------------------------------------------------------------*16540001
016450* REF. TRS 4.1.2.15, ISSUE DATE 09/15/93:                        *16550001
016460* IF OPS 52 IS "2" BASE DEFAULT INITIAL SETTING OF BLANKS AND    *16560001
016470* NULLS IN THE TRADE BASE, AND (O)MITTED IN THE TRADE BASE       *16570001
016480* INDICATORS - OTHERWISE POPULATE THEM.  AN E1 IS SUPPOSED TO    *16580001
016490* EXIST & WE WILL CREATE A TRADE CHANGE SEGMENT INSTEAD.         *16590001
016500*                                                                *16600001
016510* 03/11/94 IF THE E1 AND BASE ACCOUNT NUMBERS MATCH, WE WILL     *16610001
016520* NOT CREATE THE KEY CHANGE MKCS SEGMENT; WE USE THE SAME        *16620001
016530* ACCOUNT NUMBER FIELDS FOR THE COMPARE AS IN CCLB600.           *16630001
016540*----------------------------------------------------------------*16640001
016550* 07/05/96  ADDED CHECK FOR OUTPUT PENDING TO HANDLE MULTIPLE    *16650001
016560* SEGMENTS. LPISCH  ICP 5093                                     *16660001
016570*----------------------------------------------------------------*16670001
016580                                                                  16680001
016590     IF OPS-52-DO-NOT-UPGD-E1                                     16690001
           OR OPS-54-DO-NOT-UPGRADE                                     16700001
016600         IF (OPTL-TRCHG-LOAD-PENDING                              16710001
016610               OR                                                 16720001
016620             OPTL-TRCHG-OUTPUT-PENDING)                           16730001
016630             CONTINUE                                             16740001
016640         ELSE                                                     16750001
016650             PERFORM 12400-LOAD-TRADE-BASE-PACKAGES               16760001
016660     ELSE                                                         16770001
016670         PERFORM 12400-LOAD-TRADE-BASE-PACKAGES                   16780001
016680     END-IF.                                                      16790001
016690                                                                  16800001
016700 EJECT.                                                           16810001
016710******************************************************************16820001
016720 12100-LOAD-MTHS-PACKAGE.                                         16830001
016730******************************************************************16840001
016740*----------------------------------------------------------------*16850001
016750*    12100-LOAD-MTHS-PACKAGE.                                    *16860001
016760*    PERFORMED FROM: 12000-LOAD-TRADE-SEGMENT.                   *16870001
016770*    PASSED PARAMETER REQUIREMENTS: SOURCE DATA FROM LINKAGE.    *16880001
016780*    FUNCTION: POPULATES THIS PACKAGE OF THE CCSS TRADE SEGMENT. *16890001
016790*----------------------------------------------------------------*16900001
016800     MOVE CCF-PARM-DB-NUMBER  TO CCSS-MTHS-SUBMIT-ID.             16910001
016810********                                                          16920001
016820* JC0823 - RELIABLE SOURCE=AF, NON RELIABLE SOURCE=AG FORM OPS11  16930001
016830********                                                          16940001
016840     IF OPS-11-FULL-NAME-ADDRESS                                  16950001
016850        MOVE CNST-VALUE-FNA-REPORTER  TO CCSS-MTHS-UPDATE-SRC-ID  16960001
016860     ELSE                                                         16970001
016870        MOVE CNST-VALUE-NFNA-REPORTER TO CCSS-MTHS-UPDATE-SRC-ID  16980001
016880     END-IF.                                                      16990001
016890     MOVE 'V'                 TO  CCSS-MTHS-BATCH-TYPE.           17000001
016910 EJECT.                                                           17020001
016920******************************************************************17030001
016930 12200-LOAD-MTKS-PACKAGE.                                         17040001
016940******************************************************************17050001
016950*----------------------------------------------------------------*17060001
016960*    12200-LOAD-MTKS-PACKAGE.                                    *17070001
016970*    PERFORMED FROM: 12000-LOAD-TRADE-SEGMENT.                   *17080001
016980*    PASSED PARAMETER REQUIREMENTS: SOURCE DATA FROM LINKAGE.    *17090001
016990*    FUNCTION: POPULATES THE TRADE KEY PACKAGE.                  *17100001
017000*----------------------------------------------------------------*17110001
017010     MOVE TRADE-KEY-CURR-VENDOR-ID     TO CCSS-MTKS-VENDOR-ID.    17120001
017020*&&&&&&& RESEARCH CYCLE ID SETTING IN LA351 - MAY CHANGE THIS     17130001
017030     MOVE TRADE-KEY-CURR-CYCLE-ID      TO CCSS-MTKS-CYCLE-ID.     17140001
017040     MOVE TRADE-KEY-CURR-SIN-NUM       TO CCSS-MTKS-SIN-NUM.      17150001
017050*----------------------------------------------------------------*17160001
017060* RIGHT JUSTIFIED ACCOUNT NUMBER FIELD LEFT JUSTIFIED BLANK      *17170001
017070*----------------------------------------------------------------*17180001
017080     MOVE TRADE-KEY-CURR-ACCT-ID       TO CCSS-MTKS-ACCT-ID,      17190001
017090                                          FUNC-IN.                17200001
017100     MOVE SPACES                       TO FUNC-OUT.               17210001
017110     MOVE LENGTH OF CCSS-MTKS-ACCT-ID  TO FUNC-IN-LEN.            17220001
017120     MOVE SPACES                       TO WS-ACCT-NUM-IN.         17230001
017130     MOVE +0                           TO WS-ACCT-ZEROS-CNTR.     17240001
           IF CCF-L1-DATA                                               17250001
           AND (OPS-54-MOVE-ACCT-TO-BASE OR                             17260001
                OPS-54-MOVE-ACCT-SUB-TO-BASE)                           17270001
              MOVE CRF-L1-NEW-ACCOUNT-NUMBER TO WS-ACCT-NUM-IN          17280001
           ELSE                                                         17290001
017140        MOVE CRF-ACCOUNT-NUMBER        TO WS-ACCT-NUM-IN.         17300001
017150                                                                  17310001
017160     PERFORM WITH TEST BEFORE                                     17320001
017170        VARYING FIN-IDX FROM CNST-VALUE-1 BY CNST-VALUE-1         17330001
017180           UNTIL (FIN-IDX GREATER THAN FUNC-IN-LEN) OR            17340001
017190                 (FUNC-IN-CHAR (FIN-IDX) NOT EQUAL ZERO)          17350001
017200            CONTINUE                                              17360001
017210     END-PERFORM.                                                 17370001
017220     SET WS-HOLD-FIN-IDX         TO FIN-IDX.                      17380001
017230                                                                  17390001
017240     SET FOUT-IDX                TO CNST-VALUE-1.                 17400001
017250     PERFORM WITH TEST BEFORE                                     17410001
017260        VARYING FIN-IDX FROM FIN-IDX BY CNST-VALUE-1              17420001
017270           UNTIL (FIN-IDX GREATER THAN FUNC-IN-LEN) OR            17430001
017280                 (FUNC-IN-CHAR (FIN-IDX) EQUAL SPACE)             17440001
017290         MOVE FUNC-IN-CHAR (FIN-IDX) TO                           17450001
017300              FUNC-OUT-CHAR (FOUT-IDX)                            17460001
017310         SET FOUT-IDX UP BY CNST-VALUE-1                          17470001
017320     END-PERFORM.                                                 17480001
017330*----------------------------------------------------------------*17490001
017340* POPULATE ACCT LENGTH FIELD HERE (DATA LENGTH IS FOUT-IDX - 1).  17500001
017350*----------------------------------------------------------------*17510001
017360     SET CCSS-MTKI-ACCT-ID-LEN TO FOUT-IDX.                       17520001
017370     SUBTRACT CNST-VALUE-1     FROM CCSS-MTKI-ACCT-ID-LEN.        17530001
017380*                                                                 17540001
017390*** ICP7089 - 6/26/97 CHECK FOR LEADING ZEROS OPTION              17550001
017400*                                                                 17560001
017410     IF OPS-30-ACCT-NUM-LENGTH                                    17570001
017420         MOVE OPS-30-LEAD-ZEROS-BS-OPTION TO WS-ACCT-IN-LEN       17580001
           ELSE                                                         17590001
              IF OPS-39-ACCT-NUM-LENGTH                                 17600001
017420         MOVE OPS-39-LEAD-ZEROS-BS-OPTION TO WS-ACCT-IN-LEN.      17610001
017410     IF OPS-30-ACCT-NUM-LENGTH                                    17620001
              OR OPS-39-ACCT-NUM-LENGTH                                 17630001
017430         COMPUTE WS-ACCT-ZEROS-LEN =                              17640001
017440                (WS-ACCT-IN-LEN - CCSS-MTKI-ACCT-ID-LEN)          17650001
017450         MOVE SPACES                    TO FUNC-OUT               17660001
017460         SET FOUT-IDX                   TO CNST-VALUE-1           17670001
017470         MOVE +1                        TO WS-ACCT-ZEROS-CNTR     17680001
017480         PERFORM                                                  17690001
017490           UNTIL WS-ACCT-ZEROS-CNTR GREATER THAN WS-ACCT-ZEROS-LEN17700001
017500             MOVE '0'  TO                                         17710001
017510                FUNC-OUT-CHAR (FOUT-IDX)                          17720001
017520             SET FOUT-IDX UP BY CNST-VALUE-1                      17730001
017530             ADD +1          TO WS-ACCT-ZEROS-CNTR                17740001
017540         END-PERFORM                                              17750001
017550     ELSE                                                         17760001
017560       IF OPS-30-COUNT-ZEROS                                      17770001
                OR OPS-39-COUNT-ZEROS                                   17780001
017570           PERFORM                                                17790001
017580             VARYING ACT-IDX FROM CNST-VALUE-1 BY CNST-VALUE-1    17800001
017590              UNTIL (ACT-IDX GREATER THAN WS-ACCT-IN-LEN) OR      17810001
017600                 (ACCT-IN-CHAR (ACT-IDX) NOT EQUAL SPACES) AND    17820001
017610                 (ACCT-IN-CHAR (ACT-IDX) NOT EQUAL ZERO)          17830001
017620              IF ACCT-IN-CHAR (ACT-IDX) = ZERO                    17840001
017630                  ADD +1 TO WS-ACCT-ZEROS-CNTR                    17850001
017640              END-IF                                              17860001
017650           END-PERFORM                                            17870001
017660           MOVE SPACES                  TO FUNC-OUT               17880001
017670           SET FOUT-IDX                 TO CNST-VALUE-1           17890001
017680           MOVE +1                      TO WS-ACCT-ZEROS-CNTR2    17900001
017690           PERFORM                                                17910001
017700             UNTIL WS-ACCT-ZEROS-CNTR2 > WS-ACCT-ZEROS-CNTR       17920001
017710               MOVE '0'  TO                                       17930001
017720                FUNC-OUT-CHAR (FOUT-IDX)                          17940001
017730               SET FOUT-IDX UP BY CNST-VALUE-1                    17950001
017740               ADD +1          TO WS-ACCT-ZEROS-CNTR2             17960001
017750           END-PERFORM                                            17970001
017760       END-IF                                                     17980001
017770     END-IF.                                                      17990001
017780                                                                  18000001
017790     IF  OPS-30-ACCT-NUM-LENGTH                                   18010001
017800       OR OPS-39-ACCT-NUM-LENGTH                                  18020001
017810      OR OPS-30-COUNT-ZEROS                                       18030001
017810       OR OPS-39-COUNT-ZEROS                                      18040001
017820         SET FIN-IDX               TO WS-HOLD-FIN-IDX             18050001
017830         PERFORM WITH TEST BEFORE                                 18060001
017840           VARYING FIN-IDX FROM FIN-IDX BY CNST-VALUE-1           18070001
017850           UNTIL (FIN-IDX GREATER THAN FUNC-IN-LEN) OR            18080001
017860                 (FUNC-IN-CHAR (FIN-IDX) EQUAL SPACE)             18090001
017870           MOVE FUNC-IN-CHAR (FIN-IDX) TO                         18100001
017880              FUNC-OUT-CHAR (FOUT-IDX)                            18110001
017890           SET FOUT-IDX UP BY CNST-VALUE-1                        18120001
017900         END-PERFORM                                              18130001
017910         SET CCSS-MTKI-ACCT-ID-LEN TO FOUT-IDX                    18140001
017920         SUBTRACT CNST-VALUE-1     FROM CCSS-MTKI-ACCT-ID-LEN     18150001
017930     END-IF.                                                      18160001
017940*                                                                 18170001
017950     MOVE FUNC-OUT       TO CCSS-MTKS-ACCT-ID.                    18180001
017960                                                                  18190001
017970     IF NOT TDA-VALID-DATE-OPENED                                 18200001
017980*&&&&& THIS CONDITION COULD RESULT IN NON-UNIQUE TRADEKEY -       18210001
017990*&&&&& PASS IT ANYWAY?                                            18220001
018000*&&&&& THE TRADE KEY IS RENDERED INVALID? - SEE GREG L            18230001
018010         MOVE TRADE-KEY-CURR-OPEN-DATE TO CCSS-MTKS-OPEN-DATE     18240001
018020     ELSE                                                         18250001
018030         MOVE TRADE-KEY-CURR-OPEN-DATE TO WS-DATE-IN-MMDDCCYY     18260001
018040         SET SLASH-SEPARATOR           TO TRUE                    18270001
018050         PERFORM 5A000-FORMAT-DATE                                18280001
018080         MOVE WS-DATE-OUT              TO CCSS-MTKS-OPEN-DATE     18290001
018150     END-IF.                                                      18300001
018160                                                                  18310001
018170     MOVE TRADE-KEY-CURR-ACCT-TYPE     TO CCSS-MTKS-ACCT-TYPE.    18320001
018180 EJECT.                                                           18330001
018190******************************************************************18340001
018200 12300-LOAD-MTKI-PACKAGE.                                         18350001
018210******************************************************************18360001
018220*----------------------------------------------------------------*18370001
018230*    12300-LOAD-MTKI-PACKAGE.                                    *18380001
018240*    PERFORMED FROM: 12000-LOAD-TRADE-SEGMENT.                   *18390001
018250*    PASSED PARAMETER REQUIREMENTS: SOURCE DATA FROM LINKAGE.    *18400001
018260*    FUNCTION: POPULATES THE TRADE KEY INDICATORS PACKAGE.       *18410001
018270*----------------------------------------------------------------*18420001
018280     MOVE ERC-DATA-IS-VALID            TO CCSS-MTKI-VENDOR-ID-I.  18430001
018290     MOVE ERC-DATA-IS-VALID            TO CCSS-MTKI-CYCLE-ID-I.   18440001
018300     MOVE ERC-DATA-IS-VALID            TO CCSS-MTKI-SIN-NUM-I.    18450001
018310*&&&& NEW SOURCE IN TDA COMING FOR THIS PER GREG L (B YUSKO)  -*  18460001
018320     MOVE ERC-DATA-IS-VALID            TO CCSS-MTKI-ACCT-ID-I.    18470001
018410     IF NOT TDA-VALID-DATE-OPENED                                 18480001
018420*&&&&& THIS CONDITION COULD RESULT IN NON-UNIQUE TRADEKEY -       18490001
018430*&&&&& PASS IT ANYWAY?                                            18500001
018440*&&&&& THE TRADE KEY IS RENDERED INVALID? - SEE GREG L            18510001
018450         MOVE ERC-DATA-INVALID         TO CCSS-MTKI-OPEN-DATE-I   18520001
018460     ELSE                                                         18530001
018470         MOVE ERC-DATA-IS-VALID        TO CCSS-MTKI-OPEN-DATE-I.  18540001
018480                                                                  18550001
018490     MOVE ERC-DATA-IS-VALID            TO CCSS-MTKI-ACCT-TYPE-I.  18560001
018500 EJECT                                                            18570001
018510******************************************************************18580001
018520 12400-LOAD-TRADE-BASE-PACKAGES.                                  18590001
018530******************************************************************18600001
018540*----------------------------------------------------------------*18610001
018550*    12400-LOAD-TRADE-BASE-PACKAGES.                             *18620001
018560*    PERFORMED FROM: 12000-LOAD-TRADE-SEGMENT.                   *18630001
018570*    PASSED PARAMETER REQUIREMENTS: SOURCE DATA FROM LINKAGE.    *18640001
018580*    FUNCTION: POPULATES THE TRADE BASE PACKAGE, AND THE TRADE   *18650001
018590*              BASE INDICATORS PACKAGE.                          *18660001
018600*----------------------------------------------------------------*18670001
018610                                                                  18680001
018620*----------------------------------------------------------------*18690001
018630* 09/15: THEY WILL ACCEPT DEFAULT VALUES FOR THE AMOUNT          *18700001
018640* FIELDS IF INVALID INPUT DATA IS NOT NUMERIC I.E. ZEROES.       *18710001
018650*----------------------------------------------------------------*18720001
018660* JCHOY 11/15/95  ACCEPT ZERO BALANCE AMT AND SET FLAG TO V BASED 18730001
018670* ON THE EQUATED STATUES.                                         18740001
018680* ACCEPT ZERO BAL AMT IF IT IS ZEROS BAL-AMT STATUS, OTHERWISE    18750001
018690* SET BAL-AMT TO UNKNOWN. NON BAL-AMT SUPPORTABLE STATUSES, DEFAUL18760001
018700* BAL-AMT TO DEFAULT                                              18770001
018710                                                                  18780001
018720     IF NOT TDA-STATUS-BALAMT-SUPT                                18790001
018730        MOVE CNST-BAL-AMT-DEFAULT TO CCSS-MTBS-BALANCE-AMT        18800001
018740        MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-BALANCE-AMT-I         18810001
018750     ELSE                                                         18820001
018760        IF TDA-VALID-BAL-AMT                                      18830001
018770           MOVE TDA-BALANCE-AMOUNT-NUMERIC                        18840001
018780                                     TO CCSS-MTBS-BALANCE-AMT     18850001
018790           MOVE ERC-DATA-IS-VALID    TO CCSS-MTBI-BALANCE-AMT-I   18860001
018800        ELSE                                                      18870001
018810           IF TDA-DEFAULT-BAL-AMT                                 18880001
                    IF TDA-STATUS-91                                    18890001
018730                 MOVE CNST-BAL-AMT-DEFAULT                        18900001
018730                                     TO CCSS-MTBS-BALANCE-AMT     18900001
                    ELSE                                                18910001
018820                 MOVE CNST-BAL-AMT-UNKNOWN                        18920001
018820                                     TO CCSS-MTBS-BALANCE-AMT     18920001
                    END-IF                                              18930001
018830              MOVE ERC-DATA-IS-VALID                              18940001
018830                                     TO CCSS-MTBI-BALANCE-AMT-I   18940001
018840           ELSE                                                   18950001
018850              IF TDA-ZERO-BAL-AMT                                 18960001
018860                 IF TDA-STATUS-ZERO-BALAMT-SUPT                   18970001
                       OR TDA-SPECIAL-COMMENT-AH
018880                    MOVE TDA-BALANCE-AMOUNT-NUMERIC               19000001
018890                                     TO CCSS-MTBS-BALANCE-AMT     19010001
018900                    MOVE ERC-DATA-IS-VALID                        19020001
018900                                     TO CCSS-MTBI-BALANCE-AMT-I   19020001
                       ELSE
018920                    MOVE CNST-BAL-AMT-UNKNOWN                     19040001
018920                                     TO CCSS-MTBS-BALANCE-AMT     19040001
018940                    MOVE ERC-DATA-IS-VALID                        19060001
018940                                     TO CCSS-MTBI-BALANCE-AMT-I   19060001
                       END-IF
018910              ELSE                                                19030001
018850                 IF TDA-BLANK-BAL-AMT                             18960001
018920                    MOVE CNST-BAL-AMT-UNKNOWN                     19040001
018920                                     TO CCSS-MTBS-BALANCE-AMT     19040001
018940                    MOVE ERC-DATA-IS-VALID                        19060001
018940                                     TO CCSS-MTBI-BALANCE-AMT-I   19060001
                       END-IF
                    END-IF
                 END-IF
              END-IF
           END-IF.
018960*                                                                 19080001
018970* 10/07: OUTPUT B2 AS IT CAME IN, EVEN IF ALL '0'S, WHEN ACCT    *19090001
018980* IS DEROG STATUS AND B2/B3 GRID NOT USED. FOR B3'S OUTPUT THE   *19100001
018990* UNPACKED PRINTABLE, BUT UNEDITED B3 VALUE FOR THESE ACCTS.     *19110001
019000* THE MTBI VALUE WILL BE SET TO 'I' FOR INVALID FOR THESE ACCTS. *19120001
019010*                                                                 19130001
019020     MOVE SPACES                        TO CCSS-MTBS-STATUS-GRID. 19140001
019030                                                                  19150001
019040     IF TDA-B2-B3-GRID-VALID                                      19160001
019050        IF  TDA-UNPACKED-GRID NOT = SPACES                        19170001
019060            MOVE TDA-UNPACKED-GRID TO CCSS-MTBS-STATUS-GRID       19180001
019070        END-IF                                                    19190001
019080     ELSE                                                         19200001
019090        IF TDA-B2-B3-GRID-NOT-USED                                19210001
019100           IF  TDA-B3-UNPACKED-AND-PRINTABLE NOT = SPACES         19220001
019110               MOVE TDA-B3-UNPACKED-AND-PRINTABLE                 19230001
019120                                  TO  CCSS-MTBS-STATUS-GRID       19240001
019130           ELSE                                                   19250001
019140              IF CRF-B2-GRID NOT = SPACES                         19260001
019150              MOVE CRF-B2-GRID    TO  CCSS-MTBS-STATUS-GRID       19270001
019160              END-IF                                              19280001
019170           END-IF                                                 19290001
019180         ELSE                                                     19300001
019190            IF CRF-B3-GRID NOT = SPACES AND                       19310001
019200               CRF-B3-GRID NOT = ZEROES                           19320001
019210               MOVE CRF-B3-GRID TO CCSS-MTBS-STATUS-GRID          19330001
019220            ELSE                                                  19340001
019230               IF ((CRF-B2-GRID NOT = SPACES AND                  19350001
019240                  CRF-B2-GRID NOT = ZEROES) AND OPS-03-OLD-METRO) 19360001
019250                  MOVE CRF-B2-GRID TO CCSS-MTBS-STATUS-GRID       19370001
                     ELSE                                               19380001
                        IF ((CRF-PAYMENT-HISTORY NOT = SPACES AND       19390001
                           CRF-PAYMENT-HISTORY NOT = ZEROES)            19400001
                           AND OPS-03-NEW-METRO)                        19410001
                           MOVE CRF-PAYMENT-HISTORY                     19420001
                                                TO CCSS-MTBS-STATUS-GRID19430001
                        END-IF                                          19440001
019260               END-IF                                             19450001
019270            END-IF                                                19460001
019280        END-IF                                                    19470001
019280     END-IF.                                                      19480001
019290                                                                  19490001
                                                                        19500001
019300     IF TDA-B2-B3-GRID-INVALID                                    19510001
              OR TDA-TBL05-OVERLAY                                      19520001
              OR TDA-DATE-OVERLAY                                       19530001
019310         MOVE ERC-DATA-INVALID       TO CCSS-MTBI-STATUS-GRID-I   19540001
019320     ELSE                                                         19550001
019330         IF TDA-GRID-FLAG = ERC-DATA-IS-VALID                     19560001
019340             MOVE ERC-DATA-IS-VALID  TO CCSS-MTBI-STATUS-GRID-I.  19570001
019350                                                                  19580001
           MOVE TDA-PAYMENT-RATING    TO CCSS-MTBS-PAY-RATING.          19590001
           MOVE TDA-PAYMENT-RATING-FLAG                                 19600001
                                      TO CCSS-MTBI-PAY-RATING-I.        19610001
                                                                        19620001
           MOVE TDA-INTEREST-IND      TO CCSS-MTBS-INTEREST-IND.        19630001
           MOVE TDA-INTEREST-IND-FLAG TO CCSS-MTBI-INTEREST-IND-I.      19650001
                                                                        19660001
           MOVE TDA-PROCESSING-INDICATOR                                19670001
                                      TO CCSS-MTBS-PROCESS-IND.         19680001
           MOVE TDA-PROCESSING-IND-FLAG                                 19690001
                                      TO CCSS-MTBI-PROCESS-IND-I.       19700001
                                                                        19710001
           IF OPS-03-OLD-METRO                                          19720001
034700        MOVE ERC-DATA-IS-VALID                                    19730001
034700                               TO  CCSS-MTBI-CCC-I                19740001
              SET CCSS-MTBS-CCC-XR   TO  TRUE.                          19750001
           IF  OPS-03-NEW-METRO                                         19760001
           OR (OPS-03-OLD-METRO AND TDA-SCC-TO-CCC-CONVERT)             19770001
              MOVE TDA-COMPLIANCE-COND-CODE                             19780001
                                      TO CCSS-MTBS-CCC                  19790001
              MOVE TDA-CCC-FLAG                                         19800001
                                      TO CCSS-MTBI-CCC-I.               19810001
                                                                        19820001
019370                                                                  19830001
019380     IF TDA-PAYMENT-AMOUNT-NUMERIC IS NUMERIC                     19840001
019390         MOVE TDA-PAYMENT-AMOUNT-NUMERIC TO CCSS-MTBS-PAY-AMT     19850001
019400     ELSE                                                         19860001
019410         IF  OPS-03-NEW-METRO                                     19870001
                   AND CRF-PAYMENT-AMOUNT-NUMERIC NUMERIC               19880001
019420             MOVE CRF-PAYMENT-AMOUNT-NUMERIC TO                   19890001
019430                  CCSS-MTBS-PAY-AMT                               19900001
               ELSE                                                     19910001
               IF  OPS-03-OLD-METRO                                     19920001
                   AND CRF-PAYMENT-AMOUNT7-NUMERIC NUMERIC              19930001
                   MOVE CRF-PAYMENT-AMOUNT7-NUMERIC TO                  19940001
                        CCSS-MTBS-PAY-AMT.                              19950001
019640                                                                  19960001
019650     IF TDA-PAYMENT-AMOUNT-FLAG = ERC-DATA-IS-VALID               19970001
019660         MOVE ERC-DATA-IS-VALID       TO CCSS-MTBI-PAY-AMT-I      19980001
019670     ELSE                                                         19990001
019680         IF TDA-PAYMENT-AMOUNT-FLAG = ERC-DATA-IS-BLANK OR        20000001
019690                                      ERC-DATA-IS-ZERO            20010001
019700*--- INITALIZED DEFAULT OF 'O' (OMITTED)                          20020001
019710             CONTINUE                                             20030001
019720         ELSE                                                     20040001
                   IF TDA-PAYMENT-AMOUNT-FLAG = ERC-DATA-IS-NOT-REPORTED
                      AND TDA-STATUS-PAY-AMT-ALLOWED
                      AND TDA-PAY-AMT-OPT-SCHED-ZEROS
                        MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-PAY-AMT-I
                   ELSE
019730                  MOVE ERC-DATA-INVALID TO CCSS-MTBI-PAY-AMT-I.   20050001
                                                                        20060001
019640                                                                  20070001
           IF TDA-ACTUAL-PAY-AMOUNT-NUMERIC IS NUMERIC                  20080001
              MOVE TDA-ACTUAL-PAY-AMOUNT-NUMERIC                        20090001
                                        TO CCSS-MTBS-ACTUAL-PAY-AMT.    20100001

           IF OPS-03-NEW-METRO                                          20110001
              IF TDA-ACTUAL-PAY-AMT-DEFAULT
                 MOVE ERC-DATA-IS-OMITTED
                                        TO CCSS-MTBI-ACTUAL-PAY-AMT-I
              ELSE
                 MOVE TDA-ACTUAL-PAY-AMT-FLAG                           20120001
                                        TO CCSS-MTBI-ACTUAL-PAY-AMT-I   20130001
              END-IF
           END-IF.
019740                                                                  20140001
019440*---------------------------------------------------------------* 20150001
019450* STATUS FLAG MUST BE VALID OR CCLC640 WOULD NOT BE CALLED      * 20160001
019460* FOR THIS TRANSACTION.                                         * 20170001
019470*                                                               * 20180001
019480* 11/02/94 - WE CAN'T ASSUME THAT ANYMORE; CCSS OUTPUT MODULES  * 20190001
019490* NOW SERVE THE DUAL PURPOSE OF OUTPUTTING VALID CCSS TRANS     * 20200001
019500* ACTIONS AND POPULATING THE CCSS FIELDS FOR THE NEW SAMPLES    * 20210001
019510* REPORTS WHETHER THE TRANSACTION IS ROUTED TO CCSS, DISCARD,   * 20220001
019520* BYPASS ETC.. THEREFORE, THIS PROGRAM IS NOW ALSO CALLED       * 20230001
019530* FOR INVALID TRANSACTIONS.                                     * 20240001
019540*                                                               * 20250001
019550* TDA-STATUS-FLAG IS SET TO EITHER 'V' OR 'E' IN CCLB200.  IF   * 20260001
019560* ITS 'E', WE MOVE IN 'I' (INVALID).                            * 20270001
019570*---------------------------------------------------------------* 20280001
           IF NOT CCF-OUTPUT-TO-DISCARDS
           AND TRANS-OUTPUT-PENDING
               MOVE WS-SAVE-STATUS       TO CCSS-MTBS-STATUS-CODE
           ELSE
019360        MOVE TDA-STATUS            TO CCSS-MTBS-STATUS-CODE.      20290001
                                                                        20300001
           IF TDA-STATUS-TO-SCC-CONVERT                                 20350001
           OR TDA-STATUS-TO-CII-CONVERT                                 20360001
           OR (TDA-SCC-BLANK-STATUS AND NOT TDA-STATUS-DA-DF)
              MOVE SPACES          TO CCSS-MTBS-STATUS-CODE             20390001
              MOVE ERC-DATA-IS-OMITTED TO CCSS-MTBI-STATUS-CODE-I       20400001
           ELSE                                                         20410001
019590         IF TDA-STATUS-FLAG = ERC-DATA-IS-INVALID                 20420001
019600             MOVE ERC-DATA-INVALID TO CCSS-MTBI-STATUS-CODE-I     20430001
019610         ELSE                                                     20440001
019620             MOVE TDA-STATUS-FLAG TO CCSS-MTBI-STATUS-CODE-I.     20450001

           IF NOT CCF-OUTPUT-TO-DISCARDS
           AND TRANS-OUTPUT-PENDING
               MOVE WS-SAVE-STATUS-I TO CCSS-MTBI-STATUS-CODE-I.
019630*---------------------------------------------------------------* 20460001
019750*----------------------------------------------------------------*20470001
019760* SCB FIX 04/20/94: HAVING HERETOFORE MISUNDERSTOOD THE RULES    *20480001
019770* REGARDING THE CCSS CREDIT LIMIT VALUE, CORRECTIONS HAVE NOW    *20490001
019780* BEEN MADE, AND HERE ARE THE RULES PER ANA MUBARAK & LISA -     *20500001
019790* THIS CHANGE AFFECTS CCLB200, COPYBOOK CCLATDA AS WELL AS       *20510001
019800* CCLC640 (RECOMPILATION OF ALL MODULES THAT USE CCLATDA         *20520001
019810* IS NOT ABSOLUTELY NECESSARY).                                  *20530001
019820*                                                                *20540001
019830* IF OPS 33 = 'N' (INPUT CREDIT LIMIT NOT PRESENT)               *20550001
019840*                                                                *20560001
019850*     IF (TBL02 AMOUNT QUALIFIER = 'O' (ORIGINAL LOAN)) OR       *20570001
019860*        (TBL02 AMOUNT QUALIFIER = 'U' (UNKNOWN)) THEN           *20580001
019870*  *     POPULATE CCSS CREDIT LIMIT/LOAN FROM TDA-AMOUNT         *20590001
019880*                                                                *20600001
019890*     ELSE IF TBL02 AMOUNT QUALIFIER = 'H' (HI BALANCE) THEN     *20610001
019900*        DEFAULT CCSS CREDIT LIM/LOAN AMT TO ZEROES, AND THE     *20620001
019910*        INDICATOR TO 'O' (OMITTED)                              *20630001
019920*                                                                *20640001
019930*     ELSE IF TBL02 AMOUNT QUALIFIER = 'L' (CREDIT LIMIT) THEN   *20650001
019940*  *     POPULATE CCSS CREDIT LIMIT/LOAN FROM TDA-CREDIT-LIMIT   *20660001
019950*                                                                *20670001
019960*                                                                *20680001
019970* ELSE IF OPS 33 = 'Y' (INPUT CREDIT LIMIT IS PRESENT)           *20690001
019980*                                                                *20700001
019990*     IF TBL02 AMOUNT QUALIFIER = 'O' (ORIGINAL LOAN) THEN       *20710001
020000*  *     POPULATE CCSS CREDIT LIMIT/LOAN FROM TDA-AMOUNT         *20720001
020010*                                                                *20730001
020020*     ELSE IF (TBL02 AMOUNT QUALIFIER = 'H' (HI BALANCE)  OR     *20740001
020030*              TBL02 AMOUNT QUALIFIER = 'U' (UNKNOWN)     OR     *20750001
020040*              TBL02 AMOUNT QUALIFIER = 'L' (CREDIT LIMIT)) THEN *20760001
020050* **     POPULATE CCSS CREDIT LIMIT/LOAN FROM TDA-CREDIT-LIMIT.  *20770001
020060*                                                                *20780001
020070*                                                                *20790001
020080* SECONDARY CHECKS:                                              *20800001
020090*                                                                *20810001
020100* *  IF THE ABOVE TDA- DATA FIELD IS EMPTY, GET THE DATA FROM    *20820001
020110*      THE CRF-AMOUNT FIELD.                                     *20830001
020120*                                                                *20840001
020130* ** IF THE ABOVE TDA- DATA FIELD IS EMPTY, GET THE DATA FROM    *20850001
020140*      THE CRF-CREDIT-LIMIT FIELD.                               *20860001
020150*                                                                *20870001
020160*----------------------------------------------------------------*20880001
020170     EVALUATE TRUE                                                20920001
020180                                                                  20930001
020190         WHEN TDA-ORIG-AMOUNT-ORIGINAL                            20940001
020200             PERFORM 12460-AMOUNT-ORIGINAL                        20950001
020210                                                                  20960001
020220         WHEN TDA-ORIG-AMOUNT-HI-BALANCE                          20970001
020240             PERFORM 12470-AMOUNT-HI-BALANCE                      20980001
020280                                                                  21020001
020290         WHEN TDA-ORIG-AMOUNT-CREDIT-LIMIT                        21030001
020300             PERFORM 12490-AMOUNT-CREDIT-LIMIT.                   21040001
020310                                                                  21050001
020610*----------------------------------------------------------------*21170001
020620*   POSSIBLE STATUSES FOR CHARGE OFF ARE VALID/INVALID ONLY      *21180001
020630*   PER ANA MUBARAK AS OF 11/11/93.                              *21190001
020640*----------------------------------------------------------------*21200001
020650     IF TDA-CHARGE-OFF-NUMERIC IS NUMERIC                         21210001
020660         MOVE TDA-CHARGE-OFF-NUMERIC                              21220001
020660                                TO CCSS-MTBS-CHARGE-OFF-AMT.      21230001
           IF TDA-VALID-CHARGE-OFF                                      21240001
020670         MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-CHARGE-OFF-AMT-I     21250001
           ELSE                                                         21260001
              IF TDA-INVALID-CHARGE-OFF                                 21270001
              MOVE ERC-DATA-INVALID                                     21280001
                                      TO CCSS-MTBI-CHARGE-OFF-AMT-I     21290001
              ELSE                                                      21300001
                 IF TDA-OMITTED-CHARGE-OFF                              21310001
                    MOVE ERC-DATA-IS-OMITTED                            21320001
                                      TO CCSS-MTBI-CHARGE-OFF-AMT-I     21330001
                 ELSE                                                   21340001
020690              MOVE ZEROES       TO CCSS-MTBS-CHARGE-OFF-AMT       21350001
020700              MOVE ERC-DATA-INVALID                               21360001
020700                                TO CCSS-MTBI-CHARGE-OFF-AMT-I.    21370001
020710                                                                  21380001
020720     IF TDA-HI-BALANCE-NUMERIC IS NUMERIC                         21390001
020730         MOVE TDA-HI-BALANCE-NUMERIC TO CCSS-MTBS-HI-BALANCE-AMT. 21400001
020740                                                                  21410001
020750     MOVE ERC-DATA-IS-VALID     TO CCSS-MTBI-HI-BAL-AMT-I.        21420001
020760     IF (TDA-HI-BALANCE-FLAG EQUAL ERC-DATA-CHANGED-TO-DEFAULT    21430001
020770                               OR  ERC-DATA-IS-INVALID)           21440001
020780         MOVE ERC-DATA-INVALID TO CCSS-MTBI-HI-BAL-AMT-I          21450001
020790     ELSE                                                         21460001
020800         IF TDA-HI-BALANCE-FLAG EQUAL ERC-DATA-IS-BLANK OR        21470001
020810                                      ERC-DATA-IS-UNUSED          21480001
020820             MOVE ERC-DATA-IS-OMITTED TO CCSS-MTBI-HI-BAL-AMT-I   21490001
020830         ELSE                                                     21500001
020840             IF TDA-HI-BALANCE-FLAG NOT EQUAL ERC-DATA-IS-VALID   21510001
020850                 MOVE ERC-DATA-INVALID TO                         21520001
020860                      CCSS-MTBI-HI-BAL-AMT-I.                     21530001
020870                                                                  21540001
020880     IF TDA-AMOUNT-PAST-DUE-NUMERIC IS NUMERIC                    21550001
020890         MOVE TDA-AMOUNT-PAST-DUE-NUMERIC TO                      21560001
020900              CCSS-MTBS-PAST-DUE-AMT                              21570001
020910     ELSE                                                         21580001
020920         IF  OPS-03-NEW-METRO AND                                 21590001
020920             CRF-AMOUNT-PAST-DUE-NUMERIC NUMERIC                  21600001
020930             MOVE CRF-AMOUNT-PAST-DUE-NUMERIC TO                  21610001
020940                  CCSS-MTBS-PAST-DUE-AMT                          21620001
020910         ELSE                                                     21630001
020920             IF OPS-03-OLD-METRO AND                              21640001
020920                CRF-AMOUNT-PAST-DUE7-NUMERIC NUMERIC              21650001
020930                 MOVE CRF-AMOUNT-PAST-DUE7-NUMERIC TO             21660001
020940                      CCSS-MTBS-PAST-DUE-AMT.                     21670001
020950                                                                  21680001
020960     MOVE ERC-DATA-IS-VALID     TO CCSS-MTBI-PAST-DUE-AMT-I.      21690001
020970     IF (TDA-AMOUNT-PAST-DUE-FLAG EQUAL                           21700001
020980        ERC-DATA-CHANGED-TO-DEFAULT OR ERC-DATA-IS-INVALID)       21710001
020990         MOVE ERC-DATA-INVALID TO CCSS-MTBI-PAST-DUE-AMT-I        21720001
021000     ELSE                                                         21730001
021010         IF TDA-AMOUNT-PAST-DUE-FLAG EQUAL ERC-DATA-IS-BLANK      21740001
021020             MOVE ERC-DATA-IS-OMITTED TO                          21750001
021030                  CCSS-MTBI-PAST-DUE-AMT-I                        21760001
021040         ELSE                                                     21770001
021050             IF ((OPS-03-NEW-METRO                                21780001
021050                AND (CRF-AMOUNT-PAST-DUE = SPACES OR ZEROES))     21790001
                      OR (OPS-03-OLD-METRO                              21800001
                         AND (CRF-AMOUNT-PAST-DUE7 = SPACES OR ZEROES)))21810001
021060                 MOVE ERC-DATA-IS-OMITTED TO                      21820001
021070                      CCSS-MTBI-PAST-DUE-AMT-I                    21830001
021080             ELSE                                                 21840001
021090                 IF TDA-AMOUNT-PAST-DUE-FLAG NOT EQUAL            21850001
021100                    ERC-DATA-IS-VALID                             21860001
021110                     MOVE ERC-DATA-INVALID TO                     21870001
021120                          CCSS-MTBI-PAST-DUE-AMT-I.               21880001
021130*--------------------------------------------------------------*  21890001
021140* PAY-AMT-ID PER TRS 4.1.2.42 - SET TO ONE OF TWO VALUES       *  21900001
021150* DEPENDING ON WHETHER OPS 34 INDICATES WHETHER THE PAYMENT AMT*  21910001
021160* IS SCHEDULED OR NOT. THE CORRESPONDING INDICATOR IS ALWAYS   *  21920001
021170* SET TO 'V'.                                                  *  21930001
021180*--------------------------------------------------------------*  21940001
021190     MOVE ERC-DATA-IS-VALID           TO CCSS-MTBI-PAY-AMT-ID-I.  21950001
021200     IF TDA-PAY-AMT-OPT-SCHED                                     21960001
021210         MOVE CNST-SCHEDULED          TO CCSS-MTBS-PAY-AMT-ID     21970001
021220     ELSE                                                         21980001
021230         MOVE CNST-ESTIMATED          TO CCSS-MTBS-PAY-AMT-ID.    21990001
021240*--------------------------------------------------------------*  22000001
021250* IF TERMS NOT PRESENT OR TERMS NOT EDITED                     *  22010001
021260*                                                              *  22020001
021270*     THEN MOVE TERMS FROM INPUT TO CCSS TERMS FIELD           *  22030001
021280*                                                              *  22040001
021290* ELSE                                                         *  22050001
021300*     IF TERMS WAS CONVERTED FROM MONTHS TO YEARS              *  22060001
021310*        (OR CAME IN FROM THE INPUT IN YEARS),                 *  22070001
021320*        THIS IS A REAL ESTATE ACCOUNT WITH ONE OF THE         *  22080001
021330*        FOLLOWING TYPE CODES: 08,19,25,26,30 AND              *  22090001
021340*        THE EDITED TERMS FIELD IS VALID NUMERIC               *  22100001
021350*                                                              *  22110001
021360*        THEN CONVERT THE TERMS BACK TO MONTHS FOR             *  22120001
021370*          THE CCSS TERMS FIELD                                *  22130001
021380*                                                              *  22140001
021390*     END-IF                                                   *  22150001
021400* END-IF.                                                      *  22160001
021410*                                                              *  22170001
021420*  * * * NOTE * * * IF THE SOURCE TERMS FIELD IS NON           *  22180001
021430*  NUMERIC, THE CCSS TERMS VALUE WILL HAVE TO BE ZEROES        *  22190001
021440*  AS LONG AS THE DATA TYPE OF THE CCSS TERMS IS BINARY.       *  22200001
021450*--------------------------------------------------------------*  22210001
021460     MOVE ZEROES            TO CCSS-MTBS-TERMS-NUM.               22220001
021470                                                                  22230001
           IF TDA-VALID-TERMS                                           22240001
021550        MOVE TDA-CCSS-ORIG-TERMS TO CCSS-MTBS-TERMS-NUM           22250001
           ELSE                                                         22260001
              IF TDA-CALCULATE-TERMS                                    22270001
                  CONTINUE                                              22280001
              ELSE                                                      22290001
021590           IF CRF-TERMS-NUMERIC IS NUMERIC                        22300001
                    MOVE CRF-TERMS-NUMERIC TO CCSS-MTBS-TERMS-NUM.      22310001
021610                                                                  22320001
021720     IF TDA-TERMS-FLAG = ERC-DATA-IS-VALID                        22330001
021730        MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-TERMS-NUM-I           22340001
021780     ELSE                                                         22350001
021620        IF TDA-TERMS-FLAG = ERC-DATA-CHANGED-TO-DEFAULT           22360001
021630           MOVE ERC-DATA-INVALID TO CCSS-MTBI-TERMS-NUM-I.        22370001
                                                                        22380001
           MOVE TDA-TERMS-FREQUENCY  TO CCSS-MTBS-TERMS-FREQ.           22390001
           MOVE TDA-TERMS-FREQ-FLAG  TO CCSS-MTBI-TERMS-FREQ-I.         22400001
021990                                                                  22410001
022000**************                                                    22420001
022010*---------------------------------------------------------------* 22430001
022020* SPECIAL COMMENT IS VALID OTHERWISE THIS PROGRAM SHOULD        * 22440001
022030* NOT HAVE BEEN CALLED.                                         * 22450001
022040*                                                               * 22460001
022110*---------------------------------------------------------------* 22470001
034860     MOVE ERC-DATA-IS-VALID    TO  CCSS-MTBI-SPCL-CMNT-CD1-I.     22480001
           IF  OPS-03-NEW-METRO                                         22490001
               IF TDA-SCC-CCC-XERR-Y                                    22500001
               OR (TDA-SCC-CROSS-CHECK-GROUP1 AND                       22510001
                   TDA-STATUS-CROSS-CHECK-GROUP1)                       22520001
               OR (TDA-SPECIAL-COMMENT-AB-OR-AC AND                     22530001
                   TDA-STATUS-CROSS-CHECK-GROUP2)                       22540001
               OR (TDA-SPECIAL-COMMENT-CS AND                           22570001
                   TDA-STATUS-CROSS-CHECK-GROUP3)                       22580001
                  MOVE SPACES       TO CCSS-MTBS-SPCL-CMNT-CD1          22590001
               ELSE                                                     22600001
022160            MOVE TDA-SPECIAL-COMMENT                              22610001
022160                              TO CCSS-MTBS-SPCL-CMNT-CD1          22620001
022170         END-IF                                                   22630001
           ELSE                                                         22640001
               IF  TDA-STATUS-TO-SCC-CONVERT                            22650001
               AND TDA-SCC-M1-TO-M2-CONVERT                             22660001
                   IF TDA-SCC-FROM-METRO1-SCC NOT EQUAL SPACES          22670001
                      MOVE ERC-DATA-IS-VALID                            22680001
                                          TO CCSS-MTBI-SPCL-CMNT-CD2-I  22690001
                      MOVE TDA-SCC-FROM-METRO1-SCC                      22700001
                                          TO CCSS-MTBS-SPCL-CMNT-CD2    22710001
                   END-IF                                               22720001
                   MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-ORIG-SPCL-CMNT-I 22730001
                   MOVE TDA-SCC-FROM-STATUS                             22740001
                                          TO CCSS-MTBS-SPCL-CMNT-CD1    22750001
                   MOVE TDA-SPECIAL-COMMENT                             22760001
                                          TO CCSS-MTBS-ORIG-SPCL-CMNT   22770001
               ELSE                                                     22780001
                   IF  TDA-STATUS-TO-SCC-CONVERT                        22790001
                       MOVE TDA-SCC-FROM-STATUS                         22800001
                                          TO CCSS-MTBS-SPCL-CMNT-CD1    22810001
                       IF  TDA-VALID-SP-COMMENTS                        22820001
                           MOVE TDA-SPECIAL-COMMENT                     22830001
                                          TO CCSS-MTBS-ORIG-SPCL-CMNT   22840001
                           MOVE ERC-DATA-IS-VALID                       22850001
                                          TO CCSS-MTBI-ORIG-SPCL-CMNT-I 22860001
                           IF TDA-SPECIAL-COMMENT NOT EQUAL SPACES      22870001
                              MOVE TDA-SPECIAL-COMMENT                  22880001
                                          TO CCSS-MTBS-SPCL-CMNT-CD2    22890001
                              MOVE ERC-DATA-IS-VALID                    22900001
                                          TO CCSS-MTBI-SPCL-CMNT-CD2-I  22910001
                           END-IF                                       22920001
                       END-IF                                           22930001
                   ELSE                                                 22940001
                       IF  TDA-SCC-M1-TO-M2-CONVERT                     22950001
                           MOVE ERC-DATA-IS-VALID                       22960001
                                          TO CCSS-MTBI-ORIG-SPCL-CMNT-I 22970001
                           MOVE TDA-SCC-FROM-METRO1-SCC                 22980001
                                          TO CCSS-MTBS-SPCL-CMNT-CD1    22990001
                           MOVE TDA-SPECIAL-COMMENT                     23000001
                                          TO CCSS-MTBS-ORIG-SPCL-CMNT   23010001
                       ELSE                                             23020001
                           IF  TDA-VALID-SP-COMMENTS                    23030001
                               MOVE TDA-SPECIAL-COMMENT                 23040001
                                          TO CCSS-MTBS-ORIG-SPCL-CMNT   23050001
                               MOVE ERC-DATA-IS-VALID                   23060001
                                          TO CCSS-MTBI-ORIG-SPCL-CMNT-I 23070001
                               IF (TDA-SCC-CROSS-CHECK-GROUP1 AND       23080001
                                   TDA-STATUS-CROSS-CHECK-GROUP1)       23090001
                               OR (TDA-SPECIAL-COMMENT-AB-OR-AC AND     23100001
                                   TDA-STATUS-CROSS-CHECK-GROUP2)       23110001
                               OR (TDA-SPECIAL-COMMENT-CS AND           23140001
                                   TDA-STATUS-CROSS-CHECK-GROUP3)       23150001
                                  MOVE SPACES TO CCSS-MTBS-SPCL-CMNT-CD123160001
                               ELSE                                     23170001
                                   MOVE TDA-SPECIAL-COMMENT             23180001
                                            TO CCSS-MTBS-SPCL-CMNT-CD1  23190001
                               END-IF                                   23200001
                           END-IF                                       23210001
                       END-IF                                           23220001
                   END-IF                                               23230001
               END-IF                                                   23240001
022300     END-IF.                                                      23250001
                                                                        23260001
           IF TDA-TBL05-OVERLAY                                         23270001
              OR TDA-DATE-OVERLAY                                       23290001
              MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-ORIG-SPCL-CMNT-I      23300001
              MOVE 'R '              TO CCSS-MTBS-ORIG-SPCL-CMNT        23310001
           END-IF                                                       23320001
022310*---------------------------------------------------------------* 23330001
022320                                                                  23340001
022330*---------------------------------------------------------------* 23350001
022340*  11/08/94 DATAPREP2 PR41002C: WE CAN'T ASSUME THE BALANCE DATE* 23360001
022350*  IS VALID IF THIS PROGRAM WAS CALLED ANYMORE; NEW CCSS SAMPLE * 23370001
022360*  REPORTS REQUIRE THAT THE FIELDS BE POPULATED EVEN IF         * 23380001
022370*  THE CCSS TRANSACTION IS NOT GOING TO FILE (EXCEPT IF A       * 23390001
022380*  RECYCLE TRANSACTION).  POSSIBLE CCSS STATES ARE VALID OR     * 23400001
022390*  INVALID FOR PURPOSES OF NEW SAMPLES.  IF NOT VALID, WE       * 23410001
022400*  ACCEPT WHATEVER DEFAULT WAS PUT INTO THE TDA-BALANCE-DATE    * 23420001
022410*  FIELD WITHOUT CCSS DATE FORMATTING.  IF NOT VALID, THIS      * 23430001
022420*  COULD BE ZEROES OR AN UNFORMATTED ACTIVITY DATE OR           * 23440001
022430*  DATE OF OCCURRENCE.                                          * 23450001
022440*                                                               * 23460001
022450* THE BALANCE DATE IS VALID HERE BECAUSE IF IT WEREN'T          * 23470001
022460* THE OUTPUT OF THIS TRANSACTION WOULD BE BYPASSED BY NOT       * 23480001
022470* CALLING THIS PROGRAM.                                         * 23490001
022480*                                                               * 23500001
022490* 12/08 4.1.2.47H - REQ. CHANGE: IF BALANCE REPORTER, CCLC640   * 23510001
022500* IS CALLED ONLY IF THE BALANCE DATE AND DATE REPORTED ARE      * 23520001
022510* VALID.                                                        * 23530001
022550*                                                               * 23570001
022560* 2/07/94 NEW: NEW FLAG SET OF 'C' IN THE TDA- FLAG IF THE      * 23580001
022570* BALANCE, OCCURRENCE OR REPORTED DATES ARE OLDER THAN THE      * 23590001
022580* DATE OPENED, AND IF THE APPLICABLE DATE VALUES (ONE OF THE 3  * 23600001
022590* AND DATE OPENED) ARE OTHERWISE VALID: CCSS UPDATE IS TO       * 23610001
022600* CONSIDER A TDA- SETTING OF EITHER 'C' OR 'V' AS VALID.        * 23620001
022610*---------------------------------------------------------------* 23630001
022620     IF TDA-VALID-BAL-DATE OR                                     23640001
022630        TDA-DEFAULT-BAL-DATE                                      23650001
022650         MOVE ERC-DATA-IS-VALID     TO CCSS-MTBI-BALANCE-DATE-I   23660001
022660         MOVE TDA-BALANCE-DATE         TO WS-DATE-IN-MMDDCCYY     23670001
022670         SET SLASH-SEPARATOR           TO TRUE                    23680001
022680         PERFORM 5A000-FORMAT-DATE                                23690001
022710         MOVE WS-DATE-OUT              TO CCSS-MTBS-BALANCE-DATE  23700001
022780     ELSE                                                         23710001
022790         MOVE TDA-BALANCE-DATE     TO CCSS-MTBS-BALANCE-DATE      23720001
022800         MOVE ERC-DATA-INVALID TO CCSS-MTBI-BALANCE-DATE-I        23730001
022810     END-IF.                                                      23740001
022820                                                                  23750001
022830     IF TDA-DATE-OF-LAST-PAYMENT-FLAG NOT = ERC-DATA-IS-VALID     23760001
022840         MOVE CRF-DATE-OF-LAST-PAYMENT TO                         23770001
022850              CCSS-MTBS-DATE-LAST-PAY                             23780001
022860         IF CRF-DATE-OF-LAST-PAYMENT = SPACES OR ZEROES           23790001
                  OR (OPS-03-OLD-METRO AND CRF-DOLP-SIX-BYTES = ZEROES) 23800001
022870             MOVE SPACES TO CCSS-MTBS-DATE-LAST-PAY               23810001
022880             MOVE ERC-DATA-IS-OMITTED TO                          23820001
022890                  CCSS-MTBI-DATE-LAST-PAY-I                       23830001
022900         ELSE                                                     23840001
022910             EVALUATE TDA-DATE-OF-LAST-PAYMENT-FLAG               23850001
022920                WHEN ERC-DATA-IS-INVALID                          23860001
022930                    MOVE ERC-DATA-INVALID TO                      23870001
022940                         CCSS-MTBI-DATE-LAST-PAY-I                23880001
022950                WHEN ERC-DATA-IS-BLANK                            23890001
022960                    MOVE ERC-DATA-INVALID TO                      23900001
022970                         CCSS-MTBI-DATE-LAST-PAY-I                23910001
022980                WHEN ERC-DATA-IS-NOT-REPORTED                     23920001
022990                    MOVE ERC-DATA-IS-OMITTED TO                   23930001
023000                         CCSS-MTBI-DATE-LAST-PAY-I                23940001
023010                    MOVE SPACES TO CCSS-MTBS-DATE-LAST-PAY        23950001
023020                WHEN OTHER                                        23960001
023030                    MOVE ERC-DATA-INVALID TO                      23970001
023040                         CCSS-MTBI-DATE-LAST-PAY-I                23980001
023050             END-EVALUATE                                         23990001
023060         END-IF                                                   24000001
023070     ELSE                                                         24010001
023080         MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-DATE-LAST-PAY-I      24020001
023090         MOVE TDA-DATE-OF-LAST-PAYMENT TO WS-DATE-IN-MMDDCCYY     24030001
023100         SET SLASH-SEPARATOR          TO TRUE                     24040001
023110         PERFORM 5A000-FORMAT-DATE                                24050001
023140         MOVE WS-DATE-OUT             TO CCSS-MTBS-DATE-LAST-PAY  24060001
023210     END-IF.                                                      24070001
023220                                                                  24080001
023230*----------------------------------------------------------------*24090001
023240* SCB FIX 04/15/94: CHECK IF THE SEGMENT IS PRESENT AND IF THE    24100001
023250* OPSWITCH INDICATES THAT IT IS TO BE PROCESSED.                  24110001
023260*----------------------------------------------------------------*24120001
           IF OPS-03-OLD-METRO                                          24130001
              MOVE ERC-DATA-IS-VALID TO  CCSS-MTBI-PORTFOLIO-ID-I       24140001
              SET CCSS-MTBS-PORTF-DELETE  TO TRUE.                      24150001
023270     IF (OPS-07-PROCESS-C1 AND CCF-C1-DATA)                       24160001
023270     OR (OPS-08-PROCESS-K2 AND CCF-K2-DATA)                       24170001
023340         PERFORM 12410-SOLD-TO-NAME                               24180001
023360     END-IF.                                                      24190001
023370                                                                  24200001
023380     IF  (OPS-07-PROCESS-F1 AND CCF-F1-DATA)                      24210001
            OR (OPS-08-PROCESS-K1 AND CCF-K1-DATA)                      24230001
023410         PERFORM 12420-ORIG-CREDITOR                              24240001
023420     END-IF.                                                      24250001
023430                                                                  24260001
023440     IF  (OPS-07-PROCESS-G1 AND CCF-G1-DATA)                      24270001
023440     OR  (OPS-08-PROCESS-K4 AND CCF-K4-DATA)                      24280001
023460         PERFORM 12430-DEFERRED-OR-BALLOON-INFO                   24290001
023470     END-IF.                                                      24300001
                                                                        24310001
023270     IF (CCF-M1-DATA AND OPS-07-PROCESS-M1)                       24320001
023270     OR (CCF-K3-DATA AND OPS-08-PROCESS-K3)                       24330001
023340         PERFORM 12440-MORTGAGE-INFO                              24340001
023360     END-IF.                                                      24350001
023830*----------------------------------------------------------------*24710001
023840*  11/08/94 DATAPREP2 PR41002C: WE CAN'T ASSUME THE DATE REPORTED*24720001
023850*  IS VALID IF THIS PROGRAM WAS CALLED ANYMORE; NEW CCSS SAMPLE  *24730001
023860*  REPORTS REQUIRE THAT THE FIELDS BE POPULATED EVEN IF          *24740001
023870*  THE CCSS TRANSACTION IS NOT GOING TO FILE (EXCEPT IF A        *24750001
023880*  RECYCLE TRANSACTION).  POSSIBLE CCSS STATES ARE VALID OR      *24760001
023890*  INVALID FOR PURPOSES OF NEW SAMPLES.  IF NOT VALID, WE        *24770001
023900*  ACCEPT WHATEVER DEFAULT WAS PUT INTO THE TDA-DATE-REPORTED    *24780001
023910*  FIELD WITHOUT CCSS DATE FORMATTING.                           *24790001
023920*                                                                *24800001
023930* 2/07/94 NEW: NEW FLAG SET OF 'C' IN THE TDA- FLAG IF THE       *24810001
023940* BALANCE, OCCURRENCE OR REPORTED DATES ARE OLDER THAN THE       *24820001
023950* DATE OPENED, AND IF THE APPLICABLE DATE VALUES (ONE OF THE 3   *24830001
023960* AND DATE OPENED) ARE OTHERWISE VALID: CCSS UPDATE IS TO        *24840001
023970* CONSIDER A TDA- SETTING OF EITHER 'C' OR 'V' AS VALID.         *24850001
023980*                                                                *24860001
023990* 12/08 4.1.2.47H - REQ. CHANGE: IF BALANCE REPORTER, CCLC640    *24870001
024000* IS CALLED ONLY IF THE BALANCE DATE AND DATE REPORTED ARE       *24880001
024010* VALID.                                                         *24890001
024050*                                                                *24930001
024060* NEW REQUIREMENT (11/17): TRADE OUTPUT CCSS PROGRAM NOT CALLED  *24940001
024070* IF DATE REPORTED IS IN ERROR OR NOT VALID.  THIS WAS ALREADY   *24950001
024080* TRUE WITH REGARDS TO THE BALANCE DATE.                         *24960001
024090*                                                                *24970001
024100* DATE REPORTED FLOWS FROM EITHER DATE OF OCCURRENCE OR          *24980001
024110* CCF-PARM-ACTIVITY-DATE DEPENDING ON OPS SWITCHES AND           *24990001
024120* TABLE VALUES - IT IS EITHER VALID OR INVALID                   *25000001
024130*----------------------------------------------------------------*25010001
024140     IF TDA-VALID-DATE-REPORT OR                                  25020001
024150        TDA-DEFAULT-DATE-REPORT                                   25030001
024170         MOVE ERC-DATA-IS-VALID       TO CCSS-MTBI-DATE-REPORTED-I25040001
024180         MOVE TDA-DATE-REPORTED       TO WS-DATE-IN-MMDDCCYY      25050001
024190         SET SLASH-SEPARATOR          TO TRUE                     25060001
024200         PERFORM 5A000-FORMAT-DATE                                25070001
024230         MOVE WS-DATE-OUT             TO CCSS-MTBS-DATE-REPORTED  25080001
024300     ELSE                                                         25090001
024310         MOVE TDA-DATE-REPORTED    TO CCSS-MTBS-DATE-REPORTED     25100001
024320         MOVE ERC-DATA-INVALID TO CCSS-MTBI-DATE-REPORTED-I       25110001
024330     END-IF.                                                      25120001
024340                                                                  25130001
           IF OPS-03-NEW-METRO AND                                      25140001
              TDA-STATUS-05-OR-13 AND                                   25150001
              TDA-PAY-RATE-C AND                                        25160001
              NOT TDA-SCC-BLANK-STATUS
              IF TDA-CONSUMER-INFO-IND = SPACES                         25170001
                 MOVE ERC-DATA-IS-OMITTED TO CCSS-MTBI-ACTION-DATE-I    25180001
                 MOVE CRF-DATE-OF-OCCURRENCE TO CCSS-MTBS-ACTION-DATE   25190001
              ELSE                                                      25200001
                  IF TDA-VALID-DATE-OF-OCC                              25210001
                  OR TDA-DEFAULT-DATE-OF-OCC                            25220001
                     MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-ACTION-DATE-I  25230001
                     MOVE TDA-DATE-OF-OCCURRENCE                        25240001
                                           TO WS-DATE-IN-MMDDCCYY       25250001
                     SET SLASH-SEPARATOR   TO TRUE                      25260001
                     PERFORM 5A000-FORMAT-DATE                          25270001
                     MOVE WS-DATE-OUT      TO CCSS-MTBS-ACTION-DATE     25280001
                  ELSE                                                  25290001
                     IF (TDA-VALID-BAL-DATE OR                          25300001
                        TDA-DEFAULT-BAL-DATE)                           25310001
                        AND NOT TDA-CIIS-DOFD-REQUIRED                  25320001
                        MOVE ERC-DATA-IS-VALID                          25330001
                                           TO CCSS-MTBI-ACTION-DATE-I   25340001
                        MOVE TDA-BALANCE-DATE                           25350001
                                           TO WS-DATE-IN-MMDDCCYY       25360001
                        SET SLASH-SEPARATOR           TO TRUE           25370001
                        PERFORM 5A000-FORMAT-DATE                       25380001
                        MOVE WS-DATE-OUT                                25390001
                                           TO CCSS-MTBS-ACTION-DATE     25400001
                     ELSE                                               25410001
                        MOVE ERC-DATA-IS-OMITTED                        25420001
                                           TO CCSS-MTBI-ACTION-DATE-I   25430001
                        MOVE CRF-DATE-OF-OCCURRENCE                     25440001
                                           TO CCSS-MTBS-ACTION-DATE     25450001
                     END-IF                                             25460001
                  END-IF                                                25470001
              END-IF                                                    25480001
           ELSE                                                         25490001
              IF OPS-03-NEW-METRO AND                                   25500001
                 TDA-STATUS-05-OR-13 AND                                25510001
                 TDA-PAY-RATE-1-6-G-L AND                               25520001
                 TDA-INVALID-DATE-OF-OCC AND                            25530001
                 NOT TDA-SCC-BLANK-STATUS
                 MOVE ERC-DATA-INVALID TO CCSS-MTBI-ACTION-DATE-I       25540001
                 MOVE CRF-DATE-OF-OCCURRENCE TO CCSS-MTBS-ACTION-DATE   25550001
              ELSE                                                      25560001
                 IF OPS-03-NEW-METRO AND                                25570001
                    TDA-STATUS-05-OR-13                                 25580001
                    AND NOT TDA-PAY-RATE-EXCLUDE AND                    25590001
                    NOT TDA-SCC-BLANK-STATUS
                    IF TDA-VALID-DATE-OF-OCC                            25600001
                    OR TDA-DEFAULT-DATE-OF-OCC                          25610001
                       MOVE ERC-DATA-INVALID                            25620001
                                             TO CCSS-MTBI-ACTION-DATE-I 25630001
                       MOVE TDA-DATE-OF-OCCURRENCE                      25640001
                                             TO WS-DATE-IN-MMDDCCYY     25650001
                       SET SLASH-SEPARATOR   TO TRUE                    25660001
                       PERFORM 5A000-FORMAT-DATE                        25670001
                       MOVE WS-DATE-OUT      TO CCSS-MTBS-ACTION-DATE   25680001
                    ELSE                                                25690001
                       MOVE ERC-DATA-INVALID                            25700001
                                             TO CCSS-MTBI-ACTION-DATE-I 25710001
                       MOVE CRF-DATE-OF-OCCURRENCE                      25720001
                                             TO CCSS-MTBS-ACTION-DATE   25730001
                    END-IF                                              25740001
                 ELSE                                                   25750001
                    IF TDA-VALID-DATE-OF-OCC                            25760001
                    OR TDA-DEFAULT-DATE-OF-OCC                          25770001
                       MOVE ERC-DATA-IS-VALID TO CCSS-MTBI-ACTION-DATE-I25780001
                       MOVE TDA-DATE-OF-OCCURRENCE                      25790001
                                             TO WS-DATE-IN-MMDDCCYY     25800001
                       SET SLASH-SEPARATOR   TO TRUE                    25810001
                       PERFORM 5A000-FORMAT-DATE                        25820001
                       MOVE WS-DATE-OUT      TO CCSS-MTBS-ACTION-DATE   25830001
                    ELSE                                                25840001
                       IF (NOT TDA-STATUS-DOC-REQUIRED)                 25850001
                       AND ((OPS-03-OLD-METRO AND                       25860001
                             TDA-SPECIAL-COMMENT-AK)                    25870001
                            OR (OPS-03-NEW-METRO                        25880001
                                AND TDA-CONSUMER-INFO-IND               25890001
                                NOT = SPACES                            25900001
                                AND NOT TDA-CIIS-DOFD-REQUIRED))        25910001
                            AND (TDA-VALID-BAL-DATE OR                  25920001
                                 TDA-DEFAULT-BAL-DATE)                  25930001
                            MOVE ERC-DATA-IS-VALID                      25940001
                                       TO CCSS-MTBI-ACTION-DATE-I       25950001
                            MOVE TDA-BALANCE-DATE                       25960001
                                       TO WS-DATE-IN-MMDDCCYY           25970001
                            SET SLASH-SEPARATOR           TO TRUE       25980001
                            PERFORM 5A000-FORMAT-DATE                   25990001
                            MOVE WS-DATE-OUT                            26000001
                                       TO CCSS-MTBS-ACTION-DATE         26010001
                       ELSE                                             26020001
                          IF (CRF-DATE-OF-OCCURRENCE = ZEROES OR SPACES)26030001
                          OR (OPS-03-OLD-METRO AND                      26040001
                              CRF-DOO-SIX-BYTES = ZEROES)               26050001
                               MOVE ERC-DATA-IS-OMITTED                 26060001
                                              TO CCSS-MTBI-ACTION-DATE-I26070001
                               MOVE SPACES    TO CCSS-MTBS-ACTION-DATE  26080001
                          ELSE                                          26090001
                              MOVE ERC-DATA-INVALID                     26100001
                                              TO CCSS-MTBI-ACTION-DATE-I26110001
                              MOVE CRF-DATE-OF-OCCURRENCE               26120001
                                              TO CCSS-MTBS-ACTION-DATE  26130001
                          END-IF                                        26140001
                       END-IF                                           26150001
                    END-IF                                              26160001
                 END-IF                                                 26170001
              END-IF                                                    26180001
           END-IF.                                                      26190001
024600*                                                                 26200001
024610**** 10/27/94 SAVE THE FORMATTED DATE OF OCCURRENCE OF THE        26210001
024620****          FIRST VALID ACTIVE RECORD                           26220001
024630****          (STATUS 11 AND BALANCE GREATER THAN ZEROS)          26230001
024640*                                                                 26240001
024670     IF  CCF-NEW-AHA-DATE-OF-OCCUR = HIGH-VALUES                  26270001
           AND WS-OUTPUT-TO-CCSS
           AND TDA-STATUS-11
           AND CCSS-MTBS-BALANCE-AMT > ZERO
024690         IF  OPS-03-OLD-METRO                                     26290001
024700         AND CCSS-MTBI-ACTION-DATE-I =  ERC-DATA-IS-VALID         26300001
024710             MOVE CCSS-MTBS-ACTION-DATE TO                        26320001
024720                                      CCF-NEW-AHA-DATE-OF-OCCUR   26330001
               ELSE                                                     26340001
                  IF  OPS-03-NEW-METRO                                  26350001
                  AND CCSS-MTBI-BALANCE-DATE-I = ERC-DATA-IS-VALID      26360001
                      MOVE CCSS-MTBS-BALANCE-DATE TO                    26380001
                                   CCF-NEW-AHA-DATE-OF-OCCUR            26390001
                  END-IF
               END-IF
           END-IF.
024730*                                                                 26400001
024740**** ICP 4102 LPISCH.                                             26410001
024750**** 07/15/96 SAVE THE CCF-MESSAGE-SEG-FLAG IF ONE EXSISTS, OF    26420001
024760****          HIGHEST PRIORITY VALUE OF THE ACTIVE RECORD         26430001
024770*                                                                 26440001
024780     IF CCF-NO-SEGMENT                                            26450001
024790           CONTINUE                                               26460001
024800     ELSE                                                         26470001
024810        IF WS-MESSAGE-OUT-FLAG = SPACE                            26480001
024820             MOVE CCF-MESSAGE-SEG-FLAG TO WS-MESSAGE-OUT-FLAG     26490001
024830             SET OPTL-MSG-LOAD-PENDING           TO TRUE          26500001
024840        ELSE                                                      26510001
024850         IF CCF-MESSAGE-SEG-FLAG < WS-MESSAGE-OUT-FLAG            26520001
024860             MOVE CCF-MESSAGE-SEG-FLAG TO WS-MESSAGE-OUT-FLAG     26530001
024870             SET OPTL-MSG-LOAD-PENDING           TO TRUE          26540001
024880         END-IF                                                   26550001
024890        END-IF                                                    26560001
024900     END-IF.                                                      26570001
024910                                                                  26580001
024920 EJECT.                                                           26590001
025550******************************************************************26600001
025560 12410-SOLD-TO-NAME.                                              26610001
025570******************************************************************26620001
025580*----------------------------------------------------------------*26630001
025590*   12410-SOLD-TO-NAME.                                          *26640001
025600*   PERFORMED FROM: 12400-LOAD-TRADE-BASE-PACKAGES.              *26650001
025610*   PASSED PARAMETER REQUIREMENTS: OPS SWITCH SETTINGS FOR       *26660001
025620*                       C1 SEGMENT OR K2 SEGMENT                 *26670001
025630*   FUNCTION: POPULATE CORRECT CCSS FIELDS BASED ON OPS 7 OR 8,  *26680001
025640*             SET CORRECT INDICATOR TO CORRECT STATUS.           *26690001
025670*             IF THIS PARAGRAPH IS NOT CALLED (NO C1).           *26700001
025680*----------------------------------------------------------------*26710001
                                                                        26720001
025820     MOVE TDA-PORTF-IND       TO CCSS-MTBS-PORTFOLIO-ID.          26730001
025820     MOVE TDA-PORTF-NAME      TO CCSS-MTBS-SOLD-TO-NAME.          26740001
           IF TDA-PORTF-IND-INVALID                                     26750001
              MOVE ERC-DATA-IS-OMITTED                                  26760001
                                        TO CCSS-MTBI-SOLD-TO-NAME-I     26770001
              MOVE ERC-DATA-IS-VALID                                    26780001
                                      TO CCSS-MTBI-PORTFOLIO-ID-I       26790001
              SET CCSS-MTBS-PORTF-DELETE TO TRUE                        26800001
           ELSE                                                         26810001
              IF TDA-PORTF-NAME-VALID                                   26820001
                 MOVE TDA-PORTF-NAME-FLAG                               26830001
                                      TO CCSS-MTBI-SOLD-TO-NAME-I       26840001
                 MOVE ERC-DATA-IS-VALID                                 26850001
                                      TO CCSS-MTBI-PORTFOLIO-ID-I       26860001
                 IF OPS-03-OLD-METRO                                    26870001
                    MOVE CNST-VALUE-2 TO CCSS-MTBS-PORTFOLIO-ID         26880001
                 END-IF                                                 26890001
              ELSE                                                      26900001
                 IF TDA-PORTF-IND-NAME-XERR-Y                           26910001
                    MOVE ERC-DATA-IS-OMITTED                            26920001
                                      TO CCSS-MTBI-SOLD-TO-NAME-I       26930001
                    MOVE ERC-DATA-IS-VALID                              26940001
                                      TO CCSS-MTBI-PORTFOLIO-ID-I       26950001
                    MOVE CRF-K2-SOLD-TO-NAME                            26960001
                                      TO CCSS-MTBS-SOLD-TO-NAME         26970001
                 ELSE                                                   26980001
                    IF TDA-PORTF-NAME-INVALID                           26990001
                       MOVE ERC-DATA-IS-OMITTED                         27000001
                                      TO CCSS-MTBI-SOLD-TO-NAME-I       27010001
                       SET CCSS-MTBS-PORTF-DELETE TO TRUE               27020001
                       MOVE ERC-DATA-IS-VALID                           27030001
                                      TO CCSS-MTBI-PORTFOLIO-ID-I       27040001
                       IF OPS-03-OLD-METRO                              27050001
                          MOVE CRF-C1-DATA                              27060001
                                      TO CCSS-MTBS-SOLD-TO-NAME         27070001
                       ELSE                                             27080001
                          MOVE CRF-K2-SOLD-TO-NAME                      27090001
                                      TO CCSS-MTBS-SOLD-TO-NAME         27100001
                       END-IF                                           27110001
                    END-IF                                              27120001
                 END-IF                                                 27130001
              END-IF                                                    27140001
           END-IF.                                                      27150001
                                                                        27160001
025830 EJECT.                                                           27170001
025840******************************************************************27180001
025850 12420-ORIG-CREDITOR.                                             27190001
025860******************************************************************27200001
025870*----------------------------------------------------------------*27210001
025880*   12420-ORIG-CREDITOR.                                         *27220001
025890*   PERFORMED FROM: 12400-LOAD-TRADE-BASE-PACKAGES.              *27230001
025900*   PASSED PARAMETER REQUIREMENTS: OPS SWITCH SETTINGS FOR       *27240001
025910*                       F1 SEGMENT.                              *27250001
025920*   FUNCTION: POPULATE THE ORIGINAL CREDITOR AND CREDITOR CLASS  *27260001
025930*             FIELDS AND THEIR CORRESPONDING INDICATORS REGARD-  *27270001
025940*             LESS OF WHETHER IT COMES FROM AN F1 OR K1 SEGMENT. *27280001
025950*             ONE OF THESE SEGMENTS MUST BE PRESENT AND OPS07 OR *27290001
025960*             OPS08 MUST BE SET TO PROCESS ORIGINAL CREDITOR IN  *27300001
025960*             ORDER TO MAKE IT TO THIS ROUTINE.  FOR METRO1      *27310001
025960*             VENDORS, THE TDA CREDITOR CLASS FLAG IS BLANK, SO  *27320001
025960*             IT WILL TAKE THE CCSS DEFAULT OF O.                *27330001
025970*----------------------------------------------------------------*27340001
025990                                                                  27350001
026030     MOVE TDA-ORIG-CRED-NAME TO CCSS-MTBS-ORIG-CRDR-NAME.         27360001

           IF TDA-ORIG-CRED-NAME-INVALID
              MOVE ERC-DATA-INVALID
                                   TO CCSS-MTBI-ORIG-CRDR-NAME-I
           ELSE
              MOVE TDA-ORIG-CRED-NAME-FLAG
                                   TO CCSS-MTBI-ORIG-CRDR-NAME-I
           END-IF.

           IF TDA-ORIG-CRED-NAME-OMITTED                                27400001
              OR TDA-ORIG-CRED-NAME-INVALID                             27410001
              MOVE SPACES TO CCSS-MTBS-CREDITOR-CLASS                   27420001
              MOVE ERC-DATA-IS-OMITTED                                  27430001
026060                             TO CCSS-MTBI-CREDITOR-CLASS-I        27440001
           ELSE                                                         27450001
               MOVE TDA-CREDITOR-CLASS                                  27460001
                                   TO CCSS-MTBS-CREDITOR-CLASS          27470001
026040         IF TDA-CREDITOR-CLASS-FLAG NOT EQUAL SPACES              27480001
026050            MOVE TDA-CREDITOR-CLASS-FLAG                          27490001
026060                             TO CCSS-MTBI-CREDITOR-CLASS-I.       27500001
                                                                        27510001
026140 EJECT.                                                           27520001
026150******************************************************************27530001
026160 12430-DEFERRED-OR-BALLOON-INFO.                                  27540001
026170******************************************************************27550001
026180*----------------------------------------------------------------*27560001
026190*   12430-DEFERRED-OR-BALLOON-INFO.                              *27570001
026200*   PERFORMED FROM: 12400-LOAD-TRADE-BASE-PACKAGES.              *27580001
026210*   PASSED PARAMETER REQUIREMENTS: OPS SWITCH SETTINGS FOR       *27590001
026220*                       G1 SEGMENT OR K4 SEGMENT.                *27600001
026230*   FUNCTION: POPULATE CORRECT CCSS FIELDS BASED ON OPS , AND    *27610001
026240*             SET CORRECT INDICATOR TO CORRECT STATUS            *27620001
026250*----------------------------------------------------------------*27630001
026340*----------------------------------------------------------------*27640001
           MOVE TDA-SPECIAL-PAY-IND     TO CCSS-MTBS-SPCL-PAY-CODE.     27650001
           IF TDA-SPECIAL-PAYIND-INVALID                                27660001
              MOVE TDA-SPECIAL-PAYIND-FLAG TO CCSS-MTBI-SPCL-PAY-CODE-I 27670001
              MOVE ERC-DATA-IS-OMITTED     TO CCSS-MTBI-SPCL-PAY-DATE-I 27680001
              MOVE ERC-DATA-IS-OMITTED     TO CCSS-MTBI-SPCL-PAY-AMT-I  27690001
           ELSE                                                         27700001
              IF TDA-SPECIAL-PAY-IND-DEFERRED                           27710001
                 PERFORM 12433-DEFERRED-DATE                            27720001
              ELSE                                                      27730001
                 IF TDA-SPECIAL-PAY-IND-BALLOON                         27740001
                    PERFORM 12436-BALLOON-INFO                          27750001
                 END-IF                                                 27760001
              END-IF                                                    27770001
           END-IF.                                                      27780001
026680 EJECT.                                                           27790001
026150******************************************************************27800001
026160 12433-DEFERRED-DATE.                                             27810001
026170******************************************************************27820001
           IF TDA-DEFERRED-DATE-VALID                                   27830001
              MOVE TDA-SPECIAL-PAYIND-FLAG TO CCSS-MTBI-SPCL-PAY-CODE-I 27840001
              MOVE TDA-DEFERRED-DATE-FLAG  TO CCSS-MTBI-SPCL-PAY-DATE-I 27850001
              MOVE TDA-DEF-START-DATE      TO WS-DATE-IN-MMDDCCYY       27860001
              SET SLASH-SEPARATOR          TO TRUE                      27870001
              PERFORM 5A000-FORMAT-DATE                                 27880001
              MOVE WS-DATE-OUT             TO CCSS-MTBS-SPCL-PAY-DATE   27890001
           ELSE                                                         27900001
              MOVE ERC-DATA-INVALID        TO CCSS-MTBI-SPCL-PAY-CODE-I 27910001
              MOVE ERC-DATA-INVALID                                     27920001
                                           TO CCSS-MTBI-SPCL-PAY-DATE-I 27930001
              IF TDA-DEFERRED-DATE-INVALID                              27940001
                 MOVE CRF-K4-DEF-START-DATE                             27950001
                                           TO CCSS-MTBS-SPCL-PAY-DATE   27960001
              END-IF                                                    27970001
           END-IF.                                                      27980001
026150******************************************************************27990001
026160 12436-BALLOON-INFO.                                              28000001
026180*----------------------------------------------------------------*28010001
026190*   TRADE WILL USE THE BALLOON AMOUNT EVEN IF THE BALLOON DATE   *28020001
026200*   IS NOT PRESENT OR INVALID.  BUT THE BALLOON DATE CANNOT BE   *28030001
026210*   USED UNLESS WE HAVE A VALID BALLOON AMOUNT.                  *28040001
026170******************************************************************28050001
           IF TDA-BALLOON-DUE-DATE-VALID                                28060001
              AND TDA-BALLOON-AMOUNT-VALID                              28070001
              MOVE TDA-SPECIAL-PAYIND-FLAG TO CCSS-MTBI-SPCL-PAY-CODE-I 28080001
              MOVE TDA-BALLOON-AMOUNT-FLAG                              28090001
                                           TO CCSS-MTBI-SPCL-PAY-AMT-I  28100001
              MOVE TDA-BALLOON-DUE-DATE-FLAG                            28110001
                                           TO CCSS-MTBI-SPCL-PAY-DATE-I 28120001
              MOVE TDA-BALLOON-AMOUNT-NUMERIC                           28130001
                                           TO CCSS-MTBS-SPCL-PAY-AMT    28140001
              MOVE TDA-BALLOON-DUE-DATE    TO WS-DATE-IN-MMDDCCYY       28150001
              SET SLASH-SEPARATOR          TO TRUE                      28160001
              PERFORM 5A000-FORMAT-DATE                                 28170001
              MOVE WS-DATE-OUT             TO CCSS-MTBS-SPCL-PAY-DATE   28180001
           ELSE                                                         28190001
              IF TDA-BALLOON-AMOUNT-VALID                               28200001
                 MOVE TDA-SPECIAL-PAYIND-FLAG                           28210001
                                           TO CCSS-MTBI-SPCL-PAY-CODE-I 28220001
                 MOVE TDA-BALLOON-AMOUNT-FLAG                           28230001
                                           TO CCSS-MTBI-SPCL-PAY-AMT-I  28240001
                 MOVE TDA-BALLOON-DUE-DATE-FLAG                         28250001
                                           TO CCSS-MTBI-SPCL-PAY-DATE-I 28260001
                 MOVE TDA-BALLOON-AMOUNT-NUMERIC                        28270001
                                           TO CCSS-MTBS-SPCL-PAY-AMT    28280001
                 IF OPS-03-NEW-METRO                                    28290001
                    MOVE CRF-K4-PAYMENT-DUE-DATE                        28300001
                                           TO CCSS-MTBS-SPCL-PAY-DATE   28310001
                 ELSE                                                   28320001
                    MOVE CRF-G1-PAYMENT-DUE-DATE                        28330001
                                           TO CCSS-MTBS-SPCL-PAY-DATE   28340001
                 END-IF                                                 28350001
              ELSE                                                      28360001
                 IF TDA-BALLOON-DUE-DATE-VALID                          28370001
                    MOVE ERC-DATA-INVALID                               28380001
                                           TO CCSS-MTBI-SPCL-PAY-CODE-I 28390001
                    MOVE ERC-DATA-INVALID                               28400001
                                           TO CCSS-MTBI-SPCL-PAY-AMT-I  28410001
                    MOVE ERC-DATA-INVALID                               28420001
                                           TO CCSS-MTBI-SPCL-PAY-DATE-I 28430001
                    MOVE TDA-BALLOON-DUE-DATE    TO WS-DATE-IN-MMDDCCYY 28440001
                    SET SLASH-SEPARATOR    TO TRUE                      28450001
                    PERFORM 5A000-FORMAT-DATE                           28460001
                    MOVE WS-DATE-OUT       TO CCSS-MTBS-SPCL-PAY-DATE   28470001
                 ELSE                                                   28480001
                    IF TDA-BALLOON-AMOUNT-OMITTED                       28490001
                       AND TDA-BALLOON-DUE-DATE-OMITTED                 28500001
                       MOVE ERC-DATA-INVALID                            28510001
                                           TO CCSS-MTBI-SPCL-PAY-CODE-I 28520001
                       MOVE ERC-DATA-INVALID                            28530001
                                           TO CCSS-MTBI-SPCL-PAY-AMT-I  28540001
                       MOVE ERC-DATA-INVALID                            28550001
                                           TO CCSS-MTBI-SPCL-PAY-DATE-I 28560001
                       IF OPS-03-NEW-METRO                              28570001
                          MOVE CRF-K4-PAYMENT-DUE-DATE                  28580001
                                           TO CCSS-MTBS-SPCL-PAY-DATE   28590001
                       ELSE                                             28600001
                          MOVE CRF-G1-PAYMENT-DUE-DATE                  28610001
                                           TO CCSS-MTBS-SPCL-PAY-DATE   28620001
                       END-IF                                           28630001
                    ELSE                                                28640001
                       MOVE ERC-DATA-INVALID                            28650001
                                          TO CCSS-MTBI-SPCL-PAY-CODE-I  28660001
                       MOVE TDA-BALLOON-AMOUNT-FLAG                     28670001
                                           TO CCSS-MTBI-SPCL-PAY-AMT-I  28680001
                       MOVE TDA-BALLOON-DUE-DATE-FLAG                   28690001
                                           TO CCSS-MTBI-SPCL-PAY-DATE-I 28700001
                       IF OPS-03-NEW-METRO                              28710001
                          MOVE CRF-K4-PAYMENT-DUE-DATE                  28720001
                                           TO CCSS-MTBS-SPCL-PAY-DATE   28730001
                       ELSE                                             28740001
                          MOVE CRF-G1-PAYMENT-DUE-DATE                  28750001
                                           TO CCSS-MTBS-SPCL-PAY-DATE   28760001
                       END-IF                                           28770001
                    END-IF                                              28780001
                 END-IF                                                 28790001
              END-IF                                                    28800001
           END-IF.                                                      28810001
026150******************************************************************28820001
026160 12440-MORTGAGE-INFO.                                             28830001
026170******************************************************************28840001
026180*----------------------------------------------------------------*28850001
026190*   12440-MORTGAGE-INFO.                                         *28860001
026200*   PERFORMED FROM: 12400-LOAD-TRADE-BASE-PACKAGES.              *28870001
026210*   PASSED PARAMETER REQUIREMENTS: OPS SWITCH SETTINGS FOR       *28880001
026220*                       M1 OR K3 SEGMENT.                        *28890001
026230*   FUNCTION: POPULATE CORRECT CCSS FIELDS BASED ON OPS 7 OR 8,  *28900001
026240*             SET CORRECT INDICATOR TO CORRECT STATUS            *28910001
026250*----------------------------------------------------------------*28920001
           MOVE TDA-AGENCY-ID            TO CCSS-MTBS-SEC-AGCY-ID.      28930001
           IF TDA-AGENCY-ID-INVALID                                     28940001
              MOVE TDA-AGENCY-ID-FLAG    TO CCSS-MTBI-SEC-AGCY-ID-I     28950001
              IF TDA-MORTGAGE-ACCT-NUM-OMITTED                          28960001
                 MOVE TDA-MORTGAGE-ACCT-NUM-FLAG                        28970001
                                         TO CCSS-MTBI-SEC-AGCY-ACCT-I   28980001
              ELSE                                                      28990001
                 MOVE ERC-DATA-INVALID                                  29000001
                                         TO CCSS-MTBI-SEC-AGCY-ACCT-I   29010001
                 IF TDA-MORTGAGE-ACCT-NUM-VALID                         29020001
                    MOVE TDA-MORTGAGE-ACCT-NUM                          29030001
                                         TO CCSS-MTBS-SEC-AGCY-ACCT     29040001
                 ELSE                                                   29050001
                    IF CCF-M1-DATA                                      29060001
                       MOVE CRF-M1-ACCOUNT-NUMBER                       29070001
                                         TO CCSS-MTBS-SEC-AGCY-ACCT     29080001
                    ELSE                                                29090001
                       MOVE CRF-K3-ACCOUNT-NUMBER                       29100001
                                         TO CCSS-MTBS-SEC-AGCY-ACCT     29110001
                    END-IF                                              29120001
                 END-IF                                                 29130001
              END-IF                                                    29140001
           ELSE                                                         29150001
              IF TDA-AGENCY-ID-00                                       29160001
                 IF TDA-MORTGAGE-ACCT-NUM-OMITTED                       29170001
                    MOVE TDA-MORTGAGE-ACCT-NUM-FLAG                     29180001
                                         TO CCSS-MTBI-SEC-AGCY-ACCT-I   29190001
                    MOVE ERC-DATA-IS-OMITTED                            29200001
                                         TO CCSS-MTBI-SEC-AGCY-ID-I     29210001
                 ELSE                                                   29220001
                    MOVE ERC-DATA-INVALID                               29230001
                                         TO CCSS-MTBI-SEC-AGCY-ACCT-I   29240001
                    MOVE ERC-DATA-INVALID                               29250001
                                         TO CCSS-MTBI-SEC-AGCY-ID-I     29260001
                    IF CCF-M1-DATA                                      29270001
                       MOVE CRF-M1-ACCOUNT-NUMBER                       29280001
                                         TO CCSS-MTBS-SEC-AGCY-ACCT     29290001
                    ELSE                                                29300001
                       MOVE CRF-K3-ACCOUNT-NUMBER                       29310001
                                         TO CCSS-MTBS-SEC-AGCY-ACCT     29320001
                    END-IF                                              29330001
                 END-IF                                                 29340001
              ELSE                                                      29350001
                 IF TDA-AGENCY-ID-01-02                                 29360001
                    IF TDA-MORTGAGE-ACCT-NUM-OMITTED                    29370001
                    OR TDA-MORTGAGE-ACCT-NUM-INVALID                    29380001
                       MOVE ERC-DATA-INVALID                            29390001
                                         TO CCSS-MTBI-SEC-AGCY-ACCT-I   29400001
                       MOVE ERC-DATA-IS-OMITTED                         29410001
                                         TO CCSS-MTBI-SEC-AGCY-ID-I     29420001
                       IF CCF-M1-DATA                                   29430001
                          MOVE CRF-M1-ACCOUNT-NUMBER                    29440001
                                         TO CCSS-MTBS-SEC-AGCY-ACCT     29450001
                       ELSE                                             29460001
                          MOVE CRF-K3-ACCOUNT-NUMBER                    29470001
                                         TO CCSS-MTBS-SEC-AGCY-ACCT     29480001
                       END-IF                                           29490001
                    ELSE                                                29500001
                       MOVE TDA-AGENCY-ID-FLAG                          29510001
                                         TO CCSS-MTBI-SEC-AGCY-ID-I     29520001
                       MOVE TDA-MORTGAGE-ACCT-NUM-FLAG                  29530001
                                         TO CCSS-MTBI-SEC-AGCY-ACCT-I   29540001
                       MOVE TDA-MORTGAGE-ACCT-NUM                       29550001
                                         TO CCSS-MTBS-SEC-AGCY-ACCT     29560001
                    END-IF                                              29570001
                 END-IF                                                 29580001
              END-IF                                                    29590001
           END-IF.                                                      29600001
                                                                        29610001
026520     MOVE TDA-MORTGAGE-ID-NUMBER   TO CCSS-MTBS-MIN.              29620001
026520     MOVE TDA-MORTGAGE-ID-NUMBER-FLAG                             29630001
026520                                   TO CCSS-MTBI-MIN-I.            29640001
026690******************************************************************29650001
026700 12460-AMOUNT-ORIGINAL.                                           29660001
026710******************************************************************29670001
026720*----------------------------------------------------------------*29680001
026730*   12460-AMOUNT-ORIGINAL                                        *29690001
026740*   PERFORMED FROM: 12400-LOAD-TRADE-BASE-PACKAGES.              *29700001
026750*   PASSED PARAMETER REQUIREMENTS: OPS 33 AND APPROPRIATE TDA-CRF*29710001
026760*      AMOUNT FIELDS                                             *29720001
026770*   FUNCTION: POPULATE CCSS CREDIT/LOAN AMOUNT FIELD BASED ON    *29730001
026780*         THE AMOUNT QUALIFIER.                                  *29740001
026790*----------------------------------------------------------------*29750001
026800     IF TDA-AMOUNT-NUMERIC IS NUMERIC AND                         29760001
026810        TDA-AMOUNT-NUMERIC > ZEROES                               29770001
026820         MOVE TDA-AMOUNT-NUMERIC       TO CCSS-MTBS-CR-LIMIT      29780001
026830     ELSE                                                         29790001
026840         IF  OPS-03-NEW-METRO AND CRF-AMOUNT-NUMERIC IS NUMERIC   29800001
026850             MOVE CRF-AMOUNT-NUMERIC   TO CCSS-MTBS-CR-LIMIT      29810001
               ELSE                                                     29820001
                  IF OPS-03-OLD-METRO AND CRF-AMOUNT7-NUMERIC NUMERIC   29830001
                     MOVE CRF-AMOUNT7-NUMERIC TO CCSS-MTBS-CR-LIMIT     29840001
                  END-IF                                                29850001
026860         END-IF                                                   29860001
026870     END-IF.                                                      29870001
026880                                                                  29880001
026890     IF TDA-AMOUNT-FLAG = ERC-DATA-IS-VALID                       29890001
026900         MOVE ERC-DATA-IS-VALID        TO CCSS-MTBI-CR-LIMIT-I    29900001
026910     ELSE                                                         29910001
              IF TDA-AMOUNT-FLAG = ERC-DATA-INVALID
                 MOVE ERC-DATA-IS-OMITTED TO CCSS-MTBI-CR-LIMIT-I
              ELSE
026920           IF (TDA-AMOUNT-FLAG = ERC-DATA-IS-INVALID)         OR  29920001
026930              (TDA-AMOUNT-FLAG = ERC-DATA-CHANGED-TO-DEFAULT) OR  29930001
026940              (TDA-AMOUNT-FLAG = ERC-DATA-IS-BLANK  AND           29940001
026950              ((OPS-03-NEW-METRO AND  CRF-AMOUNT NOT = SPACES)    29950001
026950               OR (OPS-03-OLD-METRO AND CRF-AMOUNT7 NOT = SPACES))29960001
000000              AND ((OPS-03-NEW-METRO AND  CRF-AMOUNT NOT = ZEROS) 29970001
026950               OR (OPS-03-OLD-METRO AND CRF-AMOUNT7 NOT = ZEROS)))29980001
026970               MOVE ERC-DATA-INVALID TO CCSS-MTBI-CR-LIMIT-I      29990001
                 END-IF
026980        END-IF                                                    30000001
026990     END-IF.                                                      30010001
027000                                                                  30020001
027010 EJECT.                                                           30030001
027020******************************************************************30040001
027030 12470-AMOUNT-HI-BALANCE.                                         30050001
027040******************************************************************30060001
027050*----------------------------------------------------------------*30070001
027060*   12470-AMOUNT-HI-BALANCE                                      *30080001
027070*   PERFORMED FROM: 12400-LOAD-TRADE-BASE-PACKAGES.              *30090001
027080*   PASSED PARAMETER REQUIREMENTS: OPS 33 AND APPROPRIATE TDA-CRF*30100001
027090*      AMOUNT FIELDS (PERFORMED ONLY IF OPS33 = 'Y')             *30110001
027100*   FUNCTION: POPULATE CCSS CREDIT/LOAN AMOUNT FIELD BASED ON    *30120001
027110*         THE AMOUNT QUALIFIER.                                  *30130001
027120*----------------------------------------------------------------*30140001
130        IF ((TDA-CREDIT-LIMIT-NUMERIC IS NUMERIC AND                 30150001
140           TDA-CREDIT-LIMIT-NUMERIC > ZEROES)                        30160001
           OR (TDA-VALID-CREDIT-LIMIT AND                               30170001
               TDA-CREDIT-LIMIT = ZEROES))                              30180001
150            MOVE TDA-CREDIT-LIMIT-NUMERIC TO CCSS-MTBS-CR-LIMIT      30190001
160        ELSE                                                         30200001
170            IF OPS-03-NEW-METRO AND                                  30210001
170               CRF-CREDIT-LIMIT-NUMERIC NUMERIC                      30220001
180               MOVE CRF-CREDIT-LIMIT-NUMERIC TO CCSS-MTBS-CR-LIMIT   30230001
160            ELSE                                                     30240001
170                IF OPS-03-OLD-METRO AND                              30250001
170                   CRF-CREDIT-LIMIT7-NUMERIC NUMERIC                 30260001
180                   MOVE CRF-CREDIT-LIMIT7-NUMERIC                    30270001
180                                           TO CCSS-MTBS-CR-LIMIT     30280001
200                END-IF                                               30290001
200             END-IF                                                  30291001
200         END-IF.                                                     30292001
027220                                                                  30293001
           IF OPS-31-CREDIT-LIMIT-BLANK                                 30294001
              IF ((OPS-03-NEW-METRO                                     30295001
              AND CRF-CREDIT-LIMIT NOT = SPACES                         30296001
              AND CRF-CREDIT-LIMIT-NUMERIC NOT NUMERIC) OR              30297001
                  (OPS-03-OLD-METRO                                     30298001
              AND CRF-CREDIT-LIMIT7 NOT = SPACES                        30299001
              AND CRF-CREDIT-LIMIT7-NUMERIC NOT NUMERIC))               30300001
                 MOVE ERC-DATA-INVALID TO CCSS-MTBI-CR-LIMIT-I          30310001
              END-IF                                                    30320001
           ELSE                                                         30330001
027230        IF TDA-CREDIT-LIMIT-FLAG = ERC-DATA-IS-VALID              30340001
027240            MOVE ERC-DATA-IS-VALID        TO CCSS-MTBI-CR-LIMIT-I 30350001
027250        ELSE                                                      30360001
027260            IF (TDA-CREDIT-LIMIT-FLAG = ERC-DATA-IS-INVALID) OR   30370001
027270               (TDA-CREDIT-LIMIT-FLAG =                           30380001
027280                ERC-DATA-CHANGED-TO-DEFAULT)                 OR   30390001
027290               ((TDA-CREDIT-LIMIT-FLAG = ERC-DATA-IS-BLANK OR     30400001
027290                 TDA-CREDIT-LIMIT-FLAG = ERC-DATA-IS-UNUSED) AND  30410001
027300               ((OPS-03-NEW-METRO AND                             30420001
027300                 CRF-CREDIT-LIMIT NOT = SPACES) OR                30421001
027300                 (OPS-03-OLD-METRO AND                            30422001
027300                  CRF-CREDIT-LIMIT7 NOT = SPACES)) AND            30423001
027300                 ((OPS-03-NEW-METRO AND                           30424001
027300                   CRF-CREDIT-LIMIT NOT = ZEROS) OR               30425001
027300                 (OPS-03-OLD-METRO AND                            30426001
027300                   CRF-CREDIT-LIMIT7 NOT = ZEROS)))               30427001
027350                MOVE ERC-DATA-INVALID TO CCSS-MTBI-CR-LIMIT-I     30428001
                  END-IF                                                30429001
027360         END-IF                                                   30430001
027370     END-IF.                                                      30440001
027380                                                                  30450001
027390 EJECT.                                                           30460001
027970******************************************************************30940001
027980 12490-AMOUNT-CREDIT-LIMIT.                                       30950001
027990******************************************************************30960001
028000*----------------------------------------------------------------*30970001
028010*   12480-AMOUNT-CREDIT-LIMIT                                    *30980001
028020*   PERFORMED FROM: 12400-LOAD-TRADE-BASE-PACKAGES.              *30990001
028030*   PASSED PARAMETER REQUIREMENTS: APPROPRIATE TDA-CRF-AMOUNT    *31000001
028040*      FIELDS                                                    *31010001
028050*   FUNCTION: POPULATE CCSS CREDIT/LOAN AMOUNT FIELD BASED ON    *31020001
028060*         THE AMOUNT QUALIFIER.                                  *31030001
028070*----------------------------------------------------------------*31040001
028190     IF ((TDA-CREDIT-LIMIT-NUMERIC IS NUMERIC AND                 31050001
028200        TDA-CREDIT-LIMIT-NUMERIC > ZEROES)                        31060001
              OR (TDA-VALID-CREDIT-LIMIT AND                            31070001
                  TDA-CREDIT-LIMIT = ZEROES))                           31080001
028210         MOVE TDA-CREDIT-LIMIT-NUMERIC TO CCSS-MTBS-CR-LIMIT      31090001
028220     ELSE                                                         31100001
028230         IF OPS-03-NEW-METRO AND                                  31110001
028230            CRF-AMOUNT-NUMERIC IS NUMERIC                         31120001
028240             MOVE CRF-AMOUNT-NUMERIC   TO CCSS-MTBS-CR-LIMIT      31130001
028220         ELSE                                                     31140001
028230             IF OPS-03-OLD-METRO AND                              31150001
028230                CRF-AMOUNT7-NUMERIC IS NUMERIC                    31160001
028240                MOVE CRF-AMOUNT7-NUMERIC                          31170001
028240                                       TO CCSS-MTBS-CR-LIMIT      31180001
028250             END-IF                                               31190001
028250         END-IF                                                   31200001
028260     END-IF.                                                      31210001
028280                                                                  31220001
028290     IF TDA-CREDIT-LIMIT-FLAG = ERC-DATA-IS-VALID                 31230001
028300         MOVE ERC-DATA-IS-VALID        TO CCSS-MTBI-CR-LIMIT-I    31240001
028310     ELSE                                                         31250001
028320         IF (TDA-CREDIT-LIMIT-FLAG = ERC-DATA-IS-INVALID)         31260001
028330                                              OR                  31270001
028340            (TDA-CREDIT-LIMIT-FLAG = ERC-DATA-CHANGED-TO-DEFAULT) 31280001
028350                                              OR                  31290001
028360            ((TDA-CREDIT-LIMIT-FLAG = ERC-DATA-IS-BLANK) AND      31300001
028370             ((OPS-03-NEW-METRO AND CRF-CREDIT-LIMIT NOT = SPACES)31310001
028370             OR (OPS-03-OLD-METRO AND                             31320001
028370                 CRF-CREDIT-LIMIT7 NOT = SPACES)) AND             31330001
028370             ((OPS-03-NEW-METRO AND CRF-CREDIT-LIMIT NOT = ZEROS) 31340001
028370             OR (OPS-03-OLD-METRO AND                             31350001
028370                 CRF-CREDIT-LIMIT7 NOT = ZEROS)))                 31360001
028390             MOVE ERC-DATA-INVALID TO CCSS-MTBI-CR-LIMIT-I        31370001
028400         END-IF                                                   31380001
028410     END-IF.                                                      31390001
028420                                                                  31400001
028430 EJECT.                                                           31410001
028440******************************************************************31420001
028450 30000-PROCESS-CONSUMER-SEG.                                      31430001
028460******************************************************************31440001
028470*----------------------------------------------------------------*31450001
028480*   30000-PROCESS-CONSUMER-SEG.                                  *31460001
028490*   PERFORMED FROM: 0B000-CHECK-TRADE-KEY.                       *31470001
028500*   PASSED PARAMETER REQUIREMENTS: CONSUMER SEGMENT INPUT DATA   *31480001
028510*                                  FROM LINKAGE (CCLACDA).       *31490001
028520*   FUNCTION: CHECK FOR CONSUMER COUNT OVERFLOW AND DO NOT       *31500001
028530*             LOAD ON OVERFLOW CONDITION.                        *31510001
028540*----------------------------------------------------------------*31520001
028550*---------------------------------------------------------------* 31530001
028560* THE EXCESS OVER 100 ARE NOT LOADED, AND GIVE RISE             * 31540001
028570* TO MESSAGES AND RELEVANT COUNTS FOR THIS CONDITION WHICH      * 31550001
028580* INFORMATION IS PASSED BACK TO THE CALLING PROGRAM FOR         * 31560001
028590* POSSIBLE EXCEPTION REPORTING.                                 * 31570001
028600*---------------------------------------------------------------* 31580001
028610     MOVE SPACES                 TO CCSS-MCOS-CONSUMER-DATA.      31590001
028620     MOVE ZEROES                 TO CCSS-MCOS-ZIPCODE,            31600001
028630                                    CCSS-MCOS-EXP-ZIPCODE.        31610001
028640                                                                  31620001
028650*----------------------------------------------------------------*31630001
028660* RULES FOR POPULATING THE CONSUMER NAME AND ADDRESS LINES:      *31640001
028670*                                                                *31650001
028680* THIS DATA IS PASSED AS UNPARSED - GET IF FROM THE CDA-         *31660001
028690* UNPARSED FIELDS.                                               *31670001
028700*                                                                *31680001
028710* LOAD SOURCE LINES THAT CONTAIN DATA INTO THE FIRST AVAILABLE   *31690001
028720* OUTPUT LINE FIELD STARTING WITH THE 1ST ADDRESS LINE           *31700001
028730* FIELD; FOR EXAMPLE, OF THE FOUR INPUT FIELDS, IF THE SECOND &  *31710001
028740* FOURTH CONTAIN DATA, AND THE FIRST, AND THIRD ARE ALL BLANK    *31720001
028750* THEN:                                                          *31730001
028760*                                                                *31740001
028770*    - LOAD THE SECOND SOURCE INTO THE FIRST DESTINATION FIELD   *31750001
028780*    - LOAD THE FOURTH SOURCE INTO THE SECOND DESTINATION FIELD  *31760001
028790*                                                                *31770001
028800* THERE ARE FEWER DESTINATION FIELDS THAN AVAILABLE SOURCE       *31780001
028810* FIELDS - IT IS EXPECTED THAT TRADE OUTPUT WILL RECEIVE         *31790001
028820* A MAXIMUM OF FOUR LINES WORTH OF NAME/ADDRESS DATA, AND THAT   *31800001
028830* PUBLIC RECORD WILL RECEIVE A MAXIMUM OF THREE LINES WORTH      *31810001
028840* OF NAME/ADDRESS DATA. ALSO, WHERE THE DESTINATION FIELDS ARE   *31820001
028850* SHORTER THAN THE SOURCE FIELDS, THIS IMPLIES THAT THE          *31830001
028860* MOST DATA WE EXPECT TO RECEIVE IS REFLECTED IN THE LENGTH      *31840001
028870* OF THE CCSS NAME AND ADDRESS DATA FIELDS.                      *31850001
028880*                                                                *31860001
028890* 11/04/93 NEW REQ. - IF SEVERE FAULT WAS FOUND WITH THIS        *31870001
028900* NAME ADDRESS INFO SUCH THAT THE DATA WAS LEFT UNPARSED -       *31880001
028910* DO NOT PASS THE NAME/ADDRESS TO CCSS; LEAVE CORRESPONDING      *31890001
028920* INDICATORS (IF ANY) AT INITIAL DEFAULT OF (O)MITTED.           *31900001
028930*                                                                *31910001
028940* 09/23/94 CORRECTION TO THE ABOVE (RE-IMPLEMENTATION SCB 7)     *31920001
028950* THE ABOVE LEFT JUSTIFICATION PROCESS STARTS AT ADDRESS LINE 1  *31930001
028960* NOT AT THE CONSUMER NAME FIELD; IF CONSUMER NAME IS BLANK,     *31940001
028970* IT STAYS BLANK.                                                *31950001
028980*----------------------------------------------------------------*31960001
028990                                                                  31970001
029000*----------------------------------------------------------------*31980001
029010* WE NEED TO EXTRACT THE NAME BEFORE CHECKING IF THE 100 CONSUMER*31990001
029020* LIMIT IS EXCEEDED IN ORDER THAT WE MAY SEND THE FIRST NAME     *32000001
029030* TO THE OVERFLOW EXCEPTION REPORT IN CASE AN OVERFLOW           *32010001
029040* SITUATION ARISES FOR THE CURRENT TRANSACTION.                  *32020001
029050*----------------------------------------------------------------*32030001
029060*----------------------------------------------------------------*32040001
029070* 4024 - 03/04/96 CHANGE TO MOVE CDA-CONSUMER-NAME TO MCOS FIELD *32050001
029080* ONLY IF NOT A BYPASS REASON CODE EQUAL TO MESSAGE IN ADDRESS.  *32060001
029090* LPISCH.                                                        *32070001
      * ICP 12811 (5/12/03) ALWAYS MOVE THE CDA-CONSUMER-NAME           32071001
029100*----------------------------------------------------------------*32080001
029110     IF CCF-MESSAGE-IN-ADDRESS                                    32090001
              MOVE CDA-CONSUMER-NAME      TO CCSS-MCOS-CONSUMER-NAME    32100001
029120     ELSE                                                         32110001
029130         MOVE SPACES                 TO WS-ADDR-LINES-WORK        32120001
029140         MOVE CDA-FIRST-ADDRESS-LINE TO WS-ADDR (1)               32130001
029150         MOVE CDA-SECOND-ADDRESS-LINE TO WS-ADDR (2)              32140001
029160         MOVE CDA-THIRD-ADDRESS-LINE TO WS-ADDR (3)               32150001
029180         PERFORM 30500-ELIMINATE-BLANK-LINES                      32160001
029190            WITH TEST BEFORE                                      32170001
029200            VARYING ADDR-SUB-1 FROM CNST-VALUE-1 BY CNST-VALUE-1  32180001
029210               UNTIL ADDR-SUB-1 > CNST-MAX-LINES                  32190001
029220               AFTER ADDR-SUB-2 FROM ADDR-SUB-1 BY CNST-VALUE-1   32200001
029230                  UNTIL (ADDR-SUB-2 > CNST-MAX-LINES) OR          32210001
029240                        (WS-ADDR (ADDR-SUB-1) NOT EQUAL SPACES)   32220001
029250         MOVE WS-ADDR (1)            TO CCSS-MCOS-ADDR-LINE-1     32230001
029260         MOVE WS-ADDR (2)            TO CCSS-MCOS-ADDR-LINE-2     32240001
029270         MOVE WS-ADDR (3)            TO CCSS-MCOS-ADDR-LINE-EXTRA 32250001
029280         MOVE CDA-CONSUMER-NAME      TO CCSS-MCOS-CONSUMER-NAME   32260001
029290     END-IF.                                                      32270001
029300*----------------------------------------------------------------*32280001
029310* PER 10/19/93 TRS REVISION TO 4.1.2.16: CHANGE IS - PASS THE    *32290001
029320* NAME OF THE FIRST CONSUMER FOR OVERFLOW EXCEPTION REPORTING;   *32300001
029330* WAS - PASS THE NAME OF THE BASE CONSUMER FOR OVERFLOW          *32310001
029340* EXCEPTION REPORTING.                                           *32320001
029350*----------------------------------------------------------------*32330001
029360     IF WS-TRAN-CNSMR-TOTL EQUAL ZEROES                           32340001
029370         MOVE CCSS-MCOS-CONSUMER-NAME TO WS-SAVE-FIRST-CONSUMER.  32350001
029380*----------------------------------------------------------------*32360001
029390                                                                  32370001
029400     IF WS-OUTPUT-TO-CCSS                                         32380001
029410         ADD CNST-VALUE-1                 TO WS-TRAN-CNSMR-TOTL   32390001
029420         IF WS-TRAN-CNSMR-TOTL > CNST-MAX-CONSUMERS               32400001
029430             CONTINUE                                             32410001
029440         ELSE                                                     32420001
029450             PERFORM 31000-LOAD-CONSUMER                          32430001
029460     ELSE                                                         32440001
029470         PERFORM 31000-LOAD-CONSUMER                              32450001
029480     END-IF.                                                      32460001
029490                                                                  32470001
029500                                                                  32480001
029510******************************************************************32490001
029520 30500-ELIMINATE-BLANK-LINES.                                     32500001
029530******************************************************************32510001
029540*----------------------------------------------------------------*32520001
029550*   30500-ELIMINATE-BLANK-LINES.                                 *32530001
029560*   PERFORMED FROM: 30000-PROCESS-CONSUMER-SEGMENT               *32540001
029570*   PASSED PARAMETER REQUIREMENTS: ADDRESS LINE TABLE LOADED     *32550001
029580*                                  FROM CDA- NAME/ADDRESS FIELDS.*32560001
029590*   FUNCTION: REMOVE ALL BLANK FIELDS BY MOVING NON-BLANK        *32570001
029600*             FIELDS UP TO BEGIN AT THE START OF THE WORK TABLE. *32580001
029610*             PERFORMED ITERATIVELY IN 2 LEVEL NESTED LOOP MODE. *32590001
029620*----------------------------------------------------------------*32600001
029630     IF WS-ADDR (ADDR-SUB-2) NOT EQUAL SPACES                     32610001
029640         MOVE WS-ADDR (ADDR-SUB-2) TO WS-ADDR (ADDR-SUB-1)        32620001
029650         MOVE SPACES TO WS-ADDR (ADDR-SUB-2)                      32630001
029660     END-IF.                                                      32640001
029670 EJECT.                                                           32650001
029680******************************************************************32660001
029690 31000-LOAD-CONSUMER.                                             32670001
029700******************************************************************32680001
029710*----------------------------------------------------------------*32690001
029720*   31000-LOAD-CONSUMER.                                         *32700001
029730*   PERFORMED FROM: 30000-PROCESS-CONSUMER-SEGMENT               *32710001
029740*   PASSED PARAMETER REQUIREMENTS: CONSUMER SEGMENT INPUT DATA   *32720001
029750*                                  FROM LINKAGE (CCLACDA).       *32730001
029760*   FUNCTION: POPULATE DATA FOR 1 CONSUMER SEGMENT INTO THE      *32740001
029770*             PACKAGED CCSS RECORD FORMAT. LOAD THIS SEGMENT     *32750001
029780*             INTO THE NEXT AVAILABLE SLOT OF THE OUTPUT AREA.   *32760001
029790*----------------------------------------------------------------*32770001
029800                                                                  32780001
029810*----------------------------------------------------------------*32790001
029820* SCB FIX 04/15/94: INITITALIZE CONSUMER SEGMENT DATA             32800001
029830* INDICATOR FLAGS TO DEFAULT OF "OMITTED".                        32810001
029840*----------------------------------------------------------------*32820001
029850     SET CCSS-MCOS-SSN-OMITTED,                                   32830001
029860         CCSS-MCOS-BIRTH-DATE-OMITTED,                            32840001
029870         CCSS-MCOS-PHONE-OMITTED,                                 32850001
029880         CCSS-MCOS-RESIDENCE-OMITTED TO TRUE.                     32860001
029890*----------------------------------------------------------------*32870001
029900* PER TRS REQ. 4.1.2.4 - BYPASS ALL EDITING FOR ZIPCODE; THIS    *32880001
029910* WILL BE DONE BY CCSS UPDATE. SO PASS THE RAW DATA ONLY BUT     *32890001
029920* STILL GET IT FROM THE CDA- BECAUSE THE 5 BYTE VALUE IS         *32900001
029930* DESIRED.  (SOME EDITING HAS BEEN PERFORMED).                   *32910001
029940*----------------------------------------------------------------*32920001
           MOVE CDA-ZIP-CODE          TO CCSS-MCOS-ZIPCODE-A.           32930001
030030     MOVE CDA-EXPANDED-ZIP-CODE TO CCSS-MCOS-EXP-ZIPCODE-A.       32940001
030060*----------------------------------------------------------------*32950001
030070* WITH METRO2, THE FOLLOWING VALUES HAVE BEEN ADDED TO GEN CODE  *32960001
030080* AS VALID: 5, 6, 7, 8, AND 9.                                   *32970001
030230*----------------------------------------------------------------*32980001
030280                                                                  32990001
030320     MOVE CDA-GENERATION-CODE TO  CCSS-MCOS-GENERATION-CODE.      33000001
                                                                        33010001
030390     IF CDA-SOCIAL-SECURITY-NUMBER = SPACES                       33020001
030400         MOVE CRF-SOCIAL-SECURITY-NUMBER TO                       33030001
030410              CCSS-MCOS-SSN-ALPHA                                 33040001
030420     ELSE                                                         33050001
030430         MOVE CDA-SOCIAL-SECURITY-NUMBER TO                       33060001
030440              CCSS-MCOS-SSN-ALPHA.                                33070001
030450                                                                  33080001
           IF CDA-OPS13-SSN
           OR CDA-BLANK-SSN
           OR CDA-APPEND-DUPE-SSN
              MOVE SPACES TO CCSS-MCOS-SSN-ALPHA
           END-IF.

           IF  CDA-VALID-SSN                                            33170001
030560         SET CCSS-MCOS-SSN-VALID  TO TRUE                         33200001
030570     ELSE                                                         33210001
               IF CDA-DEFAULT-SSN
               OR CDA-TBL11-SSN
030580             SET CCSS-MCOS-SSN-INVALID  TO TRUE                   33220001
030600         END-IF                                                   33240001
030610     END-IF.                                                      33250001
030620                                                                  33260001
031130     EVALUATE TRUE                                                33270001
               WHEN CCF-BASE-SEG                                        33280001
                   SET CCSS-MCOS-BASE-SEG TO TRUE                       33290001
031140         WHEN CCF-A1-SEG                                          33300001
031150             SET CCSS-MCOS-A1-SEG TO TRUE                         33310001
031160         WHEN CCF-A2-SEG                                          33320001
031170             SET CCSS-MCOS-A2-SEG TO TRUE                         33330001
031180         WHEN CCF-A3-SEG                                          33340001
031190             SET CCSS-MCOS-A3-SEG TO TRUE                         33350001
031180         WHEN CCF-J1-SEG                                          33360001
031190             SET CCSS-MCOS-J1-SEG TO TRUE                         33370001
031180         WHEN CCF-J2-SEG                                          33380001
031190             SET CCSS-MCOS-J2-SEG TO TRUE                         33390001
031200     END-EVALUATE.                                                33400001
031210                                                                  33410001
           IF OPS-03-NEW-METRO                                          33420001
           AND OPS-11-FULL-NAME-ADDRESS
030820         MOVE TDA-PHONE-NUMBER  TO CCSS-MCOS-PHONE-NUMBER         33440001
030830         MOVE TDA-PHONE-NUMBER-FLAG TO                            33450001
030840              CCSS-MCOS-PHONE-NUMBER-CODE                         33460001
           ELSE
030830         MOVE ERC-DATA-INVALID TO CCSS-MCOS-PHONE-NUMBER-CODE     33450001
           END-IF.

           IF OPS-03-NEW-METRO                                          33420001
              OR (CCF-BASE-SEG AND OPS-03-OLD-METRO AND CCF-D1-DATA)    33430001
030860         IF TDA-VALID-DATE-OF-BIRTH                               33470001
                   IF CCF-MINOR-CONSUMER-Y
                      SET CCSS-MCOS-BIRTH-DATE-MINOR TO TRUE
                   ELSE
                      IF OPS-20-DOB-NCAP
                         SET CCSS-MCOS-BIRTH-DATE-NCAP TO TRUE
                      ELSE
                         SET CCSS-MCOS-BIRTH-DATE-VALID TO TRUE
                      END-IF
                   END-IF
030880             MOVE TDA-DATE-OF-BIRTH TO WS-DATE-IN-MMDDCCYY        33490001
030890             SET SLASH-SEPARATOR TO TRUE                          33500001
030900             PERFORM 5A000-FORMAT-DATE                            33510001
030930             MOVE WS-DATE-OUT TO CCSS-MCOS-BIRTH-DATE             33520001
031000         ELSE                                                     33530001
                   IF TDA-INVALID-DATE-OF-BIRTH                         33540001
031020                SET CCSS-MCOS-BIRTH-DATE-INVALID TO TRUE          33550001
031030                IF OPS-03-NEW-METRO                               33560001
031040                    MOVE CRF-BIRTH-DATE                           33570001
031050                                         TO   CCSS-MCOS-BIRTH-DATE33580001
031060                ELSE                                              33590001
031070                    MOVE CRF-DATE-OF-BIRTH                        33600001
031080                                         TO   CCSS-MCOS-BIRTH-DATE33610001
031090                END-IF                                            33620001
                   ELSE
                      IF OPS-03-NEW-METRO AND
                         OPS-20-DOB-BLANK
                         SET CCSS-MCOS-BIRTH-DATE-INVALID TO TRUE
                         MOVE CRF-BIRTH-DATE TO CCSS-MCOS-BIRTH-DATE
                      END-IF
031090             END-IF                                               33630001
031110         END-IF                                                   33640001
031230     END-IF.                                                      33650001
                                                                        33650104
           IF OPS-11-FULL-NAME-ADDRESS                                  33651004
              AND CCF-BASE-SEG                                          33651104
              AND WS-OUTPUT-TO-CCSS                                     33652004
030820        IF OPS-07-PROCESS-H1 AND CCF-H1-DATA                      33653016
                 SET OPTL-EMP-LOAD-PENDING           TO TRUE            33653212
                 MOVE TDA-EMP-NAME      TO  CCSS-MEMP-EMPLOYER          33654016
                 MOVE TDA-EMP-ADDR1     TO  CCSS-MEMP-1ST-ADDRESS       33654116
                 MOVE TDA-EMP-ADDR2     TO  CCSS-MEMP-2ND-ADDRESS       33654216
                 MOVE TDA-EMP-ADDR3     TO  CCSS-MEMP-3RD-ADDRESS       33654317
                 MOVE TDA-EMP-PHONE     TO  CCSS-MEMP-PHONE             33654416
                 MOVE TDA-EMP-ZIP       TO  CCSS-MEMP-ZIP               33654616
                 MOVE TDA-EMP-OCCUPATION TO CCSS-MEMP-OCCUPATION        33654716
                 MOVE TDA-EMP-DATE-HIRED TO CCSS-MEMP-DATE-HIRED        33654916
                 MOVE TDA-EMP-DATE-TRMNTD                               33655116
                                        TO CCSS-MEMP-DATE-TRMNTD        33655213
                 MOVE TDA-EMP-DATE-VERIFIED                             33655316
                                        TO  CCSS-MEMP-DATE-VERIFIED     33655414
                 MOVE TDA-EMP-VERIFY-IND TO CCSS-MEMP-VERIFY-IND        33655516
                 MOVE TDA-EMP-SALARY    TO  CCSS-MEMP-SALARY            33655816
                 MOVE TDA-EMP-PAY-BASIS TO  CCSS-MEMP-PAY-BASIS         33656116
                 MOVE TDA-EMP-SALARY-VERIFY                             33656316
                                        TO  CCSS-MEMP-SALARY-VERIFY     33656408
              ELSE                                                      33656505
                 IF OPS-08-PROCESS-N1 AND CCF-N1-DATA                   33656616
                    SET OPTL-EMP-LOAD-PENDING           TO TRUE         33656712
                    MOVE TDA-EMP-NAME   TO  CCSS-MEMP-EMPLOYER          33657016
                    MOVE TDA-EMP-ADDR1  TO  CCSS-MEMP-1ST-ADDRESS       33657116
                    MOVE TDA-EMP-ADDR2  TO  CCSS-MEMP-2ND-ADDRESS       33657216
                    MOVE TDA-EMP-CITY   TO  CCSS-MEMP-CITY              33657316
                    MOVE TDA-EMP-STATE  TO  CCSS-MEMP-STATE             33657416
                    MOVE TDA-EMP-ZIP    TO  CCSS-MEMP-ZIP               33657516
                    MOVE TDA-EMP-OCCUPATION                             33657616
                                        TO  CCSS-MEMP-OCCUPATION        33657708
                 END-IF                                                 33658005
              END-IF                                                    33659005
031230     END-IF.                                                      33660504
031240*----------------------------------------------------------------*33661004
031250* REQUIREMENT 4.1.2.42:                                           33670001
031260*                                                                 33680001
031270* IF THE RESIDENCE TYPE IS 'O' OR 'R'                             33690001
031280*     SET CORRESPONDING CODE TO VALID                             33700001
031290* ELSE                                                            33710001
031300*     SET CORRESPONDING CODE TO INVALID.                          33720001
031310*----------------------------------------------------------------*33730001
031320*----------------------------------------------------------------*33740001
031330* RESIDENCE TYPE: SINCE THE HANDLING OF THIS IS NEW, THE EDIT    *33750001
031340* RULES EXIST IN THE EDIT MODULES, AND CONFORM TO CCSS           *33760001
031350* REQUIREMENTS - HERE WE JUST MOVE THE DATA ACROSS.              *33770001
031360*----------------------------------------------------------------*33780001
031370     MOVE CDA-RESIDENCE-CODE       TO CCSS-MCOS-RESIDENCE-TYPE.   33790001
031380     MOVE CDA-RESIDENCE-CODE-FLAG  TO CCSS-MCOS-RESIDENCE-CODE.   33800001
031380     MOVE CDA-ADDRESS-INDICATOR    TO CCSS-MCOS-ADDR-IND.         33810001
031390                                                                  33820001
031400     MOVE CDA-ECOA-CODE              TO CCSS-MCOS-ECOA-CODE.      33830001
031410                                                                  33840001
031360*----------------------------------------------------------------*33850001
031360* ICP 11048 BEFORE SETTING THE BANKRUPTCY CODE 9 TO TRUE, NEED   *33860001
031360*           AN ADDITIONAL CHECK TO MAKE SURE IT IS STATUS CODE   *33870001
031360*           11, 12, OR 13                                        *33880001
031360*----------------------------------------------------------------*33890001
           IF OPS-03-OLD-METRO                                          33900001
              SET CCSS-MCOS-REAFFIRM-S TO TRUE                          33910001
              IF TDA-STATUS-BK-REMOVAL-CODE                             33920001
                  SET CCSS-MCOS-BNKRPTCY-9 TO TRUE                      33930001
              END-IF                                                    33940001
              IF TDA-CONSUMER-INFO-IND-2 = SPACES                       33950001
                 CONTINUE                                               33960001
              ELSE                                                      33970001
                 IF TDA-BANKRUPTCY-CII-2                                33980001
                    MOVE TDA-CONSUMER-INFO-IND-2                        33990001
                                     TO CCSS-MCOS-BANKRUPTCY-CODE       34000001
                 ELSE                                                   34010001
                    IF TDA-REAFFIRM-CII-2                               34020001
                       MOVE TDA-CONSUMER-INFO-IND-2                     34030001
                                     TO CCSS-MCOS-REAFFIRM-CODE         34040001
                    ELSE                                                34050001
                       IF TDA-SKIP-CII-2                                34060001
                          MOVE TDA-CONSUMER-INFO-IND-2                  34070001
                                     TO CCSS-MCOS-SKIP-LOCATE-CODE.     34080001
                                                                        34090001
           IF TDA-BANKRUPTCY-CII                                        34100001
           OR (OPS-03-OLD-METRO AND TDA-BANKRUPTCY-CII-67)              34110001
              MOVE TDA-CONSUMER-INFO-IND                                34120001
                                     TO CCSS-MCOS-BANKRUPTCY-CODE       34130001
           ELSE                                                         34140001
              IF TDA-REAFFIRM-CII                                       34150001
                 MOVE TDA-CONSUMER-INFO-IND                             34160001
                                     TO CCSS-MCOS-REAFFIRM-CODE         34170001
              ELSE                                                      34180001
                 IF TDA-SKIP-CII                                        34190001
                    MOVE TDA-CONSUMER-INFO-IND                          34200001
                                     TO CCSS-MCOS-SKIP-LOCATE-CODE.     34210001
031540                                                                  34220001
031550*---------------------------------------------------------------* 34230001
031560* TIME TO INSERT THIS LOADED CONSUMER SEGMENT INTO THE NEXT     * 34240001
031570* AVAILABLE SLOT IN THE OUTPUT AREA.                            * 34250001
031580*---------------------------------------------------------------* 34260001
031590     IF WS-OUTPUT-TO-CCSS                                         34270001
031600         MOVE WS-LAST-MCOS-OFFSET       TO TTY-SEG-OFFSET         34280001
031610         ADD CNST-VALUE-1               TO WS-CNSMR-LOADED-TOTL   34290001
031620         IF WS-CNSMR-LOADED-TOTL EQUAL CNST-VALUE-1               34300001
031630             MOVE CNST-CNSMR-STARTING-COL TO TTY-SEG-OFFSET       34310001
031640         ELSE                                                     34320001
031650             ADD CCSS-MCOS-LENGTH       TO TTY-SEG-OFFSET         34330001
031660         END-IF                                                   34340001
031670         MOVE CCSS-REPORTER-CONSUMER    TO FMT-OUTPUT             34350001
031680              (TTY-SEG-OFFSET : CCSS-MCOS-LENGTH)                 34360001
031690         MOVE TTY-SEG-OFFSET            TO WS-LAST-MCOS-OFFSET    34370001
031700         ADD CNST-VALUE-1              TO CCSS-MTHE-TRAN-SEG-QTY  34380001
031710     END-IF.                                                      34390001
031720                                                                  34400001
031730 EJECT.                                                           34410001
031740******************************************************************34420001
031750 40000-LOAD-OPTIONALS.                                            34430001
031760******************************************************************34440001
031770*----------------------------------------------------------------*34450001
031780*   40000-LOAD-OPTIONALS.                                        *34460001
031790*   PERFORMED FROM: 0B000-CHECK-TRADE-KEY                        *34470001
031800*   PASSED PARAMETER REQUIREMENTS: TRADE KEY CHANGE SEGMENT DATA *34480001
031810*                                  FROM LINKAGE.                 *34490001
031820*   FUNCTION: INVOKE ROUTINE TO POPULATE THE OPTIONAL TRADE      *34500001
031830*             CHANGE SEGMENT E1 ONLY IF IT EXISTS.               *34510001
031840*----------------------------------------------------------------*34520001
031850*   07/15/96: INVOKE ROUTINE TO POPULATE THE OPTIONAL MESSAGE    *34530001
031860*         IN ADDRESS SEGMENT ONLY IF IT EXISTS. ICP 4102  LPISCH *34540001
031870*----------------------------------------------------------------*34550001
031880     IF OPTL-TRCHG-LOAD-PENDING                                   34560001
031890         PERFORM 41000-LOAD-TRADE-CHANGE                          34570001
031900         IF WS-OUTPUT-TO-CCSS                                     34580001
031910             SET OPTL-TRCHG-OUTPUT-PENDING TO TRUE                34590001
031940         END-IF                                                   34620001
031950     END-IF.                                                      34630001
031960                                                                  34640001
031970     IF OPTL-MSG-LOAD-PENDING                                     34650001
031980         PERFORM 42000-LOAD-MESSAGE-SEGMENT                       34660001
031990         IF WS-OUTPUT-TO-CCSS                                     34670001
032000             SET OPTL-MSG-OUTPUT-PENDING TO TRUE                  34680001
032010         ELSE                                                     34690001
032020             SET OPTL-MSG-NO-LOAD        TO TRUE                  34700001
032030         END-IF                                                   34710001
032040     END-IF.                                                      34720001
031960                                                                  34721004
031970     IF OPTL-EMP-LOAD-PENDING                                     34722004
031990         IF WS-OUTPUT-TO-CCSS                                     34724004
032000             SET OPTL-EMP-OUTPUT-PENDING TO TRUE                  34725004
032010         ELSE                                                     34726004
032020             SET OPTL-EMP-NO-LOAD        TO TRUE                  34727004
032030         END-IF                                                   34728004
032040     END-IF.                                                      34729004
032050 EJECT.                                                           34730001
032060******************************************************************34740001
032070 41000-LOAD-TRADE-CHANGE.                                         34750001
032080******************************************************************34760001
032090*----------------------------------------------------------------*34770001
032100*   41000-LOAD-TRADE-CHANGE.                                     *34780001
032110*   PERFORMED FROM: 40000-LOAD-OPTIONALS.                        *34790001
032120*   PASSED PARAMETER REQUIREMENTS: E1 ACCOUNT ID FROM LINKAGE.   *34800001
032130*   FUNCTION: POPULATES THE OPTIONAL TRADE CHANGE SEGMENT.       *34810001
032140*----------------------------------------------------------------*34820001
032150*----------------------------------------------------------------*34830001
032160* RIGHT JUSTIFIED ACCOUNT NUMBER FIELD LEFT JUSTIFIED BLANK      *34840001
032170*----------------------------------------------------------------*34850001
                                                                        34860001
           IF CCF-E1-DATA                                               34870001
              MOVE CNST-VALUE-1-X           TO CCSS-MKCS-CHANGE-IND     34880001
           ELSE                                                         34890001
              IF TDA-CHANGE-BOTH AND                                    34900001
                 TDA-NEW-ACCOUNT-NUMBER = TDA-OLD-ACCOUNT-NUMBER        34910001
                 MOVE CNST-VALUE-2          TO CCSS-MKCS-CHANGE-IND     34920001
              ELSE                                                      34930001
                 IF TDA-CHANGE-BOTH AND                                 34940001
                   (TDA-SUBCODE = TDA-L1SIN)                            34950001
                    MOVE CNST-VALUE-1-X     TO CCSS-MKCS-CHANGE-IND     34960001
                 ELSE                                                   34970001
                    MOVE TDA-ACCTCHG-IND    TO CCSS-MKCS-CHANGE-IND.    34980001
                                                                        34990001
           IF TDA-SUBCODE = TDA-L1SIN                                   35000001
              CONTINUE                                                  35010001
           ELSE                                                         35020001
              IF TDA-CHANGE-SUBCODE                                     35030001
              OR TDA-CHANGE-BOTH                                        35040001
                 MOVE TDA-L1SIN-7-BYTES      TO CCSS-MKCS-NEW-SIN.      35050001
                                                                        35060001
           IF TDA-NEW-ACCOUNT-NUMBER = TDA-OLD-ACCOUNT-NUMBER           35070001
              CONTINUE                                                  35080001
           ELSE                                                         35090001
              IF CCF-E1-DATA                                            35100001
              OR TDA-CHANGE-ACCT-NUMBER                                 35110001
              OR TDA-CHANGE-BOTH                                        35120001
                 PERFORM 41500-FORMAT-NEW-ACCT-NUM.                     35130001
032060******************************************************************35140001
032070 41500-FORMAT-NEW-ACCT-NUM.                                       35150001
032080******************************************************************35160001
032180     MOVE TDA-NEW-ACCOUNT-NUMBER       TO CCSS-MKCS-ACCT-NEW-ID,  35170001
032190                                          FUNC-IN.                35180001
032200     MOVE SPACES                       TO FUNC-OUT.               35190001
032210     MOVE LENGTH OF CCSS-MKCS-ACCT-NEW-ID TO FUNC-IN-LEN.         35200001
032220     MOVE SPACES                       TO WS-ACCT-NUM-IN.         35210001
032230     MOVE +0                           TO WS-ACCT-ZEROS-CNTR.     35220001
           IF OPS-03-OLD-METRO                                          35230001
              MOVE CRF-NEW-ACCOUNT-NUMBER       TO WS-ACCT-NUM-IN       35240001
           ELSE                                                         35250001
              MOVE CRF-L1-NEW-ACCOUNT-NUMBER TO WS-ACCT-NUM-IN.         35260001
032250                                                                  35270001
032260     PERFORM WITH TEST BEFORE                                     35280001
032270        VARYING FIN-IDX FROM CNST-VALUE-1 BY CNST-VALUE-1         35290001
032280           UNTIL (FIN-IDX GREATER THAN FUNC-IN-LEN) OR            35300001
032290                 (FUNC-IN-CHAR (FIN-IDX) NOT EQUAL ZERO)          35310001
032300            CONTINUE                                              35320001
032310     END-PERFORM.                                                 35330001
032320     SET WS-HOLD-FIN-IDX         TO FIN-IDX.                      35340001
032330     SET FOUT-IDX                TO CNST-VALUE-1.                 35350001
032340     PERFORM WITH TEST BEFORE                                     35360001
032350        VARYING FIN-IDX FROM FIN-IDX BY CNST-VALUE-1              35370001
032360           UNTIL (FIN-IDX GREATER THAN FUNC-IN-LEN) OR            35380001
032370                 (FUNC-IN-CHAR (FIN-IDX) EQUAL SPACE)             35390001
032380         MOVE FUNC-IN-CHAR (FIN-IDX) TO                           35400001
032390              FUNC-OUT-CHAR (FOUT-IDX)                            35410001
032400         SET FOUT-IDX UP BY CNST-VALUE-1                          35420001
032410     END-PERFORM.                                                 35430001
032420*----------------------------------------------------------------*35440001
032430* POPULATE ACCT LENGTH FIELD HERE (DATA LENGTH IS FOUT-IDX - 1).  35450001
032440*----------------------------------------------------------------*35460001
032450     SET CCSS-MKCS-ACCT-ID-LEN TO FOUT-IDX.                       35470001
032460     SUBTRACT CNST-VALUE-1     FROM CCSS-MKCS-ACCT-ID-LEN.        35480001
032470*                                                                 35490001
032480*** ICP7089 - 6/26/97 CHECK FOR LEADING ZEROS OPTION              35500001
032490*                                                                 35510001
032500     IF OPS-30-E1-NUM-LENGTH                                      35520001
032510         MOVE OPS-30-LEAD-ZEROS-E1-OPTION TO WS-NEW-ACCT-IN-LEN   35530001
           ELSE                                                         35540001
032500        IF OPS-39-L1-NUM-LENGTH                                   35550001
032510            MOVE OPS-39-LEAD-ZEROS-L1-OPTION                      35560001
032510                                          TO WS-NEW-ACCT-IN-LEN.  35570001
032500     IF  OPS-30-E1-NUM-LENGTH                                     35580001
            OR OPS-39-L1-NUM-LENGTH                                     35590001
032520         COMPUTE WS-ACCT-ZEROS-LEN =                              35600001
032530                (WS-NEW-ACCT-IN-LEN - CCSS-MKCS-ACCT-ID-LEN)      35610001
032540         MOVE SPACES                    TO FUNC-OUT               35620001
032550         SET FOUT-IDX                   TO CNST-VALUE-1           35630001
032560         MOVE +1                        TO WS-ACCT-ZEROS-CNTR     35640001
032570         PERFORM                                                  35650001
032580           UNTIL WS-ACCT-ZEROS-CNTR GREATER THAN WS-ACCT-ZEROS-LEN35660001
032590             MOVE '0'  TO                                         35670001
032600                FUNC-OUT-CHAR (FOUT-IDX)                          35680001
032610             SET FOUT-IDX UP BY CNST-VALUE-1                      35690001
032620             ADD +1          TO WS-ACCT-ZEROS-CNTR                35700001
032630         END-PERFORM                                              35710001
032640     ELSE                                                         35720001
032650       IF  OPS-30-COUNT-ZEROS-E1                                  35730001
032650        OR OPS-39-COUNT-ZEROS-L1                                  35740001
032660           PERFORM                                                35750001
032670             VARYING ACT-IDX FROM CNST-VALUE-1 BY CNST-VALUE-1    35760001
032680              UNTIL (ACT-IDX GREATER THAN WS-NEW-ACCT-IN-LEN) OR  35770001
032690                 (ACCT-IN-CHAR (ACT-IDX) NOT EQUAL SPACES) AND    35780001
032700                 (ACCT-IN-CHAR (ACT-IDX) NOT EQUAL ZERO)          35790001
032710              IF ACCT-IN-CHAR (ACT-IDX) = ZERO                    35800001
032720                  ADD +1 TO WS-ACCT-ZEROS-CNTR                    35810001
032730              END-IF                                              35820001
032740           END-PERFORM                                            35830001
032750           MOVE SPACES                  TO FUNC-OUT               35840001
032760           SET FOUT-IDX                 TO CNST-VALUE-1           35850001
032770           MOVE +1                      TO WS-ACCT-ZEROS-CNTR2    35860001
032780           PERFORM                                                35870001
032790             UNTIL WS-ACCT-ZEROS-CNTR2 > WS-ACCT-ZEROS-CNTR       35880001
032800               MOVE '0'  TO                                       35890001
032810                FUNC-OUT-CHAR (FOUT-IDX)                          35900001
032820               SET FOUT-IDX UP BY CNST-VALUE-1                    35910001
032830               ADD +1          TO WS-ACCT-ZEROS-CNTR2             35920001
032840           END-PERFORM                                            35930001
032850       END-IF                                                     35940001
032860     END-IF.                                                      35950001
032870                                                                  35960001
032880     IF  OPS-30-E1-NUM-LENGTH                                     35970001
032890      OR OPS-39-L1-NUM-LENGTH                                     35980001
032900      OR OPS-30-COUNT-ZEROS-E1                                    35990001
032900      OR OPS-39-COUNT-ZEROS-L1                                    36000001
032910         SET FIN-IDX               TO WS-HOLD-FIN-IDX             36010001
032920         PERFORM WITH TEST BEFORE                                 36020001
032930           VARYING FIN-IDX FROM FIN-IDX BY CNST-VALUE-1           36030001
032940           UNTIL (FIN-IDX GREATER THAN FUNC-IN-LEN) OR            36040001
032950                 (FUNC-IN-CHAR (FIN-IDX) EQUAL SPACE)             36050001
032960           MOVE FUNC-IN-CHAR (FIN-IDX) TO                         36060001
032970              FUNC-OUT-CHAR (FOUT-IDX)                            36070001
032980           SET FOUT-IDX UP BY CNST-VALUE-1                        36080001
032990         END-PERFORM                                              36090001
033000         SET CCSS-MKCS-ACCT-ID-LEN TO FOUT-IDX                    36100001
033010         SUBTRACT CNST-VALUE-1     FROM CCSS-MKCS-ACCT-ID-LEN     36110001
033020     END-IF.                                                      36120001
033030*                                                                 36130001
033040     MOVE FUNC-OUT             TO CCSS-MKCS-ACCT-NEW-ID.          36140001
033050                                                                  36150001
033060 EJECT.                                                           36160001
033070******************************************************************36170001
033080 42000-LOAD-MESSAGE-SEGMENT.                                      36180001
033090******************************************************************36190001
033100*----------------------------------------------------------------*36200001
033110*   07/15/96  ICP 4102 - LPISCH                                  *36210001
033120*   42000-LOAD-MESSAGE-SEGMENT                                   *36220001
033130*   PERFORMED FROM: 40000-LOAD-OPTIONALS.                        *36230001
033140*   PASSED PARAMETER REQUIREMENTS: VALUE OTHER THAN SPACE MUST   *36240001
033150*     RESIDE IN WS-MESSAGE-OUT-FLAG.                             *36250001
033160*   FUNCTION: POPULATES THE OPTIONAL MESSAGE IN ADDRESS SEGMENT. *36260001
033170*----------------------------------------------------------------*36270001
033180     MOVE WS-MESSAGE-OUT-FLAG          TO CCSS-MFLG-MESSAGE-I.    36280001
033190                                                                  36290001
033210******************************************************************36310001
033220 45000-CCSS-WRITE.                                                36320001
033230******************************************************************36330001
033240*----------------------------------------------------------------*36340001
033250*    45000-CCSS-WRITE.                                           *36350001
033260*    PERFORMED FROM: 0A000-GET-TRADE-KEY.                        *36360001
033270*                    10000-CHANGE-TRADE-KEY.                     *36370001
033280*                    11000-CCSS-OUTPUT.                          *36380001
033290*    PASSED PARAMETER REQUIREMENTS: DATA TO WRITE MUST RESIDE IN *36390001
033300*       FMT-OUTPUT; FMT-LEN MUST CONTAIN RECORD LENGTH.          *36400001
033310*    FUNCTION: WRITE A CCSS TRADE RECORD.                        *36410001
033320******************************************************************36420001
           MOVE SPACES              TO WS-SAVE-STATUS.
           MOVE SPACES              TO WS-SAVE-STATUS-I.
033440     MOVE FMT-OUTPUT          TO CCSS-TRADE-RECORD.               36530001
033450                                                                  36540001
033460     WRITE CCSS-TRADE-RECORD.                                     36550001
033470     IF MAIN-HEADER-WRITTEN-Y                                     36560001
033480         ADD +1               TO WS-TRADE-RECORD-COUNT            36570001
033490         SET CCF-CCSS-UPDATE-WRITTEN TO TRUE                      36580001
               MOVE CCSS-MKCS-CHANGE-IND TO CCF-MKCS-TO-FILE-FLAG
           END-IF.
033500                                                                  36590001
033510 EJECT.                                                           36600001
033520******************************************************************36610001
033530 5A000-FORMAT-DATE.                                               36620001
033540******************************************************************36630001
033550*----------------------------------------------------------------*36640001
033560*    5A000-FORMAT-DATE.                                          *36650001
033570*    PERFORMED FROM: 0A000-GET-TRADE-KEY                         *36660001
033580*                    12500-LOAD-TRK-PACKAGE                      *36670001
033590*                    12600-LOAD-TRADE-BASE-PACKAGE               *36680001
033600*    PASSED PARAMETER REQUIREMENTS: SIX BYTE NUMERIC GREGORIAN   *36690001
033610*       DATE IN WS-DATE-IN; A SEPERATOR CHARACTER INDICATOR      *36700001
033620*    FUNCTION: CONVERT MMDDYY DATE FORMAT TO MM/DD/YY.           *36710001
033620*                                                                *36720001
033620**Y2K COMBINED THIS AND 50000-GET-CENTURY TO FORMAT DATE TO      *36730001
033620*              MM/DD/CCYY.                                       *36740001
033620*     REMOVED 50000-GET-CENTURY AND 60000-DATE-ERROR-MSG.        *36750001
033630*----------------------------------------------------------------*36760001
033640                                                                  36770001
033650     MOVE WS-DATE-IN-MM-N            TO WS-DATE-OUT-MO.           36780001
033660     MOVE WS-DATE-FMT-SYMBOL         TO WS-DATE-OUT-SEP-1,        36790001
033670                                        WS-DATE-OUT-SEP-2.        36800001
033680     MOVE WS-DATE-IN-DD-N            TO WS-DATE-OUT-DY.           36810001
033690     MOVE WS-DATE-IN-CC-N            TO WS-DATE-OUT-CENT.         36820001
033700     MOVE WS-DATE-IN-YY-N            TO WS-DATE-OUT-YEAR.         36830001
033710                                                                  36840001
           IF  WS-DATE-OUT-DY NUMERIC AND                               36850001
               ((WS-DATE-OUT-MONTH31 AND WS-DATE-OUT-DAY31)             36860001
           OR  (WS-DATE-OUT-MONTH30 AND WS-DATE-OUT-DAY30)              36870001
           OR  (WS-DATE-OUT-MONTH-FEB AND WS-DATE-OUT-DAY28)            36880001
           OR  (WS-DATE-OUT-MONTH-FEB AND WS-DATE-OUT-DAY29             36890001
                AND WS-DATE-OUT-LEAP-YEAR))                             36900001
                CONTINUE                                                36910001
           ELSE                                                         36920001
033730         MOVE CNST-VALUE-01-X        TO WS-DATE-OUT-DY.           36930001
034270 EJECT.                                                           36940001
034280******************************************************************36950001
034290 55000-RE-INITIALIZE.                                             36960001
034300******************************************************************36970001
034310*----------------------------------------------------------------*36980001
034320*    55000-RE-INITIALIZE.                                        *36990001
034330*    PERFORMED FROM: 10000-CHANGE-TRADE-KEY.                     *37000001
034340*                    11000-CCSS-OUTPUT.                          *37010001
034350*    PASSED PARAMETER REQUIREMENTS: NONE                         *37020001
034360*    FUNCTION: PREPARE AND REINITIALIZE CCSS LAYOUT TO           *37030001
034370*              START LOADING A NEW RECORD.                       *37040001
034380*----------------------------------------------------------------*37050001
034390*----------------------------------------------------------------*37060001
034400* RE-INITIALIZE THE CCSS RECORD PACKAGE LAYOUTS.                 *37070001
034410*----------------------------------------------------------------*37080001
034430     MOVE SPACES                 TO CCSS-MTHS-TRANS-HDR-DATA,     37090001
034440                                    CCSS-MTKS-TRADE-KEY-DATA,     37100001
034450                                    CCSS-MTBS-TRADE-BASE-DATA,    37110001
034460                                    CCSS-MCOS-CONSUMER-DATA,      37120001
034460                                    CCSS-MEMP-EMPLOYMENT-DATA,    37121003
034470                                    CCSS-MFLG-MESSAGE-I,          37130001
034480                                    CCSS-MKCS-KEY-CHANGE-DATA,    37140001
034490                                    WS-SAVE-FIRST-CONSUMER,       37150001
034500                                    FMT-OUTPUT.                   37160001
034510                                                                  37170001
034520     MOVE ZEROES                 TO CCSS-MTBS-BALANCE-AMT,        37180001
034530                                    CCSS-MTBS-CR-LIMIT,           37190001
034540                                    CCSS-MTBS-CHARGE-OFF-AMT,     37200001
034550                                    CCSS-MTBS-HI-BALANCE-AMT,     37210001
034560                                    CCSS-MTBS-PAST-DUE-AMT,       37220001
034570                                    CCSS-MTBS-PAY-AMT,            37230001
034580                                    CCSS-MTBS-TERMS-NUM,          37240001
034580                                    CCSS-MTBS-ACTUAL-PAY-AMT,     37250001
034590                                    CCSS-MTBS-SPCL-PAY-AMT,       37260001
034600                                    CCSS-MCOS-SOCIAL-SEC-NUM,     37270001
034610                                    CCSS-MCOS-ZIPCODE,            37280001
034620                                    CCSS-MCOS-EXP-ZIPCODE,        37290001
034630                                    CCSS-MTHE-TRAN-SEG-QTY,       37300001
034640                                    CCSS-MTKI-ACCT-ID-LEN,        37310001
034650                                    CCSS-MKCS-ACCT-ID-LEN,        37320001
034650                                    CCSS-MKCS-NEW-SIN,            37330001
034660                                    WS-CNSMR-LOADED-TOTL,         37340001
034670                                    WS-LAST-MCOS-OFFSET,          37350001
034680                                    WS-TRAN-CNSMR-TOTL.           37360001
034690                                                                  37370001
034700     MOVE ERC-DATA-IS-OMITTED TO   CCSS-MTKI-VENDOR-ID-I,         37380001
034710                                   CCSS-MTKI-CYCLE-ID-I,          37390001
034720                                   CCSS-MTKI-SIN-NUM-I,           37400001
034730                                   CCSS-MTKI-ACCT-ID-I,           37410001
034740                                   CCSS-MTKI-OPEN-DATE-I,         37420001
034750                                   CCSS-MTKI-ACCT-TYPE-I,         37430001
034760                                   CCSS-MTBI-BALANCE-AMT-I,       37440001
034770                                   CCSS-MTBI-CR-LIMIT-I,          37450001
034780                                   CCSS-MTBI-CHARGE-OFF-AMT-I,    37460001
034790                                   CCSS-MTBI-HI-BAL-AMT-I,        37470001
034800                                   CCSS-MTBI-PAST-DUE-AMT-I,      37480001
034810                                   CCSS-MTBI-PAY-AMT-I,           37490001
034820                                   CCSS-MTBI-PAY-AMT-ID-I,        37500001
034830                                   CCSS-MTBI-STATUS-GRID-I,       37510001
034840                                   CCSS-MTBI-STATUS-CODE-I,       37520001
034850                                   CCSS-MTBI-TERMS-NUM-I,         37530001
034850                                   CCSS-MTBI-ACTUAL-PAY-AMT-I,    37540001
034850                                   CCSS-MTBI-PAY-RATING-I,        37550001
034700                                   CCSS-MTBI-CCC-I,               37560001
                                         CCSS-MTBI-SPCL-CMNT-CD1-I,     37570001
034860                                   CCSS-MTBI-SPCL-CMNT-CD2-I,     37580001
034860                                   CCSS-MTBI-ORIG-SPCL-CMNT-I,    37590001
034870                                   CCSS-MTBI-BALANCE-DATE-I,      37600001
034880                                   CCSS-MTBI-DATE-LAST-PAY-I,     37610001
034890                                   CCSS-MTBI-SPCL-PAY-CODE-I,     37620001
034890                                   CCSS-MTBI-SPCL-PAY-AMT-I,      37630001
034900                                   CCSS-MTBI-SPCL-PAY-DATE-I,     37640001
034700                                   CCSS-MTBI-PORTFOLIO-ID-I,      37650001
034900                                   CCSS-MTBI-SOLD-TO-NAME-I,      37660001
034920                                   CCSS-MTBI-ORIG-CRDR-NAME-I,    37670001
034920                                   CCSS-MTBI-CREDITOR-CLASS-I,    37680001
034950                                   CCSS-MTBI-DATE-REPORTED-I,     37700001
034960                                   CCSS-MTBI-ACTION-DATE-I,       37710001
034960                                   CCSS-MTBI-PROCESS-IND-I,       37720001
034960                                   CCSS-MTBI-INTEREST-IND-I,      37730001
034960                                   CCSS-MTBI-TERMS-FREQ-I,        37740001
034960                                   CCSS-MTBI-SEC-AGCY-ID-I,       37750001
034960                                   CCSS-MTBI-SEC-AGCY-ACCT-I,     37760001
034960                                   CCSS-MTBI-MIN-I.               37770001
                                                                        37780001
034980     SET OPTL-TRCHG-NO-LOAD        TO TRUE.                       37790001
034990     SET OPTL-MSG-NO-LOAD          TO TRUE.                       37800001
034990     SET OPTL-EMP-NO-LOAD          TO TRUE.                       37801004
035000                                                                  37810001
035610 EJECT.                                                           37820001
035620******************************************************************37830001
035630 90000-FIRST-TIME-INIT.                                           37840001
035640******************************************************************37850001
035650*----------------------------------------------------------------*37860001
035660*    90000-FIRST-TIME-INIT.                                      *37870001
035670*    PERFORMED FROM: 10000-CHANGE-TRADE-KEY.                     *37880001
035680*    PASSED PARAMETER REQUIREMENTS: NONE                         *37890001
035690*    FUNCTION: FIRST TIME INITIALIZATIONS & ACCEPT THE SYSTEM    *37900001
035700*              DATE.                                             *37910001
035710*----------------------------------------------------------------*37920001
035720*----------------------------------------------------------------*37930001
035730* DO FIRST TIME ONLY INTIALIZATIONS.                             *37940001
035740*----  GET THE DATE FROM THE SYSTEM INCLUDING THE CENTURY    ----*37950001
035750     MOVE ZEROES                      TO WS-SYS-DATE-AREA.        37960001
035760     MOVE CCF-CURRENT-CENTURY         TO WS-SYS-DATE-CENT.        37970001
035770     MOVE CCF-CURRENT-YEAR-YYMMDD     TO WS-SYS-DATE-YEAR.        37980001
035780     MOVE CCF-CURRENT-MONTH-YYMMDD    TO WS-SYS-DATE-MO.          37990001
035790     MOVE CCF-CURRENT-DAY-YYMMDD      TO WS-SYS-DATE-DY.          38000001
035800     SET PRIOR-REPORTER-EOF-NOT,                                  38010001
035810         TRANS-OUTPUT-UNDETERMINED TO TRUE.                       38020001
035820                                                                  38030001
035830     MOVE SPACES                TO COA-SEG-TOTALS-EXCEPTION-AREA. 38040001
035840                                                                  38050001
035850     MOVE ZEROES                TO COA-TRAN-CSMR-QTY-OVERLIM,     38060001
035860                                   COA-HI-CSMR-PER-TRANS,         38070001
035870                                   COA-SUB-CODE,                  38080001
035880                                   COA-CONSUMER-COUNT.            38090001
035890                                                                  38100001
035900     MOVE LENGTH OF CCSS-REPORTER-TRANS-HDR       TO              38110001
035910                    CCSS-MTHS-LENGTH.                             38120001
035920     MOVE LENGTH OF CCSS-REPORTER-TRADE-KEY       TO              38130001
035930                    CCSS-MTKS-LENGTH.                             38140001
035940     MOVE LENGTH OF CCSS-REPORTER-TRADE-KEY-INDS  TO              38150001
035950                    CCSS-MTKI-LENGTH.                             38160001
035960     MOVE LENGTH OF CCSS-REPORTER-TRADE-BASE      TO              38170001
035970                    CCSS-MTBS-LENGTH.                             38180001
035980     MOVE LENGTH OF CCSS-REPORTER-TRADE-BASE-INDS TO              38190001
035990                    CCSS-MTBI-LENGTH.                             38200001
036000     MOVE LENGTH OF CCSS-REPORTER-CONSUMER        TO              38210001
036010                    CCSS-MCOS-LENGTH.                             38220001
036020     MOVE LENGTH OF CCSS-REPORTER-KEY-CHANGE      TO              38230001
036030                    CCSS-MKCS-LENGTH.                             38240001
036040     MOVE LENGTH OF CCSS-REPORTER-MESSAGE-FLAG TO                 38250001
036050                    CCSS-MFLG-LENGTH.                             38260001
036040     MOVE LENGTH OF CCSS-REPORTER-EMPLOYMENT-DATA TO              38261003
036050                    CCSS-MEMP-LENGTH.                             38262003
036060     MOVE LENGTH OF CCSS-REPORTER-TRANS-HDR-END   TO              38270001
036070                    CCSS-MTHE-LENGTH.                             38280001
036080                                                                  38290001
036090     ADD CNST-VALUE-1,                                            38300001
036100         CCSS-MTHS-LENGTH,                                        38310001
036110         CCSS-MTKS-LENGTH,                                        38320001
036120         CCSS-MTKI-LENGTH,                                        38330001
036130         CCSS-MTBS-LENGTH,                                        38340001
036140         CCSS-MTBI-LENGTH                                         38350001
036150            GIVING CNST-CNSMR-STARTING-COL.                       38360001
036160                                                                  38370001
036170     MOVE CNST-CURR-CCSS-VERSION      TO CCSS-MTHS-VERSION,       38380001
036180                                         CCSS-MTKS-VERSION,       38390001
036190                                         CCSS-MTKI-VERSION,       38400001
036200                                         CCSS-MTBS-VERSION,       38410001
036210                                         CCSS-MTBI-VERSION,       38420001
036220                                         CCSS-MCOS-VERSION,       38430001
036220                                         CCSS-MEMP-VERSION,       38431003
036230                                         CCSS-MKCS-VERSION,       38440001
036240                                         CCSS-MTHE-VERSION.       38450001
036250     MOVE CNST-CUR2-CCSS-VERSION      TO CCSS-MFLG-VERSION.       38460001
036260                                                                  38470001
036270     MOVE CNST-MTHS                   TO CCSS-MTHS-PKG-ID.        38480001
036280     MOVE CNST-MTKS                   TO CCSS-MTKS-PKG-ID.        38490001
036290     MOVE CNST-MTKI                   TO CCSS-MTKI-PKG-ID.        38500001
036300     MOVE CNST-MTBS                   TO CCSS-MTBS-PKG-ID.        38510001
036310     MOVE CNST-MTBI                   TO CCSS-MTBI-PKG-ID.        38520001
036320     MOVE CNST-MCOS                   TO CCSS-MCOS-PKG-ID.        38530001
036320     MOVE CNST-MEMP                   TO CCSS-MEMP-PKG-ID.        38531003
036330     MOVE CNST-MKCS                   TO CCSS-MKCS-PKG-ID.        38540001
036340     MOVE CNST-MFLG                   TO CCSS-MFLG-PKG-ID.        38550001
036350     MOVE CNST-MTHE                   TO CCSS-MTHE-PKG-ID.        38560001
036360                                                                  38570001
036370                                                                  38580001
036380 EJECT.                                                           38590001
036390******************************************************************38600001
036400 9A000-OPEN-OUTPUT-CCSS.                                          38610001
036410******************************************************************38620001
036420*----------------------------------------------------------------*38630001
036430*    9A000-OPEN-OUTPUT-CCSS.                                     *38640001
036440*    PERFORMED FROM: 10000-CHANGE-TRADE-KEY.                     *38650001
036450*    PASSED PARAMETER REQUIREMENTS: NONE                         *38660001
036460*    FUNCTION: OPENS THE CCSS FILE FOR OUTPUT.                   *38670001
036470*----------------------------------------------------------------*38680001
036480     OPEN OUTPUT CCSS-TRADE.                                      38690001
036490                                                                  38700001
036500 EJECT.                                                           38710001
036510******************************************************************38720001
036520 9B000-CLOSE-CCSS.                                                38730001
036530******************************************************************38740001
036540*----------------------------------------------------------------*38750001
036550*    9B000-CLOSE-CCSS.                                           *38760001
036560*    PERFORMED FROM: 00000-MAINLINE.                             *38770001
036570*    PASSED PARAMETER REQUIREMENTS: NONE                         *38780001
036580*    FUNCTION: CLOSES THE CCSS FILE.                             *38790001
036590*----------------------------------------------------------------*38800001
036600     CLOSE CCSS-TRADE.                                            38810001
036610                                                                  38820001
036620 EJECT.                                                           38830001
036630******************************************************************38840001
036640 9C000-WRITE-SORT-INFO.                                           38850001
036650******************************************************************38860001
036660*----------------------------------------------------------------*38870001
036670*    9C000-WRITE-SORT-INFO.                                      *38880001
036680*    PERFORMED FROM: 00000-MAINLINE.                             *38890001
036690*    PASSED PARAMETER REQUIREMENTS: NONE                         *38900001
036700*    FUNCTION: WRITE STATISTICS TO BE USED BY SORT STEP.         *38910001
036710*    02/26/96  ADDED DATE FIELD.  LPISCH                         *38920001
036720*----------------------------------------------------------------*38930001
036730      OPEN OUTPUT SORT-INFO                                       38940001
036740      MOVE SPACES TO  SORT-INFO-RECORD                            38950001
036750      MOVE WS-TRADE-RECORD-COUNT                                  38960001
036760                               TO  SORT-INFO-TRADE-RECORD-COUNT   38970001
036770      ADD +4                   TO  WS-RECORD-LENGTH-SAVE          38980001
036780      MOVE WS-RECORD-LENGTH-SAVE                                  38990001
036790                               TO  SORT-INFO-MAX-RECORD-SIZE      39000001
036800      IF WS-TRADE-RECORD-COUNT = ZERO                             39010001
036810         SET CCF-UPDATE-OUT-N TO TRUE                             39020001
036820         MOVE ZEROES TO SORT-INFO-AVG-RECORD-SIZE                 39030001
036830      ELSE                                                        39040001
036840         SET CCF-UPDATE-OUT-Y TO TRUE                             39050001
036850         COMPUTE SORT-INFO-AVG-RECORD-SIZE =                      39060001
036860         WS-RECORD-LENGTH-TOTAL / WS-TRADE-RECORD-COUNT           39070001
036870      END-IF                                                      39080001
036880      IF CCF-NEW-AHA-DATE-OF-OCCUR = HIGH-VALUES                  39090001
036890          MOVE CCF-PARM-ACTIVITY-DATE TO WS-DATE-IN               39100001
036900          SET SLASH-SEPARATOR    TO TRUE                          39110001
007310          MOVE WS-DATE-IN-MO-N    TO  WS-DATE-IN-MM-N             39120001
007320          MOVE WS-DATE-IN-DY-N    TO  WS-DATE-IN-DD-N             39130001
007330          MOVE WS-DATE-IN-YR-N    TO  WS-DATE-IN-YY-N             39140001
023090          MOVE CCF-PARM-ACTIVITY-CENTURY   TO                     39150001
023090                                      WS-DATE-IN-CC-N             39160001
023090**                                                                39170001
036910          PERFORM 5A000-FORMAT-DATE                               39180001
036940          MOVE WS-DATE-OUT      TO SORT-INFO-DATE                 39190001
037010      ELSE                                                        39200001
037020          MOVE CCF-NEW-AHA-DATE-OF-OCCUR TO SORT-INFO-DATE        39210001
037030      END-IF                                                      39220001
037040      WRITE SORT-INFO-RECORD                                      39230001
037050      CLOSE SORT-INFO.                                            39240001
037060                                                                  39250001
